{
  "name": "Proctor's Skeptical Astrology",
  "description": "A critical examination of astrology based on Richard A. Proctor's 'Myths and Marvels of Astronomy' (1896). Presents traditional astrological concepts alongside their skeptical critiques, exposing the logical fallacies and failed predictions of judicial astrology while acknowledging its historical and linguistic influence.",
  "grammar_type": "astrology",
  "attribution": {
    "source_name": "Myths and Marvels of Astronomy",
    "source_author": "Richard A. Proctor",
    "source_year": "1896",
    "license": "Public Domain",
    "source_url": "https://www.gutenberg.org/ebooks/26556"
  },
  "items": [
    {
      "id": "planet-saturn",
      "name": "Saturn - The Greater Infortune",
      "level": 1,
      "type": "planet",
      "traditional_claim": "The most potent, evil, and malignant of all the planets",
      "proctor_description": "Those born under him are of dark and pale complexion, with small, black, leering eyes, thick lips and nostrils, large ears, thin face, lowering looks, cloudy aspect, and seemingly melancholy and unhappy. The most remarkable and certain characteristic of the Saturnine man is that, as an old author observes, 'he will never look thee in the face.'",
      "significations": "Grandparents, old persons, day labourers, paupers, beggars, clowns, husbandmen of the meaner sort, undertakers, sextons, and gravediggers",
      "chaucer_quote": "Min is the drenching in the sea so wan, / Min is the prison in the derke cote, / Min is the strangel and hanging by the throte... / My loking is the fader of pestilence.",
      "metal": "lead",
      "color": "black",
      "skeptical_note": "Assigned malefic nature arbitrarily; no physical reason why distance should produce evil influence"
    },
    {
      "id": "planet-jupiter",
      "name": "Jupiter - The Greater Fortune",
      "level": 1,
      "type": "planet",
      "traditional_claim": "The most propitious of all the planets",
      "proctor_description": "The native born under his influence has every reason to be jovial in fact as he is by nature. Such a native will be tall and fair, handsome and erect, robust, ruddy, and altogether a good-looking person. The native will also be religious, or at least a good moral honest man.",
      "significations": "Judges, counsellors, church dignitaries from cardinals to curates, scholars, chancellors, barristers, woollendrapers, and clothiers",
      "afflicted_significations": "When afflicted: quacks and mountebanks, knaves, cheats, and drunkards",
      "metal": "tin",
      "color": "mixed red and green",
      "skeptical_note": "Claims of Queen Victoria's fortunate birth when Jupiter was high—yet such predictions are unfalsifiable"
    },
    {
      "id": "planet-mars",
      "name": "Mars - The Lesser Infortune",
      "level": 1,
      "type": "planet",
      "traditional_claim": "Inferior only in malefic influence to Saturn",
      "proctor_description": "The native born under Mars is usually of fierce countenance, his eyes sparkling, or sharp and darting, his complexion fiery or yellowish, and his countenance scarred or furrowed. The Martialist is broad-shouldered, steady, and strong, but short, and often bony and lean.",
      "significations": "Generals, soldiers, sailors (if in watery sign), surgeons, chemists, doctors, armourers, barbers, curriers, smiths, carpenters, bricklayers, sculptors, cooks, and tailors",
      "afflicted_significations": "When afflicted with Mercury or Moon: thieves, hangmen, and 'all cut throat people'",
      "metal": "iron",
      "color": "red",
      "proctor_comparison": "The influence of Saturn may be compared to a lingering but fatal consumption; that of Mars to a burning fever.",
      "skeptical_note": "The blood-red hue of Mars when near the horizon likely suggested its warlike character—mythology shaped astrology, not cosmic truth"
    },
    {
      "id": "planet-sun",
      "name": "The Sun",
      "level": 1,
      "type": "luminary",
      "traditional_claim": "Neither good nor evil in itself, but most powerful when aspected",
      "proctor_description": "The solar native has generally a round face (like pictures of the sun in old books of astronomy), with a short chin; his complexion somewhat sanguine; curling sandy hair, and a white tender skin. As to character, he is bold and resolute, desirous of praise, of slow speech and composed judgment; outwardly decorous, but privately not altogether virtuous.",
      "significations": "Emperors, kings, and titled folk generally, goldsmiths, jewellers, and coiners",
      "afflicted_significations": "When afflicted: pretenders either to power or knowledge",
      "metal": "gold",
      "color": "yellow or yellow-purple",
      "proctor_wit": "The sun is the natural significator of respectability; for which I can discover no reason, unless it be that the sun travelling always in the ecliptic has no latitude, and so solar folk are allowed none.",
      "skeptical_note": "The Sun's actual physical influence through heat and light is real—but astrology conflates this with character determination"
    },
    {
      "id": "planet-venus",
      "name": "Venus - The Lesser Fortune",
      "level": 1,
      "type": "planet",
      "traditional_claim": "Influence in nearly all respects benevolent",
      "proctor_description": "The native of Venus hath a love-dimple in the chin, a lovely mouth, cherry lips, and a right merry countenance. In character the native of Venus is merry 'to a fault,' but of temper engaging, sweet and cheerful.",
      "significations": "Musicians, embroiderers, perfumers, classic modellers, and all who work in elegant attire or administer to the luxuries of the great",
      "afflicted_significations": "When afflicted: the lower orders of the votaries of voluptuousness",
      "metal": "copper",
      "color": "white or purple",
      "proctor_satire": "That her influence is good is shown (in the opinion of Raphael, writing in 1828) by the character of George IV., 'our present beloved monarch'—'a most illustrious proof of the celestial science' (this king being widely known for dissipation).",
      "skeptical_note": "Proctor uses George IV as devastating irony—astrologers praised a notoriously debauched king as proof of Venus's benevolence"
    },
    {
      "id": "planet-mercury",
      "name": "Mercury",
      "level": 1,
      "type": "planet",
      "traditional_claim": "A cold, dry, melancholy star",
      "proctor_description": "The Mercurial is neither dark nor fair, but between both, long-faced, with high forehead and thin sharp nose, 'thin beard (many times none at all),' slender of body, and with small weak eyes; long slender hands and fingers are 'especial marks of Mercury.'",
      "significations": "Astrologers, philosophers, mathematicians, politicians, merchants, travellers, teachers, poets, artificers, men of science, and all ingenious, clever men",
      "afflicted_significations": "When ill affected: pettifoggers, cunning vile persons, thieves, messengers, footmen, and servants",
      "metal": "quicksilver",
      "color": "azure blue",
      "skeptical_note": "The rapid, hard-to-observe motions of Mercury likely suggested its character as messenger and patron of thieves—physical appearance shaped mythology"
    },
    {
      "id": "planet-moon",
      "name": "The Moon",
      "level": 1,
      "type": "luminary",
      "traditional_claim": "Cold, moist, watery, phlegmatic planet, variable to an extreme",
      "proctor_description": "Her natives are of good stature, fair, and pale, moon-faced, with grey eyes, short arms, thick hands and feet, smooth, corpulent and phlegmatic body. When she is in watery signs, the native has freckles on the face, or, says Lilly, 'he or she is blub-cheeked, not a handsome body, but a muddling creature.'",
      "significations": "Sailors (nautical folk generally, not fighting-men), all persons connected with water or any kind of fluid, all engaged in inferior and common offices",
      "metal": "silver",
      "color": "spotted with white and other mixed colours",
      "skeptical_note": "The Moon does exert real tidal influence—but astrologers wrongly extended this to character and fate"
    },
    {
      "id": "planet-uranus",
      "name": "Uranus - The Modern Addition",
      "level": 1,
      "type": "planet",
      "traditional_claim": "Evil effects, always peculiarly strange, unaccountable, and totally unexpected",
      "proctor_description": "He causes the native born under his influence to be of a very eccentric and original disposition, romantic, unsettled, addicted to change, a seeker after novelty. Let all beware of marriage when Uranus is in the seventh house, or afflicting the moon. And in general, let the fair sex remember that Uranus is peculiarly hostile to them, and very evil in love.",
      "proctor_expose": "It is unfortunate for astrology that, despite the asserted careful comparison of events with planetary positions, nothing was ever observed which seemed to suggest the possibility of an unknown planet ruling the affairs of men. Astrologers tell us now that Uranus is a very potent planet; yet the old astrologers seem to have got on very well without him.",
      "false_history": "Raphael claimed Halley and Bradley discovered Uranus through orbital perturbations—'Of course there is not a word of truth in this; Uranus having been discovered by accident long after Halley and Bradley were in the grave.'",
      "skeptical_note": "The post-hoc addition of Uranus exposes astrology's ad-hoc nature—new planets are assigned influences only after discovery"
    },
    {
      "id": "sign-aries",
      "name": "Aries",
      "symbol": "♈",
      "level": 1,
      "type": "sign",
      "traditional_description": "Vernal, dry, fiery, masculine, cardinal, equinoctial, diurnal, movable, commanding, eastern, choleric, violent, and quadrupedalian sign",
      "proctor_description": "Signifies a dry constitution, long face and neck, thick shoulders, swarthy complexion, and a hasty, passionate temper. It governs the head and face. It reigns over England, France, Switzerland, Germany, Denmark, Lesser Poland, Syria, Naples, Capua, Verona.",
      "body_part": "head and face",
      "gender": "masculine",
      "fortune": "fortunate",
      "skeptical_note": "The attribution of nations to signs appears entirely arbitrary"
    },
    {
      "id": "sign-taurus",
      "name": "Taurus",
      "symbol": "♉",
      "level": 1,
      "type": "sign",
      "proctor_description": "Gives to the native a stout athletic frame, broad bull-like forehead, dark curly hair, short neck, and so forth, and a dull apathetic temper, exceedingly cruel and malicious if once aroused. It governs the neck and throat, and reigns over Ireland, Great Poland, part of Russia, Holland, Persia, Asia Minor, the Archipelago, Mantua, Leipsic.",
      "body_part": "neck and throat",
      "gender": "feminine",
      "fortune": "unfortunate",
      "skeptical_note": "Physical descriptions so vague as to match almost anyone"
    },
    {
      "id": "sign-gemini",
      "name": "Gemini",
      "symbol": "♊",
      "level": 1,
      "type": "sign",
      "proctor_description": "The native of Gemini will have a sanguine complexion and tall, straight figure, dark eyes quick and piercing, brown hair, active ways, and will be of exceedingly ingenious intellect. It governs the arms and shoulders, and rules over the south-west parts of England, America, Flanders, Lombardy, Sardinia, Armenia, Lower Egypt, London, Versailles, Brabant.",
      "body_part": "arms and shoulders",
      "gender": "masculine",
      "fortune": "fortunate",
      "london_connection": "The sign Gemini was regarded as especially associated with the fortunes of London—the great fire, the plague, the building of London Bridge, all occurred when this sign was prominent (according to astrologers).",
      "skeptical_note": "Post-hoc reasoning: any major London event can be connected to Gemini after the fact"
    },
    {
      "id": "sign-cancer",
      "name": "Cancer",
      "symbol": "♋",
      "level": 1,
      "type": "sign",
      "proctor_description": "The native will be of fair but pale complexion, round face, grey or mild blue eyes, weak voice, the upper part of the body large, slender arms, small feet, and an effeminate constitution. It governs the breast and the stomach, and reigns over Scotland, Holland, Zealand, Burgundy, Africa, Algiers, Tunis, Tripoli, Constantinople, New York.",
      "body_part": "breast and stomach",
      "gender": "feminine",
      "fortune": "unfortunate"
    },
    {
      "id": "sign-leo",
      "name": "Leo",
      "symbol": "♌",
      "level": 1,
      "type": "sign",
      "proctor_description": "The native will be of large body, broad shoulders, austere countenance, with dark eyes and tawny hair, strong voice, and leonine character, resolute and ambitious, but generous, free, and courteous. Leo governs the heart and back, and reigns over Italy, Bohemia, France, Sicily, Rome, Bristol, Bath, Taunton, Philadelphia.",
      "body_part": "heart and back",
      "gender": "masculine",
      "fortune": "fortunate"
    },
    {
      "id": "sign-virgo",
      "name": "Virgo",
      "symbol": "♍",
      "level": 1,
      "type": "sign",
      "proctor_description": "Its natives are of moderate stature, seldom handsome, slender but compact, thrifty and ingenious. It governs the abdomen, and reigns over Turkey both in Europe and Asia, Greece, and Mesopotamia, Crete, Jerusalem, Paris, Lyons.",
      "body_part": "belly and intestines",
      "gender": "feminine",
      "fortune": "generally unfortunate"
    },
    {
      "id": "sign-libra",
      "name": "Libra",
      "symbol": "♎",
      "level": 1,
      "type": "sign",
      "proctor_description": "The natives are tall and well made, elegant in person, round-faced and ruddy, but plain-featured and 'inclined to eruptions that disfigure the face when old; they are of sweet disposition, just and upright in dealing.' It governs the lumbar regions, and reigns over Austria, Alsace, Savoy, Portugal, Livonia, India, Ethiopia, Lisbon, Vienna, Frankfort, Antwerp, Charleston.",
      "body_part": "lumbar regions",
      "gender": "masculine",
      "fortune": "fortunate"
    },
    {
      "id": "sign-scorpio",
      "name": "Scorpio",
      "symbol": "♏",
      "level": 1,
      "type": "sign",
      "proctor_description": "Its natives are strong, corpulent, and robust, with large bones, 'dark curly hair and eyes' (presumably the eyes dark only, not curly), middle stature, dusky complexion, active bodies; they are usually reserved in speech. It governs the region of the groin, and reigns over Judaea, Mauritania, Catalonia, Norway, West Silesia, Upper Batavia, Barbary, Morocco, Valentia, Messina.",
      "body_part": "generative organs",
      "gender": "feminine",
      "fortune": "unfortunate",
      "proctor_aside": "(It would appear likely, by the way, that astrology was a purely masculine science.)"
    },
    {
      "id": "sign-sagittarius",
      "name": "Sagittarius",
      "symbol": "♐",
      "level": 1,
      "type": "sign",
      "proctor_description": "Its natives are well formed and tall, ruddy, handsome, and jovial, with fine clear eyes, chestnut hair, and oval fleshy face. They are 'generally jolly fellows at either bin or board,' active, intrepid, generous, and obliging. It governs the legs and thighs, and reigns over Arabia Felix, Spain, Hungary, Moravia, Liguria, Narbonne, Cologne, Avignon.",
      "body_part": "thighs",
      "gender": "masculine",
      "fortune": "of course fortunate"
    },
    {
      "id": "sign-capricorn",
      "name": "Capricorn",
      "symbol": "♑",
      "level": 1,
      "type": "sign",
      "proctor_description": "This sign gives to its natives a dry constitution and slender make, with a long thin visage, thin beard (a generally goaty aspect, in fact), dark hair, long neck, narrow chin, and weak knees. It governs, nevertheless, the knees and hams, and reigns over India, Macedonia, Thrace and Greece, Mexico, Saxony, Wilna, Mecklenburgh, Brandenburg, and Oxford.",
      "body_part": "knees",
      "gender": "feminine",
      "fortune": "unfortunate"
    },
    {
      "id": "sign-aquarius",
      "name": "Aquarius",
      "symbol": "♒",
      "level": 1,
      "type": "sign",
      "proctor_description": "Its natives are robust, steady, strong, healthy, and of middle stature; delicate complexion, clear but not pale, sandy hair, hazel eyes, and generally an honest disposition. It governs the legs and ankles, and reigns over Arabia Petraea, Tartary, Russia, Denmark, Lower Sweden, Westphalia, Hamburg, and Bremen.",
      "body_part": "legs and ankles",
      "gender": "masculine",
      "fortune": "fortunate"
    },
    {
      "id": "sign-pisces",
      "name": "Pisces",
      "symbol": "♓",
      "level": 1,
      "type": "sign",
      "proctor_description": "Its natives are short, pale, thick-set, and round-shouldered (like fish), its character phlegmatic and effeminate. It governs the feet and toes, and reigns over Portugal, Spain, Egypt, Normandy, Galicia, Ratisbon, Calabria.",
      "body_part": "feet and toes",
      "gender": "feminine",
      "fortune": "therefore, naturally, unfortunate",
      "proctor_note": "Feminine signs are consistently marked unfortunate—a masculine bias in the 'science'"
    },
    {
      "id": "house-1",
      "name": "First House - The Ascendant",
      "level": 1,
      "type": "house",
      "signification": "Life and Health",
      "proctor_description": "The Ascendant House was the portion rising above the horizon at the east. It was regarded as the House of Life, the planets located therein at the moment of birth having most potent influence on the life and destiny of the native.",
      "linguistic_legacy": "Such planets were said to 'rule the ascendant,' being in the ascending house; and it is from this usage that our familiar expression that such and such an influence is 'in the ascendant' is derived.",
      "angular_type": "angular (first in power)"
    },
    {
      "id": "house-2",
      "name": "Second House",
      "level": 1,
      "type": "house",
      "signification": "Riches",
      "proctor_description": "One-third of the way from the east below the horizon towards the place of the sun at midnight.",
      "angular_type": "succedent"
    },
    {
      "id": "house-3",
      "name": "Third House",
      "level": 1,
      "type": "house",
      "signification": "Kindred and Short Journeys",
      "proctor_description": "The House of Kindred, short journeys, letters, messages, etc. Two-thirds of the way towards the place of the midnight sun.",
      "angular_type": "cadent (weakest)"
    },
    {
      "id": "house-4",
      "name": "Fourth House - The Subterranean",
      "level": 1,
      "type": "house",
      "signification": "Inheritances (Parents)",
      "proctor_description": "The House of Parents, the house which the sun reached at midnight.",
      "angular_type": "angular"
    },
    {
      "id": "house-5",
      "name": "Fifth House",
      "level": 1,
      "type": "house",
      "signification": "Children",
      "proctor_description": "The House of Children and Women, also of all sorts of amusements, theatres, banquets, and merry-making.",
      "angular_type": "succedent"
    },
    {
      "id": "house-6",
      "name": "Sixth House",
      "level": 1,
      "type": "house",
      "signification": "Sickness",
      "proctor_description": "The House of Sickness.",
      "angular_type": "cadent"
    },
    {
      "id": "house-7",
      "name": "Seventh House - The Descendant",
      "level": 1,
      "type": "house",
      "signification": "Marriage",
      "proctor_description": "The House of Love and Marriage, opposite to the first.",
      "angular_type": "angular"
    },
    {
      "id": "house-8",
      "name": "Eighth House",
      "level": 1,
      "type": "house",
      "signification": "Death",
      "proctor_description": "The first house above the horizon, lying to the west, the House of Death.",
      "angular_type": "succedent"
    },
    {
      "id": "house-9",
      "name": "Ninth House",
      "level": 1,
      "type": "house",
      "signification": "Long Journeys (Religion)",
      "proctor_description": "The House of Religion, science, learning, books, and long voyages. Next to the mid-heaven on the west.",
      "angular_type": "cadent"
    },
    {
      "id": "house-10",
      "name": "Tenth House - The Mid-heaven",
      "level": 1,
      "type": "house",
      "signification": "Honor",
      "proctor_description": "The region occupied by the sun at midday, the House of Honour, denoting credit, renown, profession or calling, trade, preferment.",
      "angular_type": "angular"
    },
    {
      "id": "house-11",
      "name": "Eleventh House",
      "level": 1,
      "type": "house",
      "signification": "Friends",
      "proctor_description": "The House of Friends. Next to the mid-heaven on the east.",
      "angular_type": "succedent"
    },
    {
      "id": "house-12",
      "name": "Twelfth House",
      "level": 1,
      "type": "house",
      "signification": "Enemies",
      "proctor_description": "The House of Enemies.",
      "proctor_wit": "Even Lilly himself was indicted in 1655 because he had given judgment respecting stolen goods—apparently the twelfth house, House of Enemies, had caught up with him.",
      "angular_type": "cadent"
    },
    {
      "id": "argument-distance",
      "name": "The Argument from Distance",
      "level": 2,
      "type": "skeptical-argument",
      "source": "Cicero",
      "argument": "What contagion can reach us from the planets, whose distance is almost infinite?",
      "proctor_note": "It is singular that Seneca, who was well acquainted with the uniform character of the planetary motions, seems to have entertained no doubt respecting their influence.",
      "critiques": ["planet-saturn", "planet-jupiter", "planet-mars", "planet-uranus"]
    },
    {
      "id": "argument-twins",
      "name": "The Argument from Twins",
      "level": 2,
      "type": "skeptical-argument",
      "source": "Cicero, Pliny, St. Augustine",
      "argument": "The fortunes and character of Jacob and Esau should manifestly have been similar, which was certainly not the case, if their history has been correctly handed down to us.",
      "potter_wheel_rebuttal": "Nigidius asked an opponent to make two marks on a spinning potter's wheel—when stopped, the marks were far apart. St. Augustine says justly that the argument of Nigidius was as fragile as the ware made on the potter's wheel.",
      "critiques": ["house-1", "sign-aries", "sign-taurus"]
    },
    {
      "id": "argument-copernican",
      "name": "The Copernican Challenge",
      "level": 2,
      "type": "skeptical-argument",
      "source": "Proctor's analysis",
      "argument": "It is indeed clear that the first real shock sustained by astrology came from the arguments of Copernicus. So long as the earth was regarded as the centre round which all the celestial bodies move, it was hopeless to attempt to shake men's faith in the influences of the stars.",
      "proctor_observation": "So far as I know, there is not a single instance of a believer in the old Ptolemaic system who rejected astrology absolutely.",
      "critiques": ["planet-sun", "planet-saturn", "planet-jupiter", "planet-mars"]
    },
    {
      "id": "argument-failed-predictions",
      "name": "The Argument from Failed Predictions",
      "level": 2,
      "type": "skeptical-argument",
      "source": "Cicero via Gassendi",
      "argument": "The Chaldaeans predicted that Caesar, Crassus, and Pompey would die 'in a full old age, in their own houses, in peace and honour,' whose deaths, nevertheless, were 'violent, immature, and tragical.'",
      "cardan_case": "Cardan pretended to describe the fates of his children in his voluminous commentaries, yet all the while never suspected, from the rules of his great art, that his dearest son would be condemned to be beheaded for poisoning his own wife.",
      "critiques": ["house-8", "planet-saturn", "planet-mars"]
    },
    {
      "id": "argument-prince-wales",
      "name": "The Prince of Wales Predictions",
      "level": 2,
      "type": "skeptical-argument",
      "source": "Proctor's contemporary analysis",
      "argument": "Zadkiel predicted the Prince should be injured by a horse and receive a blow on the left side of the head near the ear in May 1870—'but reprehensibly omitted both these ceremonies.'",
      "contradictory_traits": "The prince was predicted to be: 'avaricious' AND 'generous (three times)', 'careless' AND 'careful of his person', 'parsimonious' AND 'liberal', 'modest' AND 'lofty', 'prudent' AND 'rash', 'unreserved' AND 'reserved', 'constant' AND 'variable'...",
      "proctor_conclusion": "Always, whether predictions succeed or fail, astrologers claim vindication.",
      "critiques": ["planet-jupiter", "planet-saturn", "sign-sagittarius"]
    },
    {
      "id": "argument-methodology",
      "name": "The Argument from Inconsistent Methods",
      "level": 2,
      "type": "skeptical-argument",
      "source": "Proctor's analysis of astrological systems",
      "argument": "The Arabian, Ptolemaic, and Placidian systems give entirely different results, yet astrologers claim all are correct—'each leads to TRUE results.' All which, though plausible in tone, labours under the disadvantage of being untrue.",
      "astrologer_defense": "They may be compared to the ascent of a mountain by different paths, where they notwithstanding all lead to the same object.",
      "proctor_response": "This labours under the disadvantage of being untrue.",
      "critiques": ["house-1", "house-10", "planet-moon"]
    },
    {
      "id": "argument-uranus-addition",
      "name": "The Post-Hoc Addition of Uranus",
      "level": 2,
      "type": "skeptical-argument",
      "source": "Proctor",
      "argument": "It is unfortunate for astrology that nothing was ever observed which seemed to suggest the possibility of an unknown planet. Astrologers tell us now that Uranus is a very potent planet; yet the old astrologers seem to have got on very well without him.",
      "false_history_exposed": "Raphael claimed Uranus was discovered through perturbation analysis by Halley and Bradley—'Of course there is not a word of truth in this.'",
      "critiques": ["planet-uranus"]
    },
    {
      "id": "bacon-sana-astrology",
      "name": "Bacon's Astrologia Sana",
      "level": 2,
      "type": "historical-critique",
      "source": "Francis Bacon",
      "description": "Bacon's proposed 'sound and just astrology' that rejected horoscopes and houses while retaining belief in some celestial influence",
      "bacon_rejects": "The horary reign of the planets, the doctrine of horoscopes, the distribution of houses, calculation of nativities, and 'good or bad hours of business'—'mere levities, that have little in them of certainty and solidity'",
      "bacon_retains": "Greater revolutions, effects on masses rather than individuals, celestial operations over large portions of time and space",
      "proctor_assessment": "The astrology thus regarded by Bacon as sane and just did not differ, as to its primary object, from the false systems which now seem to us so absurd.",
      "composite_of": ["planet-sun", "planet-moon", "planet-saturn", "planet-jupiter", "planet-mars"]
    },
    {
      "id": "week-origin",
      "name": "The Astrological Origin of the Week",
      "level": 2,
      "type": "linguistic-legacy",
      "description": "The seven-day week derives from assigning each hour to a planet in order of distance",
      "proctor_explanation": "Every hour had its planet. Dividing twenty-four by seven, we get three and three over; whence the first hour of each day belongs to: Saturn (Saturday), Sun (Sunday), Moon (Monday), Mars (Tuesday/Tuisco's day), Mercury (Wednesday/Woden's day), Jupiter (Thursday/Thor's day), Venus (Friday/Freya's day).",
      "whewell_quote": "The usage is found over all the East; it existed among the Arabians, Assyrians, and Egyptians. The same week is found in India, among the Brahmins... the Quakers, in rejecting these names of days, have cast aside the most ancient existing relic of astrological as well as idolatrous superstition.",
      "composite_of": ["planet-saturn", "planet-sun", "planet-moon", "planet-mars", "planet-mercury", "planet-jupiter", "planet-venus"]
    },
    {
      "id": "sabbath-origin",
      "name": "The Astrological Origin of the Sabbath",
      "level": 2,
      "type": "linguistic-legacy",
      "description": "The Sabbath as Saturn's day of rest, derived from Chaldaean astrology",
      "proctor_argument": "Among the Egyptians the Sabbath or Saturn's day was a day of rest because of the malignant nature of the powerful planet-deity who presided over that day. The Jews descended from the old Chaldaeans, among whom (as appears from stone inscriptions recently discovered) the very word Sabbath was in use for a seventh day of rest connected with astrological observances.",
      "composite_of": ["planet-saturn", "house-12"]
    },
    {
      "id": "mysticism-critique",
      "name": "The Critique of Mysticism",
      "level": 2,
      "type": "philosophical-argument",
      "source": "Whewell via Proctor",
      "description": "The fundamental error of astrological thinking",
      "whewell_quote": "For many ages 'mysticism in its various forms was a leading character both of the common mind and the speculations of the most intelligent and profound reasoners.' Thus mysticism was the opposite of that habit of thought which science requires, 'namely, clear ideas, distinctly employed to connect well-ascertained facts.'",
      "proctor_application": "The lesson learned respecting erroneous doctrines which were once widely prevalent has its application in our time, when, though the influence of those teachings has passed away, other doctrines formerly associated with them still hold their ground."
    },
    {
      "id": "l3-planets",
      "name": "The Planets",
      "level": 3,
      "type": "meta-category",
      "description": "The seven classical planets plus Uranus, with their traditional claims and skeptical critiques",
      "contains": ["planet-saturn", "planet-jupiter", "planet-mars", "planet-sun", "planet-venus", "planet-mercury", "planet-moon", "planet-uranus"]
    },
    {
      "id": "l3-signs",
      "name": "The Zodiacal Signs",
      "level": 3,
      "type": "meta-category",
      "description": "The twelve signs with Proctor's sardonic descriptions of their supposed influences",
      "proctor_note": "The descriptions are so vague as to match almost anyone, and the assignment of nations to signs appears entirely arbitrary",
      "contains": ["sign-aries", "sign-taurus", "sign-gemini", "sign-cancer", "sign-leo", "sign-virgo", "sign-libra", "sign-scorpio", "sign-sagittarius", "sign-capricorn", "sign-aquarius", "sign-pisces"]
    },
    {
      "id": "l3-houses",
      "name": "The Twelve Houses",
      "level": 3,
      "type": "meta-category",
      "description": "The mundane houses—an invention Bacon himself rejected as 'idle figment'",
      "bacon_rejection": "We reject as an idle figment the doctrine of horoscopes, and the distribution of the houses, though these are the darling inventions of astrology, which have kept revel, as it were, in the heavens.",
      "contains": ["house-1", "house-2", "house-3", "house-4", "house-5", "house-6", "house-7", "house-8", "house-9", "house-10", "house-11", "house-12"]
    },
    {
      "id": "l3-skeptical-arguments",
      "name": "Skeptical Arguments Against Astrology",
      "level": 3,
      "type": "meta-category",
      "description": "The accumulated rational objections to judicial astrology from Cicero to Proctor",
      "contains": ["argument-distance", "argument-twins", "argument-copernican", "argument-failed-predictions", "argument-prince-wales", "argument-methodology", "argument-uranus-addition", "mysticism-critique"]
    },
    {
      "id": "l3-legacies",
      "name": "Linguistic and Cultural Legacies",
      "level": 3,
      "type": "meta-category",
      "description": "The traces astrology has left in language, calendar, and culture—evidence of its former influence",
      "proctor_note": "Astrological terminology came to form a part of ordinary language, insomuch that it is impossible rightly to understand many passages of ancient and mediaeval literature without recognising the significance of astrological teachings.",
      "contains": ["week-origin", "sabbath-origin", "bacon-sana-astrology"]
    }
  ]
}
