{
  "name": "Emerald Death Card: No One Here Gets Out Alive",
  "description": "A visual and contemplative journey through death traditions, mythology, and transformation. Based on The Emerald podcast episode 'No One Here Gets Out Alive' (Sep 17, 2022), this sequence explores death through Ancient Egyptian funerary texts, Tibetan Bardo practices, Japanese death poems, the Epic of Gilgamesh, and the ecological cycling of matter. Death is not something to flee from, but something to navigate—to practice while alive. As the podcast asks: Will we crumble or will we soar? We will both crumble and soar.",
  "cover_image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Papyrus_of_Ani_(frame_3).jpg",
  "tags": [
    "death",
    "transformation",
    "mythology",
    "egyptian",
    "tibetan"
  ],
  "grammar_type": "custom",
  "items": [
    {
      "id": "emerald-death-01",
      "name": "Opening: The Universal Passage",
      "level": 1,
      "category": "threshold",
      "sections": {
        "Summary": "Death is universal, an undeniable fact of existence that every single one of our ancestors faced, just as we will.",
        "Meditation": "Good morning, we're all gonna die. There's no getting around it. Last time I checked the mortality rate is 100%. Exercise regularly, eat sensibly, die anyway.",
        "Reflection": "What is born, will die. What has been gathered will be dispersed. What has been accumulated will be exhausted. What has been built up will collapse. And what has been high will be brought low."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/RWS_Tarot_13_Death.jpg",
      "sort_order": 1,
      "metadata": {
        "theme": "universality",
        "source": "Rider-Waite-Smith Death Card",
        "podcast_timestamp": "00:00"
      }
    },
    {
      "id": "emerald-death-02",
      "name": "The Skeleton Reaper: Death Has No Mercy",
      "level": 1,
      "category": "threshold",
      "sections": {
        "Summary": "Death comes for everyone. Relentless, persistent, he spares no one.",
        "Meditation": "A woman, Kisa Gotami, comes to the Buddha, distraught over the death of her child. Bring me a mustard seed, the Buddha says, from a household that has never known death and I'll bring him back to life. She goes from house to house. She can't find one.",
        "Reflection": "Every family, every household comes to know death. How much more vivid, more raw, more visceral, more present, more undeniable is death for people who have no ability to shut death away?"
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Holbein-death.png",
      "sort_order": 2,
      "metadata": {
        "theme": "inevitability",
        "source": "Dance of Death / Totentanz imagery (public domain)"
      }
    },
    {
      "id": "emerald-death-03",
      "name": "Vanitas: All Things Must Pass",
      "level": 1,
      "category": "impermanence",
      "sections": {
        "Summary": "Everything you've ever known, everything you've ever loved, everything you've ever earned or accumulated will all be left behind.",
        "Meditation": "The house, the car, the sofa, the clothes, the phone. You won't get to know what happens with your favorite sports team. You won't know the end of the story. All of those precious opinions—gone.",
        "Reflection": "Your ability to participate in the conversation: gone. All the hot takes, all the personal perspective: gone, gone beyond."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Pieter_Claesz,_Still_Life_with_a_Skull_and_a_Writing_Quill.jpg",
      "sort_order": 3,
      "metadata": {
        "theme": "letting-go",
        "source": "Pieter Claesz - Vanitas Still Life (1630, public domain)",
        "artist": "Pieter Claesz"
      }
    },
    {
      "id": "emerald-death-04",
      "name": "The Tibetan Wheel: Elemental Dissolution",
      "level": 1,
      "category": "tibetan",
      "sections": {
        "Summary": "Element by element all is stripped away. Earth into water, water into fire, fire into air, air into ether, ether into raw, naked, self-luminous consciousness.",
        "Meditation": "The internal earth element comprises flesh and bone. As an indication of its dissolution, the body will grow heavy, and its skin will sag towards the ground. One will feel the body is sinking into the earth.",
        "Reflection": "The internal water element comprises blood and serum. Saliva and nasal mucus will be secreted, while the throat and tongue become dry. The warmth of the body will slip away, and consciousness will oscillate between clarity and dullness."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/The_wheel_of_life,_Trongsa_dzong.jpg",
      "sort_order": 4,
      "metadata": {
        "theme": "bardo",
        "source": "Tibetan Wheel of Life (Bhavacakra)",
        "tradition": "Tibetan Buddhism"
      }
    },
    {
      "id": "emerald-death-05",
      "name": "Yama: Lord of Death",
      "level": 1,
      "category": "tibetan",
      "sections": {
        "Summary": "Oh child of awakened nature, that which is called death has now arrived. You are leaving this world, but in this you are not alone. This happens to everyone.",
        "Meditation": "Do not cling to this life. Even if you remain attached and clinging, you do not have the power to stay. You'll only continue to roam within the cycles of existence.",
        "Reflection": "The young Nachiketas journeys to the realm of the dead and has the audacity to ask the lord of death Yama himself the great question: Is there indeed a life beyond death?"
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Yama_tibet.jpg",
      "sort_order": 5,
      "metadata": {
        "theme": "surrender",
        "source": "Tibetan thangka of Yama",
        "tradition": "Tibetan Buddhism"
      }
    },
    {
      "id": "emerald-death-08",
      "name": "Papyrus of Ani: Weighing of the Heart",
      "level": 1,
      "category": "egyptian",
      "sections": {
        "Summary": "For Ancient Egyptians, death was not something to run from, but something to actively embrace, as acolytes regularly plunged into the intermediary state.",
        "Meditation": "Say the words: the eye in you is your child, the Falcon. The great ones tremble when they see you rise with the book in your hand into the realm of stars.",
        "Reflection": "Here's the one who was washed in the field of rushes, pure as the light in the field of rushes. The field of rushes is the stars, the starry sky."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/BD_Hunefer.jpg",
      "sort_order": 8,
      "metadata": {
        "theme": "judgment",
        "source": "Papyrus of Hunefer - Weighing of the Heart (c. 1275 BCE)",
        "tradition": "Ancient Egypt"
      }
    },
    {
      "id": "emerald-death-09",
      "name": "Anubis: Guide of the Dead",
      "level": 1,
      "category": "egyptian",
      "sections": {
        "Summary": "O great jackal Anubis, show me the road through the darkness. I have passed through this door into nothing. Nothing grows and nothing dies. All that was and would be is.",
        "Meditation": "The serpent is the spinal cord and the branching nervous system. The corpse contains the serpent—the white serpentine spinal cord, the source of the body's movement, electricity and sense perception.",
        "Reflection": "At death, the serpent guides the dying to leave the tree, to rise up as a white bird, purified energy, leaving the tree of the body behind."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Anubis_attending_the_mummy_of_Sennedjem.jpg",
      "sort_order": 9,
      "metadata": {
        "theme": "guidance",
        "source": "Anubis attending the mummy",
        "tradition": "Ancient Egypt"
      }
    },
    {
      "id": "emerald-death-10",
      "name": "Osiris Enthroned",
      "level": 1,
      "category": "egyptian",
      "sections": {
        "Summary": "What is Osiris? Osiris is anyone as a rotting corpse. Osiris is the life in all things, plant and animal. The dead thing is life.",
        "Meditation": "Osiris as a word is the seat of the eye—the seat of consciousness. Words are the living green sprout rising from the dead body of Osiris.",
        "Reflection": "You are the Child of the earth, this is what Osiris gives you. You are the Brother of the Sky and this is what Osiris gives you. You are the Brother of Wild Nature."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Standing_Osiris_edit1.svg",
      "sort_order": 10,
      "metadata": {
        "theme": "resurrection",
        "source": "Osiris standing",
        "tradition": "Ancient Egypt"
      }
    },
    {
      "id": "emerald-death-11",
      "name": "The Ba-Bird: Soul in Flight",
      "level": 1,
      "category": "egyptian",
      "sections": {
        "Summary": "The Falcon flies. What remains of him? The Falcon flies. What remains of him now?",
        "Meditation": "The bird, the Falcon evokes layers and layers of meaning. It is at once the vivid, newly freed motion of the infant child of the dead body, the wild energy that rises from the shell of the corpse back into the sky.",
        "Reflection": "As it leaves the body at death, this serpentine current of energy is thrown out. Rising like a bird, it becomes pure, rising light."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Egyptian_-_Ba_Bird_-_Walters_571472.jpg",
      "sort_order": 11,
      "metadata": {
        "theme": "soul-flight",
        "source": "Ba-Bird amulet, Walters Art Museum",
        "tradition": "Ancient Egypt"
      }
    },
    {
      "id": "emerald-death-12",
      "name": "The Field of Reeds (Aaru)",
      "level": 1,
      "category": "egyptian",
      "sections": {
        "Summary": "The field of rushes—the reeds along the banks of the Nile River—but the field of rushes is the stars, the starry sky.",
        "Meditation": "The Falcon rises into the starry sky where Isis, the great mother, the womb of the sky, offers him her breasts so that he may drink the milky white light of the stars and never thirst or hunger again.",
        "Reflection": "The initiate merges with the mother in order to be reborn. The mother is the sky, the child, the spirit, the Falcon is the rising star."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Maler_der_Grabkammer_des_Sennudem_001.jpg",
      "sort_order": 12,
      "metadata": {
        "theme": "paradise",
        "source": "Tomb of Sennedjem - Field of Reeds",
        "tradition": "Ancient Egypt"
      }
    },
    {
      "id": "emerald-death-13",
      "name": "YouTube: Pyramid Texts Reading",
      "level": 1,
      "category": "video-reference",
      "sections": {
        "Summary": "The pyramid texts are among the oldest religious texts in the world, inscribed on the walls of pyramids.",
        "Description": "Say the words the pyramid texts command over and over again. And the hieroglyph for 'say', for 'speak', is a serpent. A river, a tongue—transmit the energy it is saying."
      },
      "image_url": "https://i.ytimg.com/vi/4jEad6zxaFk/maxresdefault.jpg",
      "sort_order": 13,
      "metadata": {
        "item_type": "video",
        "youtube_url": "https://www.youtube.com/watch?v=4jEad6zxaFk",
        "youtube_video_id": "4jEad6zxaFk",
        "video_title": "The Pyramids of Egypt - How & Why They Were Built (Pyramid Texts)",
        "theme": "funerary-texts"
      }
    },
    {
      "id": "emerald-death-14",
      "name": "YouTube: Egyptian Book of the Dead Explained",
      "level": 1,
      "category": "video-reference",
      "sections": {
        "Summary": "The Book of the Dead is a collection of spells designed to guide the deceased through the afterlife.",
        "Description": "Words of death are meant to be spoken, sung poetry, for how else to invoke the crossing over of one being into the vastness."
      },
      "image_url": "https://i.ytimg.com/vi/1yv_MXNYbAo/maxresdefault.jpg",
      "sort_order": 14,
      "metadata": {
        "item_type": "video",
        "youtube_url": "https://www.youtube.com/watch?v=1yv_MXNYbAo",
        "youtube_video_id": "1yv_MXNYbAo",
        "video_title": "The Egyptian Book of the Dead - TED-Ed",
        "theme": "book-of-dead"
      }
    },
    {
      "id": "emerald-death-15",
      "name": "Gilgamesh: The Quest for Immortality",
      "level": 1,
      "category": "mesopotamian",
      "sections": {
        "Summary": "The Epic of Gilgamesh is a story of deep agitation about death—the search for immortality, but really the consequences that arise when one is driven by anxiousness around death.",
        "Meditation": "Gilgamesh is half man, half god. The mortal Gilgamesh witnesses death firsthand. His dear friend Enkidu is slain and Gilgamesh is propelled forward on a journey to find the cure for death.",
        "Reflection": "Driven by agitation he misses all the cues and signs along the way that would point him to true immortality. How can the distracted and agitated find immortality? When immortality is right here in the nectars of the present moment."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Hero_lion_Dur-Sharrukin_Louvre_AO19862.jpg",
      "sort_order": 15,
      "metadata": {
        "theme": "immortality-quest",
        "source": "Hero overpowering a lion (Gilgamesh), Dur-Sharrukin, Louvre",
        "tradition": "Mesopotamia"
      }
    },
    {
      "id": "emerald-death-16",
      "name": "The Serpent Steals Immortality",
      "level": 1,
      "category": "mesopotamian",
      "sections": {
        "Summary": "Gilgamesh finds the plant of immortality, but lets it out of his sight for just one moment. A serpent snatches it, swallows it, sheds its skin before his eyes, and disappears.",
        "Meditation": "How many rapturous moments have we squandered when we're already planning what to do with them after? Gilgamesh has it in his hands, and he's like, 'I'm going to go test this on someone else.'",
        "Reflection": "The elixir of immortality is not material. It is instead the stripping away of the distractions of the self in favor of union with the greater world."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Cylinder_seal_serpent.jpg",
      "sort_order": 16,
      "metadata": {
        "theme": "lost-immortality",
        "source": "Mesopotamian cylinder seal with serpent motif",
        "tradition": "Mesopotamia"
      }
    },
    {
      "id": "emerald-death-17",
      "name": "YouTube: Epic of Gilgamesh Lecture",
      "level": 1,
      "category": "video-reference",
      "sections": {
        "Summary": "Academic exploration of the world's oldest epic and its meditation on mortality.",
        "Description": "Life which you look for, Utnapishtim tells Gilgamesh, you will never find. For when the gods created human beings, they let death be their share and life they withheld in their own hands."
      },
      "image_url": "https://i.ytimg.com/vi/BV9t3Cp18Rc/maxresdefault.jpg",
      "sort_order": 17,
      "metadata": {
        "item_type": "video",
        "youtube_url": "https://www.youtube.com/watch?v=BV9t3Cp18Rc",
        "youtube_video_id": "BV9t3Cp18Rc",
        "video_title": "TED-Ed: The Epic of Gilgamesh - The King Who Tried to Conquer Death",
        "theme": "gilgamesh"
      }
    },
    {
      "id": "emerald-death-18",
      "name": "Persephone's Descent",
      "level": 1,
      "category": "greek",
      "sections": {
        "Summary": "The Eleusinian initiation was a death experience. To meet the goddess herself as simultaneously the virginal maiden and the queen of the dead, one had to ritually die.",
        "Meditation": "The full vision of the mother goddess required one to die. Through trans-inducing repetition, exhaustion, deprivation, darkness—the ritual replicated the death experience.",
        "Reflection": "Death is a consummation, death is its own type of marriage, in which that which has been its own separate thing is returned to the whole at last."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/NAMA_Triade_éleusinienne.jpg",
      "sort_order": 18,
      "metadata": {
        "theme": "initiation",
        "source": "Eleusinian Relief - Demeter, Persephone, Triptolemus",
        "tradition": "Greek Mysteries"
      }
    },
    {
      "id": "emerald-death-19",
      "name": "Japanese Death Poem: Dew on Grass",
      "level": 1,
      "category": "japanese",
      "sections": {
        "Summary": "For the Japanese poet or monk, it was expected that the dying person would compose a death poem close to the hour of their passing—a verse that encapsulated the state of their being at that moment.",
        "Meditation": "Farewell, said Bonza on his deathbed. I pass as all things do. Dew on the grass. That was me—dew on the grass. Dew on the grass, steam in the air. Space, light, moisture. There I was.",
        "Reflection": "Would we have the poise and lucidity to compose such a poem? What would it say? What will your death poem be?"
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Hiroshige-53-Stations-Hoeido-46-Shono-MFA-01.jpg",
      "sort_order": 19,
      "metadata": {
        "theme": "impermanence",
        "source": "Hiroshige - 53 Stations (rain/mist imagery)",
        "tradition": "Japanese Buddhism"
      }
    },
    {
      "id": "emerald-death-20",
      "name": "Death Poem: Empty-Handed",
      "level": 1,
      "category": "japanese",
      "sections": {
        "Summary": "Empty-handed, I entered the world. Barefoot, I leave it. My coming, my going—two simple happenings that got mixed up somehow.",
        "Meditation": "I long for people. Then again, I despise them. End of autumn.",
        "Reflection": "Oh, sacred spirit, let us set out for the western skies. Let us set out for the western skies."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Hiroshige,_The_moon_over_a_waterfall.jpg",
      "sort_order": 20,
      "metadata": {
        "theme": "release",
        "source": "Hiroshige - Moon over a Waterfall",
        "tradition": "Japanese Buddhism"
      }
    },
    {
      "id": "emerald-death-21",
      "name": "Death Poem: Turtle Drying Its Shell",
      "level": 1,
      "category": "japanese",
      "sections": {
        "Summary": "Island of eternity. A turtle dries its shell out in the first sun rays of the year.",
        "Meditation": "Can you feel it? The turtle's shell drying. The water of life evaporating into sun rays. What is the feeling of evaporating at last into the sun?",
        "Reflection": "Have you felt all you knew of yourself melting into the sun at last?"
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Kuniyoshi_Utagawa,_Turtle.jpg",
      "sort_order": 21,
      "metadata": {
        "theme": "dissolution",
        "source": "Utagawa Kuniyoshi - Turtles",
        "tradition": "Japanese Buddhism"
      }
    },
    {
      "id": "emerald-death-22",
      "name": "Kali: The Fierce Mother",
      "level": 1,
      "category": "goddess",
      "sections": {
        "Summary": "The goddess is not simply the earth mother who showers us with fruit and abundance. She is simultaneously Kali, with a garland of severed heads around her neck.",
        "Meditation": "Kali, the great fierce mother, the ultimately benevolent kind loving mother, who lives on the edge of the city, in the land of the dead, with corpses dangling from her ears by a river of blood and flame.",
        "Reflection": "To know the goddess, we must know death. The goddess is death. To know her one must die, to know life one must die."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Kali_by_Raja_Ravi_Varma.jpg",
      "sort_order": 22,
      "metadata": {
        "theme": "fierce-compassion",
        "source": "Kali by Raja Ravi Varma",
        "tradition": "Hindu Tantra"
      }
    },
    {
      "id": "emerald-death-23",
      "name": "The Triple Goddess",
      "level": 1,
      "category": "goddess",
      "sections": {
        "Summary": "The vision of the triple goddess—maiden, mother, crone—is incomplete unless it includes her, the Crone. Death.",
        "Meditation": "Our culture has no place for the Crone. Hollywood flees from the Crone every chance it gets, and yet she always finds a way to make her presence known.",
        "Reflection": "If you reject the Crone, she devours you. She eats your face."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Hecate_Chiaramonti_Inv1922.jpg",
      "sort_order": 23,
      "metadata": {
        "theme": "triple-goddess",
        "source": "Hecate (Triple-formed), Vatican Museums",
        "tradition": "Greek"
      }
    },
    {
      "id": "emerald-death-24",
      "name": "The Cremation Ground",
      "level": 1,
      "category": "practice",
      "sections": {
        "Summary": "At the opposite end of the spectrum from our Western 'don't mention death' are the Indian sadhus who live right in the cremation ground.",
        "Meditation": "Naked, possessionless, covered in ashes, meditating in that precious crossover space for years. The death space, the space of crossing over is one of great potency.",
        "Reflection": "How can we truly understand life if we have not practiced dying before we die? How can we know what the ocean is if we never want to go in?"
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Manikarnika_Cremation_Ghat,_Varanasi.jpg",
      "sort_order": 24,
      "metadata": {
        "theme": "charnel-ground",
        "source": "Cremation ground imagery",
        "tradition": "Hindu/Buddhist Tantra"
      }
    },
    {
      "id": "emerald-death-25",
      "name": "Hourglass: Modern Fear of Death",
      "level": 1,
      "category": "modern",
      "sections": {
        "Summary": "In an individualistic world, what could be more terrifying than individual death? So billionaires feverishly seek to reverse the aging process and 'solve death.'",
        "Meditation": "The defining feature of modern consumerism is a failure to reconcile the fact that we're all going to die. We live like the beings of Drawm—with all we could ask for right in front of us, but plagued by an unpleasant sound: death is coming.",
        "Reflection": "In seeking to stave off death at all costs, modern consumerism also enacts death on a massive scale. Through war, through environmental destruction."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Hourglass_drawing.svg",
      "sort_order": 25,
      "metadata": {
        "theme": "mortality",
        "source": "Hourglass (memento mori symbol)"
      }
    },
    {
      "id": "emerald-death-26",
      "name": "Memento Mori: Remember You Will Die",
      "level": 1,
      "category": "vanitas",
      "sections": {
        "Summary": "Death is the story, because we live in a world of transformation in which things are born and die all around us, all the time.",
        "Meditation": "Perhaps ancestral visions of a world that is both ephemeral and ultra-real, the ease with which the ancestors journeyed into visionary spaces, was facilitated by close contact with death.",
        "Reflection": "The space of the visionary artist is a space of death. Myths are stories of death. Ritual is an enactment almost always of some type of death."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/StillLifeWithASkull.jpg",
      "sort_order": 26,
      "metadata": {
        "theme": "memento-mori",
        "source": "Philippe de Champaigne - Vanitas Still Life",
        "artist": "Philippe de Champaigne"
      }
    },
    {
      "id": "emerald-death-27",
      "name": "Dance Macabre",
      "level": 1,
      "category": "vanitas",
      "sections": {
        "Summary": "Death the old blue song says has no mercy at all. And he comes for everyone—beggar and billionaire.",
        "Meditation": "Jeff Bezos, just like the rest of us, is going to get old and die. And Elon Musk is going to die. And every king and every tyrant and every billionaire that has ever walked the planet will crumble to dust.",
        "Reflection": "The great goddess who wears time and space as an ornament won't even blink."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Danse_macabre_by_Michael_Wolgemut.png",
      "sort_order": 27,
      "metadata": {
        "theme": "equality-in-death",
        "source": "Michael Wolgemut - Dance of Death (1493)",
        "artist": "Michael Wolgemut"
      }
    },
    {
      "id": "emerald-death-28",
      "name": "Forest Floor: Death and Life",
      "level": 1,
      "category": "ecological",
      "sections": {
        "Summary": "I looked at the forest floor and it was so green, so alive with life. I looked at the forest floor and it was a great cemetery. It was death itself. I looked at the forest floor and it was both.",
        "Meditation": "Death is paradoxically a mess of aliveness. It is the moment when a homophonic song shifts into a microbial polyphony of multi-species collaboration.",
        "Reflection": "A corpse is still very much alive. It is just not your life any longer. It is the bacteria you leave behind plus any others that flock in."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/2012-10-24_Fungus_on_fallen_log.jpg",
      "sort_order": 28,
      "metadata": {
        "theme": "ecological-cycling",
        "source": "Fungi on fallen tree (decomposition/life cycle)"
      }
    },
    {
      "id": "emerald-death-29",
      "name": "Ecological Cycling: What Happens After You Die",
      "level": 1,
      "category": "video-reference",
      "sections": {
        "Summary": "The biological processes of decomposition and the cycling of matter through ecosystems.",
        "Description": "Your atoms don't die. They were never, according to science, alive to begin with. Your molecules don't die—they reform, repurposed. Does anything in nature actually die? Or is nature the eternal shapeshifter?"
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Life_cycle_of_decomposition.svg",
      "sort_order": 29,
      "metadata": {
        "theme": "decomposition",
        "source": "Life cycle of decomposition diagram"
      }
    },
    {
      "id": "emerald-death-30",
      "name": "Do Not Stand at My Grave and Weep",
      "level": 1,
      "category": "poetry",
      "sections": {
        "Summary": "Do not stand at my grave and weep. I am not there, I do not sleep. I am a thousand winds that blow. I am the diamond glints on snow.",
        "Meditation": "I am the sunlight on ripened grain. I am the gentle autumn rain. When you awaken in the morning's hush, I am the swift uplifting rush of quiet birds in circled flight.",
        "Reflection": "I am the soft stars that shine at night. Do not stand at my grave and cry. I am not there. I did not die."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Caspar_David_Friedrich_-_Wanderer_above_the_sea_of_fog.jpg",
      "sort_order": 30,
      "metadata": {
        "theme": "continuity",
        "source": "Caspar David Friedrich - Wanderer Above the Sea of Fog",
        "artist": "Caspar David Friedrich"
      }
    },
    {
      "id": "emerald-death-31",
      "name": "What Actually Dies?",
      "level": 1,
      "category": "contemplation",
      "sections": {
        "Summary": "If I am a continuum of ancestry, then what actually dies? If I am water molecules momentarily repurposed as a human on my way to become streams and summer thunderstorms, then what actually dies?",
        "Meditation": "If this body is woven of stardust and vines and mineral salts and goes back to being them again—ashes to ashes as they say—then what actually dies?",
        "Reflection": "If I am a single verse of a great song that has extended for thousands of generations, a humming vibrating strand in a great sonorous tapestry—then what actually dies?"
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Great_Wave_off_Kanagawa2.jpg",
      "sort_order": 31,
      "metadata": {
        "theme": "non-separation",
        "source": "Hokusai - The Great Wave off Kanagawa",
        "artist": "Katsushika Hokusai"
      }
    },
    {
      "id": "emerald-death-32",
      "name": "The Self is Immortal (Nachiketas)",
      "level": 1,
      "category": "wisdom",
      "sections": {
        "Summary": "Young Nachiketas, Yama says: The self is immortal. It was not born, nor does it die. It did not come out of anything, neither did anything come out of it.",
        "Meditation": "Even if this body is destroyed, the self is not destroyed. The one who thinks that he is the slayer and the one who thinks that he is slain, both are wrong. For the self neither slays nor is slain.",
        "Reflection": "Smaller than the smallest and larger than the largest, the self is alive in all beings. Alive everywhere. The force of animacy itself alive in all things."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Myths_of_the_Hindus_%26_Buddhists_-_Yama_and_Nachiketas.jpg",
      "sort_order": 32,
      "metadata": {
        "theme": "immortal-self",
        "source": "Nachiketas meets Yama",
        "tradition": "Katha Upanishad"
      }
    },
    {
      "id": "emerald-death-33",
      "name": "Jumping Mouse Becomes Eagle",
      "level": 1,
      "category": "transformation",
      "sections": {
        "Summary": "Jumping Mouse sets out on his great quest to know, to see. At his great moment of transformative initiation, he is picked up and devoured by an eagle.",
        "Meditation": "As the land and waters below him recede into the distance, we could easily think this is the end of Jumping Mouse's story. But his friend Frog shouts from below: Now you have a new name!",
        "Reflection": "Now you have a new name, little mouse. Now they will call you Eagle. Which one was he? Was he mouse? Was he eagle?"
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Golden_Eagle_in_flight_-_5.jpg",
      "sort_order": 33,
      "metadata": {
        "theme": "transformation",
        "source": "Golden Eagle in flight",
        "tradition": "Plains Indian story"
      }
    },
    {
      "id": "emerald-death-34",
      "name": "Music: Rising Appalachia - Oh Death",
      "level": 1,
      "category": "video-reference",
      "sections": {
        "Summary": "Rising Appalachia reprises the old folk classic 'Oh Death' specifically for this episode of The Emerald.",
        "Description": "O death, we can run from it, talk our way around it, but it is inevitable reality and all ritual and all spiritual practice and one way or another is a preparation for death."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Appalachian_dulcimer.jpg",
      "sort_order": 34,
      "metadata": {
        "theme": "folk-music",
        "source": "Appalachian dulcimer",
        "audio_reference": "Rising Appalachia - 'Oh Death' from album 'Wider Circles' (2015)",
        "streaming_links": {
          "spotify": "https://open.spotify.com/track/3WNwExrDrx6D3qaAMInzzQ",
          "bandcamp": "https://risingappalachia.bandcamp.com/track/oh-death-2"
        }
      }
    },
    {
      "id": "emerald-death-35",
      "name": "The Ankh: Life and Death United",
      "level": 1,
      "category": "symbol",
      "sections": {
        "Summary": "The ankh in your one hand, the knife in the other. Life in one hand, death in the other. This life is a singular breath.",
        "Meditation": "The force that brings us into this world is the exact same force that takes us out. O death, O death. One goddess, one mother, nature.",
        "Reflection": "She is life and death, and its eternal continuum."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Ankh.svg",
      "sort_order": 35,
      "metadata": {
        "theme": "life-death-unity",
        "source": "Ankh symbol",
        "tradition": "Ancient Egypt"
      }
    },
    {
      "id": "emerald-death-36",
      "name": "Starry Night: The Tomb is the Sky",
      "level": 1,
      "category": "cosmic",
      "sections": {
        "Summary": "To the end of the sky, the pyramid texts say. To the end of the sky, to the end of the earth, to the end of the limits of space, this being travels as the wind.",
        "Meditation": "The tomb is the sky. Your hand is as the universe. Your shoulders are the universe. Your stomach is the universe. Your face is the summer star.",
        "Reflection": "You don't cease to exist. But you do cease to exist as a particular person. The air as breath is unchanging. Eternal. Hence, your breath does not die or cease to exist."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Van_Gogh_-_Starry_Night_-_Google_Art_Project.jpg",
      "sort_order": 36,
      "metadata": {
        "theme": "cosmic-continuity",
        "source": "Van Gogh - Starry Night",
        "artist": "Vincent van Gogh"
      }
    },
    {
      "id": "emerald-death-37",
      "name": "Jacob's Ladder: Angels or Demons",
      "level": 1,
      "category": "navigation",
      "sections": {
        "Summary": "If we are afraid of dying, then what is ultimately angelic could be seen initially as demonic. It all depends on us.",
        "Meditation": "If you're frightened of dying and you hold on, you'll see devils tearing your life away. But if you've made your peace, then the devils are really angels freeing you from the earth.",
        "Reflection": "It's just a matter of how you look at it, that's all. So don't worry, okay?"
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Blake_jacobsladder.jpg",
      "sort_order": 37,
      "metadata": {
        "theme": "perception",
        "source": "William Blake - Jacob's Ladder",
        "artist": "William Blake"
      }
    },
    {
      "id": "emerald-death-38",
      "name": "The Gift of Death (Tolkien)",
      "level": 1,
      "category": "wisdom",
      "sections": {
        "Summary": "Tolkien called death a gift. Illuvitar's gift, the gift of the powers to mortal beings.",
        "Meditation": "The sons of men die indeed, and leave the world, wherefore they are called the guests or the strangers. Death is their fate, the gift of Illuvitar, which as time wears on, even the powers shall envy.",
        "Reflection": "But Melkor has cast his shadow upon it, and confounded it with darkness, and brought forth evil out of good, and fear out of hope."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Gustave_Dore_Paradise_Lost_004.jpg",
      "sort_order": 38,
      "metadata": {
        "theme": "gift-of-death",
        "source": "Gustave Dore - Paradise Lost illustration",
        "artist": "Gustave Dore"
      }
    },
    {
      "id": "emerald-death-39",
      "name": "Will We Crumble or Soar?",
      "level": 1,
      "category": "practice",
      "sections": {
        "Summary": "Have we practiced crossing over? Have we traversed these liminal spaces? Have we practiced surrender—what one friend calls the discipline of surrender?",
        "Meditation": "Have we practiced journeying? Have we soared like a bird into the vast geographies of the land of the dead? Because as we crumble, so we will also soar.",
        "Reflection": "At death, we will suddenly be the river and the late summer wheatfield and the distant sky of stars. Will the vastness terrify us? Maybe not if we've practiced an embodied vastness."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Phoenix_detail_from_Aberdeen_Bestiary.jpg",
      "sort_order": 39,
      "metadata": {
        "theme": "transformation-practice",
        "source": "Phoenix from Aberdeen Bestiary"
      }
    },
    {
      "id": "emerald-death-40",
      "name": "Podcast: The Emerald - Death Episode",
      "level": 1,
      "category": "video-reference",
      "sections": {
        "Summary": "The original podcast episode that inspired this visual sequence.",
        "Description": "Death is universal, an undeniable fact of existence that every single one of our ancestors faced, just as we will. Join us as we explore Tantric death texts, Japanese death poems, Siberian death realms, and heroic death epics."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Emerald_rough_300x422.jpg",
      "sort_order": 40,
      "metadata": {
        "item_type": "podcast",
        "theme": "source-material",
        "source": "The Emerald Podcast",
        "podcast_links": {
          "spotify": "https://open.spotify.com/episode/67nEuki0RCY1wgx8elNQKQ",
          "apple": "https://podcasts.apple.com/us/podcast/no-one-here-gets-out-alive-the-death-episode/id1465445746?i=1000579757945"
        }
      }
    },
    {
      "id": "emerald-death-41",
      "name": "The Falcon Rises",
      "level": 1,
      "category": "closing",
      "sections": {
        "Summary": "Broken, exhausted you go, say the ancient Egyptians to the dying one. Into the night you go, into the night. He was made for this earth but leaves it now as a falcon.",
        "Meditation": "This being rises again in the sky, his flesh goes out to the luminous horizon. He has broken the knots of the spine. As he rises from the Akashatri, the serpent guides him.",
        "Reflection": "The eye, the awareness in the body, is the snake of the central nervous system. As it leaves the body at death, this serpentine current of energy is thrown out. Rising like a bird, it becomes pure, rising light."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Horus_as_falcon.svg",
      "sort_order": 41,
      "metadata": {
        "theme": "ascension",
        "source": "Horus as Falcon",
        "tradition": "Ancient Egypt"
      }
    },
    {
      "id": "emerald-death-42",
      "name": "Late Fragment (Raymond Carver)",
      "level": 1,
      "category": "closing",
      "sections": {
        "Summary": "And did you get what you wanted from this life, even so? I did. And what did you want? To call myself beloved, to feel myself beloved on the earth.",
        "Meditation": "Navigate the precious in-between spaces while we are here. So that when at last we go, when at last we make the great crossing, we can answer that simple question.",
        "Reflection": "First and foremost, be beloved on this earth. The rest will follow."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Sunset_2007-1.jpg",
      "sort_order": 42,
      "metadata": {
        "theme": "benediction",
        "source": "Sunset photograph (public domain)"
      }
    },
    {
      "id": "emerald-death-43",
      "name": "The Sound of the Wind",
      "level": 1,
      "category": "closing",
      "sections": {
        "Summary": "This section concludes with an anamata poetic sound. It is the sound of the wind. The words mean: Let him be free. Let him be free. Or: He is empty.",
        "Meditation": "These sounds of the wind were whispered in the ears of the dying. The navigation of the intermediary space happens through uttered sound. Words become a thread, a ladder for the person to climb.",
        "Reflection": "Speak in vogue, sing. Cast a thread for them to journey on, as death nears and that holy liminality grows, and the threshold trance deepens."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Hasegawa_Tohaku_-_Pine_Trees_(Shōrin-zu_byōbu)_-_right_hand_screen.jpg",
      "sort_order": 43,
      "metadata": {
        "theme": "final-release",
        "source": "Wind in the Pines (Japanese painting style)"
      }
    },
    {
      "id": "emerald-death-44",
      "name": "Book: Susan Brind Moro - Dawning Moon of the Mind",
      "level": 1,
      "category": "video-reference",
      "sections": {
        "Summary": "Susan Brind Moro's poetic exploration of Egyptian funerary texts.",
        "Description": "The primary concept of ancient Egyptian religion is introduced in these verses, embodied in the sense impression made by the motion of a bird of the prehistoric desert world."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Pyramid_of_Unas_inside_view.jpg",
      "sort_order": 44,
      "metadata": {
        "item_type": "book-reference",
        "theme": "pyramid-texts",
        "source": "Susan Brind Moro - Dawning Moon of the Mind",
        "book_info": "Translation and interpretation of the Pyramid Texts"
      }
    },
    {
      "id": "emerald-death-45",
      "name": "YouTube: Bardo States Explained",
      "level": 1,
      "category": "video-reference",
      "sections": {
        "Summary": "Understanding the intermediate states between death and rebirth.",
        "Description": "How did they know what happens when you die? They practiced journeying there over and over again, projecting consciousness through the fontanel of the skull."
      },
      "image_url": "https://i.ytimg.com/vi/bKNPzhg2Yyc/maxresdefault.jpg",
      "sort_order": 45,
      "metadata": {
        "item_type": "video",
        "youtube_url": "https://www.youtube.com/watch?v=bKNPzhg2Yyc",
        "youtube_video_id": "bKNPzhg2Yyc",
        "video_title": "Exploring the Bardo Thodol: Insights from the Tibetan Book of the Dead",
        "theme": "bardo-states"
      }
    },
    {
      "id": "emerald-death-46",
      "name": "Book: Japanese Death Poems (Jisei)",
      "level": 1,
      "category": "video-reference",
      "sections": {
        "Summary": "The tradition of jisei - poems composed at the moment of death.",
        "Description": "It takes some focus and tenacity to compose a death poem. It takes some practice, some acceptance and calm."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Yoshitoshi_-_100_Aspects_of_the_Moon_-_1.jpg",
      "sort_order": 46,
      "metadata": {
        "item_type": "book-reference",
        "theme": "death-poems",
        "source": "Yoel Hoffman - Japanese Death Poems (Jisei)",
        "book_info": "Compilation of death poems by Zen monks and haiku poets"
      }
    },
    {
      "id": "emerald-death-47",
      "name": "YouTube: Eleusinian Mysteries",
      "level": 1,
      "category": "video-reference",
      "sections": {
        "Summary": "The ancient Greek initiation rites of Eleusis and their death symbolism.",
        "Description": "Every initiatory passage in this life is a death. The girl bleeds and then the girl is gone. Just as one thing is ripening, another is dying."
      },
      "image_url": "https://i.ytimg.com/vi/3opVJuK7ack/maxresdefault.jpg",
      "sort_order": 47,
      "metadata": {
        "item_type": "video",
        "youtube_url": "https://www.youtube.com/watch?v=3opVJuK7ack",
        "youtube_video_id": "3opVJuK7ack",
        "video_title": "Divulging the Eleusinian Mysteries - The Modern Hermeticist",
        "theme": "mysteries"
      }
    },
    {
      "id": "emerald-death-48",
      "name": "Kali Devi: The Dark Mother",
      "level": 1,
      "category": "video-reference",
      "sections": {
        "Summary": "Understanding Kali as the fierce compassionate goddess of death and transformation.",
        "Description": "Without a mother, you can't live. Without a mother, you can't die. To know the goddess, we must know death."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Kali_Devi.jpg",
      "sort_order": 48,
      "metadata": {
        "theme": "goddess",
        "source": "Kali Devi - Traditional imagery",
        "tradition": "Hindu Tantra"
      }
    },
    {
      "id": "emerald-death-49",
      "name": "The Canopic Jar: Preserving the Journey",
      "level": 1,
      "category": "symbol",
      "sections": {
        "Summary": "The organs preserved for the journey ahead—the heart weighed against the feather of Ma'at.",
        "Meditation": "We will all bow. One way or another. Before the vastness of time, before the will of life and death, we will all bow.",
        "Reflection": "Have we practiced bowing? Not Instagram bowing. Bowing when no one else is around. At death, we bow alone."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Four_sons_of_Horus.jpg",
      "sort_order": 49,
      "metadata": {
        "theme": "preparation",
        "source": "Four Sons of Horus - Canopic Jars",
        "tradition": "Ancient Egypt"
      }
    },
    {
      "id": "emerald-death-50",
      "name": "Closing: May We Live Lives Driven by Wonder",
      "level": 1,
      "category": "closing",
      "sections": {
        "Summary": "Next time may we live lives that are driven forth by imagination, vision and wonder.",
        "Meditation": "What will your death poem be? What will mine be? How will we go out—as dew on the grass, as a turtle drying its shell?",
        "Reflection": "Will we crumble or will we soar? Oh, for certain, we will crumble. But we will also soar."
      },
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Flammarion.jpg",
      "sort_order": 50,
      "metadata": {
        "theme": "wonder",
        "source": "Flammarion Engraving (1888)",
        "description": "A person reaches through the firmament to glimpse the cosmic machinery beyond"
      }
    }
  ],
  "creator_name": "The Emerald Podcast / PlayfulProcess",
  "creator_link": "https://www.theemeralds.com/",
  "is_published": true,
  "_community_folder": "sequences",
  "_community_slug": "emerald-death-card-no-one-here-gets-out-alive",
  "_original_creator": "f18e2415-315c-43b7-ae93-d09c8892e181",
  "editors": [
    {
      "user_id": "f18e2415-315c-43b7-ae93-d09c8892e181",
      "timestamp": "2026-02-01T18:53:37.794Z",
      "action": "created",
      "creator_name": "The Emerald Podcast / PlayfulProcess",
      "creator_url": "https://www.theemeralds.com/"
    }
  ],
  "updated_at": "2026-02-01T18:53:37.794Z",
  "created_at": "2026-02-01T18:53:37.794Z"
}