{
  "name": "Alice's Adventures in Wonderland — A Chapter Book",
  "description": "Lewis Carroll's beloved classic transformed into a chapter-book grammar with Sir John Tenniel's original 1865 public domain illustrations. Each chapter is an item you can read aloud, explore, and wonder about. Perfect for reading with children — one chapter at a time, like a bedtime story that never gets old.",
  "cover_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Alice-colorized.png/440px-Alice-colorized.png",
  "tags": ["children", "classic", "illustrated", "chapter-book", "public-domain", "lewis-carroll", "alice"],
  "grammar_type": "custom",
  "attribution": {
    "source_name": "Alice's Adventures in Wonderland",
    "source_author": "Lewis Carroll (Charles Lutwidge Dodgson)",
    "source_year": "1865",
    "license": "Public Domain",
    "illustrator": "Sir John Tenniel",
    "source_url": "https://www.gutenberg.org/ebooks/11",
    "illustrations_url": "https://www.gutenberg.org/ebooks/114",
    "note": "Text from Project Gutenberg eBook #11. Illustrations by Sir John Tenniel (1865), public domain, sourced via Wikimedia Commons and Project Gutenberg eBook #114."
  },
  "items": [
    {
      "id": "chapter-01-down-the-rabbit-hole",
      "name": "Chapter I — Down the Rabbit-Hole",
      "symbol": "I",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "Alice was beginning to get very tired of sitting by her sister on the bank, and of having nothing to do: once or twice she had peeped into the book her sister was reading, but it had no pictures or conversations in it, \"and what is the use of a book,\" thought Alice \"without pictures or conversations?\"\n\nSo she was considering in her own mind whether the pleasure of making a daisy-chain would be worth the trouble of getting up and picking the daisies, when suddenly a White Rabbit with pink eyes ran close by her.\n\nThere was nothing so very remarkable in that; nor did Alice think it so very much out of the way to hear the Rabbit say to itself, \"Oh dear! Oh dear! I shall be late!\" But when the Rabbit actually took a watch out of its waistcoat-pocket, and looked at it, and then hurried on, Alice started to her feet, for it flashed across her mind that she had never before seen a rabbit with either a waistcoat-pocket, or a watch to take out of it, and burning with curiosity, she ran across the field after it, and fortunately was just in time to see it pop down a large rabbit-hole under the hedge.\n\nIn another moment down went Alice after it, never once considering how in the world she was to get out again.\n\nThe rabbit-hole went straight on like a tunnel for some way, and then dipped suddenly down, so suddenly that Alice had not a moment to think about stopping herself before she found herself falling down a very deep well.\n\nEither the well was very deep, or she fell very slowly, for she had plenty of time as she went down to look about her. She saw maps and pictures hung upon pegs, and took down a jar labelled \"ORANGE MARMALADE\", but to her great disappointment it was empty.\n\n\"Well!\" thought Alice to herself, \"after such a fall as this, I shall think nothing of tumbling down stairs!\"\n\nDown, down, down. Would the fall never come to an end? \"I wonder how many miles I've fallen by this time?\" she said aloud.\n\nThump! thump! down she came upon a heap of sticks and dry leaves, and the fall was over.\n\nAlice found herself in a long, low hall, lit up by a row of lamps hanging from the roof. There were doors all round the hall, but they were all locked. She came upon a little three-legged table, all made of solid glass; there was nothing on it except a tiny golden key.\n\nBehind a low curtain was a little door about fifteen inches high: the little golden key fitted! Through it she could see the loveliest garden you ever saw. How she longed to wander about among those beds of bright flowers and those cool fountains.\n\n\"Oh, how I wish I could shut up like a telescope!\" said Alice.\n\nShe found a little bottle with the words \"DRINK ME\" beautifully printed on it. The wise little Alice checked first that it was not marked \"poison.\" Finding it very nice (a sort of mixed flavour of cherry-tart, custard, pine-apple, roast turkey, toffee, and hot buttered toast), she very soon finished it off.\n\n\"What a curious feeling!\" said Alice; \"I must be shutting up like a telescope.\" And so it was indeed: she was now only ten inches high!\n\nBut alas! She had forgotten the little golden key on the table, and now she was too small to reach it. The poor little thing sat down and cried.\n\nSoon her eye fell on a little glass box under the table with a very small cake, on which the words \"EAT ME\" were beautifully marked in currants.\n\n\"Well, I'll eat it,\" said Alice, \"and if it makes me grow larger, I can reach the key; and if it makes me grow smaller, I can creep under the door; so either way I'll get into the garden!\"",
        "For Young Readers": "Alice is bored sitting by her sister when she spots a White Rabbit wearing a waistcoat and carrying a pocket watch! She chases it down a rabbit-hole and falls for a long, long time. At the bottom she finds a mysterious hall full of locked doors, a tiny golden key, a bottle that says \"DRINK ME\" (which makes her shrink!), and a cake that says \"EAT ME.\" She just wants to get into the beautiful garden she can see through a tiny door!",
        "Characters You'll Meet": "Alice — a curious girl who follows a rabbit down a hole\nThe White Rabbit — always late, wears a waistcoat, carries a pocket watch",
        "Famous Lines": "\"And what is the use of a book without pictures or conversations?\"\n\n\"Oh dear! Oh dear! I shall be late!\"\n\n\"DRINK ME\" / \"EAT ME\"\n\n\"Oh, how I wish I could shut up like a telescope!\"\n\n\"Curiouser and curiouser!\"",
        "Things to Talk About": "Have you ever been so curious about something that you just had to follow it?\n\nWould you drink something that said \"DRINK ME\"? Why does Alice check if it says \"poison\" first?\n\nWhat would it feel like to be only ten inches tall?"
      },
      "keywords": ["rabbit-hole", "curiosity", "drink me", "eat me", "golden key", "falling", "white rabbit", "beginning"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Alice_par_John_Tenniel_25.png",
      "sort_order": 1,
      "metadata": {
        "chapter_number": 1,
        "original_title": "Down the Rabbit-Hole",
        "key_illustration": "Alice following the White Rabbit"
      }
    },
    {
      "id": "chapter-02-the-pool-of-tears",
      "name": "Chapter II — The Pool of Tears",
      "symbol": "II",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "\"Curiouser and curiouser!\" cried Alice (she was so much surprised, that for the moment she quite forgot how to speak good English); \"now I'm opening out like the largest telescope that ever was! Good-bye, feet!\"\n\nAlice had eaten the cake and was now growing enormously — more than nine feet high! She took up the little golden key and hurried off to the garden door. But poor Alice! It was as much as she could do, lying down on one side, to look through into the garden with one eye; but to get through was more hopeless than ever.\n\n\"You ought to be ashamed of yourself,\" said Alice to herself, \"a great girl like you, to go on crying in this way! Stop this moment, I tell you!\" But she went on all the same, shedding gallons of tears, until there was a large pool all round her, about four inches deep and reaching half down the hall.\n\nThe White Rabbit returned, splendidly dressed, with a pair of white kid gloves in one hand and a large fan in the other. \"Oh! the Duchess, the Duchess! Oh! won't she be savage if I've kept her waiting!\" Alice was so desperate that she began, in a low, timid voice, \"If you please, sir—\" The Rabbit started violently, dropped the white kid gloves and the fan, and skurried away into the darkness.\n\nAlice took up the fan and began fanning herself. \"Dear, dear! How queer everything is to-day! Let me think: was I the same when I got up this morning? I almost think I can remember feeling a little different. But if I'm not the same, the next question is, Who in the world am I?\"\n\nShe tried to remember her lessons but everything came out wrong — \"London is the capital of Paris, and Paris is the capital of Rome\" — and when she tried to recite a poem, it came out as:\n\n\"How doth the little crocodile\n    Improve his shining tail,\nAnd pour the waters of the Nile\n    On every golden scale!\"\n\nSuddenly she noticed that she was shrinking again — the fan was making her smaller! She dropped it hastily, just in time.\n\nSplash! She was up to her chin in salt water — the pool of tears which she had wept when she was nine feet high!\n\n\"I wish I hadn't cried so much!\" said Alice, as she swam about.\n\nShe met a Mouse swimming nearby. \"O Mouse, do you know the way out of this pool?\" The Mouse looked at her rather inquisitively. Alice tried French: \"Où est ma chatte?\" — which means \"Where is my cat?\" The Mouse gave a sudden leap out of the water with fright.\n\n\"Oh, I beg your pardon!\" cried Alice. \"I quite forgot you didn't like cats.\"\n\n\"Not like cats!\" cried the Mouse. \"Would you like cats if you were me?\"\n\nSoon the pool was getting quite crowded with birds and animals that had fallen into it: a Duck, a Dodo, a Lory, an Eaglet, and several other curious creatures. Alice led the way, and the whole party swam to the shore.",
        "For Young Readers": "Alice grows so tall her head hits the ceiling — then she cries so much she makes a whole pool of tears! When she shrinks again (thanks to a magic fan), she falls into her own tears and has to swim. She meets a Mouse in the pool, but accidentally scares it by talking about cats. More animals join them in the water, and they all swim to shore together.",
        "Characters You'll Meet": "The Mouse — does NOT like cats or dogs, thank you very much\nThe Dodo — a very serious bird\nThe Lory — a parrot who thinks she knows best\nThe Eaglet — and other curious creatures",
        "Famous Lines": "\"Curiouser and curiouser!\"\n\n\"Who in the world am I? Ah, that's the great puzzle!\"\n\n\"How doth the little crocodile / Improve his shining tail\"\n\n\"I wish I hadn't cried so much!\"",
        "Things to Talk About": "Alice asks \"Who in the world am I?\" — have you ever felt like a different person from one day to the next?\n\nWhy do you think Alice kept talking about cats to the Mouse even though the Mouse didn't like it?\n\nWhat would you do if you were stuck swimming in a pool of your own tears?"
      },
      "keywords": ["growing", "shrinking", "tears", "identity", "mouse", "pool", "crocodile poem", "who am I"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/1/18/Alice_par_John_Tenniel_04.png",
      "sort_order": 2,
      "metadata": {
        "chapter_number": 2,
        "original_title": "The Pool of Tears",
        "key_illustration": "Alice swimming in the pool of tears"
      }
    },
    {
      "id": "chapter-03-a-caucus-race-and-a-long-tale",
      "name": "Chapter III — A Caucus-Race and a Long Tale",
      "symbol": "III",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "They were indeed a queer-looking party that assembled on the bank — the birds with draggled feathers, the animals with their fur clinging close to them, and all dripping wet, cross, and uncomfortable.\n\nThe first question was, how to get dry again. The Mouse tried reading them the driest thing he knew — a very dull history lesson about William the Conqueror. \"Ugh!\" said the Lory, with a shiver.\n\n\"In that case,\" said the Dodo solemnly, \"I move that the meeting adjourn, for the immediate adoption of more energetic remedies—\"\n\n\"Speak English!\" said the Eaglet.\n\nThe Dodo proposed a Caucus-race. He marked out a race-course in a sort of circle, and then all the party were placed along the course, here and there. There was no \"One, two, three, and away,\" but they began running when they liked, and left off when they liked.\n\nWhen they had been running half an hour or so, and were quite dry again, the Dodo suddenly called out \"The race is over!\" and they all crowded round, panting. \"But who has won?\"\n\nThe Dodo thought for a long time, then said, \"Everybody has won, and all must have prizes.\"\n\nAlice had to hand out comfits from her pocket as prizes. For her own prize, the Dodo presented her with her own thimble, saying \"We beg your acceptance of this elegant thimble.\" Alice thought the whole thing very absurd, but they all looked so grave that she did not dare to laugh.\n\nThe Mouse began to tell his story — \"Mine is a long and a sad tale!\" said the Mouse.\n\n\"It is a long tail, certainly,\" said Alice, looking down with wonder at the Mouse's tail; \"but why do you call it sad?\"\n\nBut Alice kept making mistakes — mentioning her cat Dinah and how well she catches mice and birds — until all the creatures hurried off, and Alice was left alone again, feeling very lonely and low-spirited.",
        "For Young Readers": "Everyone is soaking wet from the pool, so the Dodo invents a Caucus-race to dry off. The rules? Run in a circle whenever you like, stop whenever you like! And guess what — EVERYBODY wins! Alice has to give out sweets as prizes, and gets her own thimble back as her prize.\n\nThe Mouse tries to tell a sad story, but Alice keeps making everyone upset by talking about her cat Dinah. One by one, all the animals leave. Poor Alice is all alone again!",
        "Characters You'll Meet": "The Dodo — inventor of the Caucus-race where everyone wins\nThe Mouse — tries to tell his sad tale/tail (it's a pun!)\nDinah — Alice's cat back home (who scares everyone just by being mentioned)",
        "Famous Lines": "\"Everybody has won, and all must have prizes.\"\n\n\"Mine is a long and a sad tale!\" / \"It is a long tail, certainly... but why do you call it sad?\"\n\n\"Speak English!\"",
        "Things to Talk About": "In the Caucus-race, everybody wins. Is that a good way to do a race? Why or why not?\n\nWhy does Alice keep accidentally upsetting the animals? Is she being mean, or just not thinking?\n\nThe Mouse says \"tale\" and Alice hears \"tail\" — can you think of other words that sound the same but mean different things?"
      },
      "keywords": ["caucus-race", "everybody wins", "tale-tail pun", "dodo", "getting dry", "lonely", "Dinah"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Alice_par_John_Tenniel_06.png",
      "sort_order": 3,
      "metadata": {
        "chapter_number": 3,
        "original_title": "A Caucus-Race and a Long Tale",
        "key_illustration": "The Caucus-race"
      }
    },
    {
      "id": "chapter-04-the-rabbit-sends-in-a-little-bill",
      "name": "Chapter IV — The Rabbit Sends in a Little Bill",
      "symbol": "IV",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "It was the White Rabbit, trotting slowly back again, muttering to itself \"The Duchess! The Duchess! Oh my dear paws! Oh my fur and whiskers! She'll get me executed, as sure as ferrets are ferrets! Where can I have dropped them, I wonder?\"\n\nThe Rabbit noticed Alice and called out in an angry tone, \"Why, Mary Ann, what are you doing out here? Run home this moment, and fetch me a pair of gloves and a fan! Quick, now!\"\n\n\"He took me for his housemaid,\" Alice said to herself as she ran. She came upon a neat little house with a brass plate reading \"W. RABBIT\" and hurried inside.\n\nIn a tidy little room she found the fan and gloves, but also a little bottle. \"I know something interesting is sure to happen whenever I eat or drink anything,\" she said. She drank it, and it made her grow so large that she filled the whole room! Her head pressed against the ceiling, one arm stuck out the window, and one foot went up the chimney.\n\n\"It was much pleasanter at home,\" thought poor Alice, \"when one wasn't always growing larger and smaller, and being ordered about by mice and rabbits.\"\n\nThe Rabbit came back and tried to get in, but Alice's elbow blocked the door. \"Pat! Pat! Where are you?\" called the Rabbit. A little voice answered, \"Sure then I'm here! Digging for apples, yer honour!\"\n\nThey tried to send Bill the Lizard down the chimney. \"This is Bill,\" said Alice, and she gave one sharp kick. \"There goes Bill!\" cried everyone outside.\n\n\"We must burn the house down!\" said the Rabbit. \"If you do, I'll set Dinah at you!\" called Alice.\n\nInstead, they threw pebbles at the window — and the pebbles turned into little cakes! Alice ate one, began shrinking, and ran out of the house as fast as she could.\n\nIn the wood she met an enormous puppy who wanted to play. Then she found a great mushroom, and peeping over the top of it, her eyes met those of a large blue caterpillar, sitting with its arms folded, quietly smoking a long hookah.",
        "For Young Readers": "The White Rabbit mistakes Alice for his housemaid, Mary Ann, and orders her to fetch his gloves! At the Rabbit's house, Alice drinks from a bottle and grows SO big she fills the entire house — her arm sticks out the window and her foot goes up the chimney!\n\nPoor little Bill the Lizard gets sent down the chimney, and Alice accidentally kicks him out like a rocket. She finally escapes by eating magical pebble-cakes that make her shrink. In the woods, she meets a playful giant puppy and then spots a mysterious blue caterpillar sitting on a mushroom, smoking a hookah.",
        "Characters You'll Meet": "Mary Ann — the Rabbit's housemaid (who Alice isn't!)\nBill the Lizard — the unlucky fellow who gets kicked up the chimney\nPat — the Rabbit's helper\nThe enormous Puppy — wants to play but is frighteningly big when you're tiny\nThe Blue Caterpillar — sitting on a mushroom, smoking, and looking very wise",
        "Famous Lines": "\"The Duchess! The Duchess! Oh my fur and whiskers!\"\n\n\"It was much pleasanter at home, when one wasn't always growing larger and smaller.\"\n\n\"There goes Bill!\"\n\n\"We must burn the house down!\"",
        "Things to Talk About": "Alice gets mistaken for someone else — has anyone ever thought you were someone you're not?\n\nImagine being so big you fill a whole house! What would that feel like?\n\nAlice says it was \"pleasanter at home\" — do you think she wants to go back? Would you?"
      },
      "keywords": ["white rabbit", "Mary Ann", "giant Alice", "Bill the Lizard", "chimney", "mushroom", "caterpillar", "puppy"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Alice_par_John_Tenniel_10.png",
      "sort_order": 4,
      "metadata": {
        "chapter_number": 4,
        "original_title": "The Rabbit Sends in a Little Bill",
        "key_illustration": "Giant Alice stuck in the Rabbit's house"
      }
    },
    {
      "id": "chapter-05-advice-from-a-caterpillar",
      "name": "Chapter V — Advice from a Caterpillar",
      "symbol": "V",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "The Caterpillar and Alice looked at each other for some time in silence: at last the Caterpillar took the hookah out of its mouth, and addressed her in a languid, sleepy voice.\n\n\"Who are you?\" said the Caterpillar.\n\n\"I — I hardly know, sir, just at present — at least I know who I was when I got up this morning, but I think I must have been changed several times since then.\"\n\n\"What do you mean by that? Explain yourself!\"\n\n\"I can't explain myself, I'm afraid, sir, because I'm not myself, you see.\"\n\nThe Caterpillar asked Alice to recite \"You are old, Father William.\" Alice folded her hands and began — but the words all came out different, turning into a funny poem about an old man who stands on his head, turns back-somersaults, balances eels on his nose, and argues with his son.\n\n\"That is not said right,\" said the Caterpillar.\n\n\"Not quite right, I'm afraid,\" said Alice; \"some of the words have got altered.\"\n\n\"It is wrong from beginning to end,\" said the Caterpillar decidedly.\n\nWhen Alice said she would like to be a little larger (three inches being \"such a wretched height\"), the Caterpillar was offended — for it was exactly three inches high itself!\n\n\"One side will make you grow taller, and the other side will make you grow shorter,\" said the Caterpillar as it crawled away.\n\n\"One side of what?\" thought Alice.\n\n\"Of the mushroom,\" said the Caterpillar, just as if she had asked it aloud.\n\nAlice broke off a bit of the edge with each hand and began to experiment. One side made her chin crash into her foot! The other side made her neck stretch up like a stalk above the trees, and a Pigeon flew at her screaming \"Serpent!\"\n\n\"I'm not a serpent!\" said Alice. \"I'm a — I'm a little girl.\"\n\n\"A likely story indeed!\" said the Pigeon. \"I've seen a good many little girls in my time, but never one with such a neck as that!\"\n\nAt last, by carefully nibbling first at one piece and then at the other, Alice brought herself down to her usual height.",
        "For Young Readers": "Alice meets a mysterious blue Caterpillar sitting on a mushroom. It asks her the hardest question: \"Who are you?\" Alice doesn't know anymore — she's changed so many times today!\n\nThe Caterpillar makes her recite a poem, but it comes out all silly and wrong. Before crawling away, the Caterpillar gives her an important secret: one side of the mushroom makes you taller, the other side makes you shorter.\n\nAlice experiments and her neck stretches SO long that a Pigeon thinks she's a snake! Finally she figures out how to use the mushroom pieces to get back to her normal size.",
        "Characters You'll Meet": "The Caterpillar — blue, three inches tall, sits on a mushroom smoking a hookah, very wise but very grumpy\nThe Pigeon — a worried mother bird who thinks Alice is a serpent",
        "Famous Lines": "\"Who are you?\" said the Caterpillar.\n\n\"I can't explain myself, I'm afraid, sir, because I'm not myself, you see.\"\n\n\"One side will make you grow taller, and the other side will make you grow shorter.\"\n\n\"Serpent!\" screamed the Pigeon.\n\n\"You are old, Father William\"",
        "Things to Talk About": "\"Who are you?\" — how would YOU answer the Caterpillar's question?\n\nHave you ever felt like you weren't quite yourself?\n\nThe Pigeon thinks Alice is a serpent because of her long neck. Sometimes things aren't what they look like! Can you think of an example?"
      },
      "keywords": ["caterpillar", "who are you", "identity", "mushroom", "Father William", "serpent", "pigeon", "growing", "shrinking"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Alice_par_John_Tenniel_14.png",
      "sort_order": 5,
      "metadata": {
        "chapter_number": 5,
        "original_title": "Advice from a Caterpillar",
        "key_illustration": "Alice and the Caterpillar on the mushroom"
      }
    },
    {
      "id": "chapter-06-pig-and-pepper",
      "name": "Chapter VI — Pig and Pepper",
      "symbol": "VI",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "Alice came upon a little house with a Fish-Footman delivering a great letter to a Frog-Footman: \"For the Duchess. An invitation from the Queen to play croquet.\" Then they both bowed low, and their curls got entangled together. Alice laughed so much she had to run back into the wood.\n\nShe went up to the door and knocked. \"There's no sort of use in knocking,\" said the Frog-Footman, \"for two reasons. First, because I'm on the same side of the door as you are; secondly, because they're making such a noise inside, no one could possibly hear you.\"\n\nAlice opened the door and went in. The kitchen was full of smoke. The Duchess was sitting on a three-legged stool, nursing a baby; the cook was stirring a large cauldron of soup. There was certainly too much pepper in that soup!\n\nEveryone was sneezing — except the cook, and a large cat which was sitting on the hearth and grinning from ear to ear.\n\n\"Please would you tell me why your cat grins like that?\"\n\n\"It's a Cheshire cat,\" said the Duchess, \"and that's why. Pig!\"\n\nThe cook was throwing everything at the Duchess and the baby — fire-irons, saucepans, plates, and dishes. The Duchess sang a terrible lullaby:\n\n\"Speak roughly to your little boy,\n    And beat him when he sneezes:\nHe only does it to annoy,\n    Because he knows it teases.\"\n\nThe Duchess flung the baby at Alice and hurried out to play croquet with the Queen. Alice carried the baby outside — but it started grunting, and its nose turned into a snout, and it turned into a pig! She set it down, and it trotted away into the wood.\n\n\"If it had grown up,\" she said to herself, \"it would have made a dreadfully ugly child: but it makes rather a handsome pig, I think.\"\n\nThen she saw the Cheshire Cat sitting on a bough of a tree, grinning.\n\n\"Would you tell me, please, which way I ought to go from here?\"\n\n\"That depends a good deal on where you want to get to,\" said the Cat.\n\n\"I don't much care where—\" said Alice.\n\n\"Then it doesn't matter which way you go,\" said the Cat.\n\nThe Cat told her that the Hatter is mad and the March Hare is mad. \"We're all mad here,\" it said. Then it vanished quite slowly, beginning with the end of the tail, and ending with the grin, which remained some time after the rest of it had gone.\n\n\"Well! I've often seen a cat without a grin,\" thought Alice; \"but a grin without a cat! It's the most curious thing I ever saw in my life!\"",
        "For Young Readers": "Alice finds a crazy kitchen where a Duchess is nursing a baby, a cook is throwing pots and pans, and everything is full of pepper! There's also a cat with a HUGE grin — the famous Cheshire Cat.\n\nThe Duchess hands Alice the baby, but it turns into a pig! Then Alice meets the Cheshire Cat properly, sitting in a tree. He tells her that everyone here is mad — the Hatter, the March Hare, everyone. \"We're all mad here.\"\n\nBest of all, the Cat can disappear slowly — ending with just its grin floating in the air! A grin without a cat!",
        "Characters You'll Meet": "The Duchess — very rude, nurses a baby that turns into a pig\nThe Cook — throws everything and puts too much pepper in the soup\nThe Cheshire Cat — grins all the time, can appear and disappear, very philosophical\nThe Fish-Footman and Frog-Footman — deliver the Queen's croquet invitation",
        "Famous Lines": "\"It's a Cheshire cat, and that's why.\"\n\n\"We're all mad here. I'm mad. You're mad.\"\n\n\"That depends a good deal on where you want to get to.\"\n\n\"Then it doesn't matter which way you go.\"\n\n\"A grin without a cat! It's the most curious thing I ever saw in my life!\"",
        "Things to Talk About": "The Cheshire Cat says if you don't know where you're going, it doesn't matter which way you go. Do you agree?\n\nWhat does it mean to be \"mad\"? Is being different the same as being mad?\n\nCan you imagine a grin floating in the air without a face? Try to draw it!"
      },
      "keywords": ["Cheshire Cat", "grin", "Duchess", "pepper", "pig-baby", "mad", "directions", "which way to go"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/5/54/Cheshire_Cat_Tenniel.png",
      "sort_order": 6,
      "metadata": {
        "chapter_number": 6,
        "original_title": "Pig and Pepper",
        "key_illustration": "The Cheshire Cat grinning in the tree"
      }
    },
    {
      "id": "chapter-07-a-mad-tea-party",
      "name": "Chapter VII — A Mad Tea-Party",
      "symbol": "VII",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "There was a table set out under a tree in front of the house, and the March Hare and the Hatter were having tea at it: a Dormouse was sitting between them, fast asleep, and the other two were using it as a cushion.\n\n\"No room! No room!\" they cried out when they saw Alice coming.\n\n\"There's plenty of room!\" said Alice indignantly, and she sat down.\n\n\"Have some wine,\" the March Hare offered.\n\n\"I don't see any wine,\" said Alice.\n\n\"There isn't any,\" said the March Hare.\n\n\"Your hair wants cutting,\" said the Hatter.\n\n\"You should learn not to make personal remarks,\" Alice said with some severity; \"it's very rude.\"\n\nThe Hatter opened his eyes very wide and said, \"Why is a raven like a writing-desk?\"\n\nNo one could answer the riddle — not even the Hatter! \"I haven't the slightest idea,\" he said.\n\nThe Hatter told Alice about Time. \"If you knew Time as well as I do, you wouldn't talk about wasting it. It's him.\" The Hatter had quarrelled with Time at the Queen's concert, and now it was always six o'clock — always tea-time, with no time to wash up. So they kept moving around the table to clean cups.\n\nThe Hatter made Alice sing \"Twinkle, twinkle, little bat! How I wonder what you're at! Up above the world you fly, like a tea-tray in the sky.\"\n\nThe Dormouse was persuaded to tell a story about three little sisters named Elsie, Lacie, and Tillie who lived at the bottom of a treacle-well and were learning to draw — they drew treacle.\n\n\"You can draw water out of a water-well,\" said the Hatter; \"so I should think you could draw treacle out of a treacle-well.\"\n\n\"I think you might do something better with the time,\" said Alice, \"than waste it in asking riddles that have no answers.\"\n\n\"If you knew Time as well as I do,\" said the Hatter, \"you wouldn't talk about wasting it.\"\n\nAt last Alice walked off in great disgust. \"It's the stupidest tea-party I ever was at in all my life!\"\n\nShe found a door in a tree leading back to the long hall, took the golden key, nibbled the mushroom to shrink, and at last walked into the beautiful garden.",
        "For Young Readers": "Alice arrives at the maddest tea-party ever! The March Hare, the Mad Hatter, and the sleepy Dormouse are having tea — and they're ALL bonkers. They ask riddles with no answers (\"Why is a raven like a writing-desk?\"), they're rude, they make no sense, and Time is stuck at six o'clock, so it's ALWAYS teatime!\n\nThe Dormouse tells a strange story about three sisters who live in a treacle-well. Alice gets so frustrated she leaves — but she finally finds her way into the beautiful garden she's been trying to reach since Chapter I!",
        "Characters You'll Meet": "The Mad Hatter — rude, brilliant, quarrelled with Time itself\nThe March Hare — offers wine that doesn't exist, equally mad\nThe Dormouse — sleepy, tells strange stories about treacle wells\nTime — not a thing, but a person you can quarrel with!",
        "Famous Lines": "\"Why is a raven like a writing-desk?\"\n\n\"I haven't the slightest idea.\"\n\n\"No room! No room!\" / \"There's plenty of room!\"\n\n\"Twinkle, twinkle, little bat! How I wonder what you're at!\"\n\n\"It's always tea-time.\"\n\n\"You might just as well say that 'I see what I eat' is the same thing as 'I eat what I see'!\"",
        "Things to Talk About": "\"Why is a raven like a writing-desk?\" — can YOU think of an answer?\n\nImagine if it were always tea-time and you could never clean up! What would that be like?\n\nThe Hatter says you shouldn't \"waste\" Time because Time is a person. What if Time really were someone you could talk to?"
      },
      "keywords": ["tea-party", "mad hatter", "march hare", "dormouse", "riddle", "raven", "writing-desk", "time", "treacle-well"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Alice_par_John_Tenniel_21.png",
      "sort_order": 7,
      "metadata": {
        "chapter_number": 7,
        "original_title": "A Mad Tea-Party",
        "key_illustration": "The Mad Tea-Party with Hatter, March Hare, Dormouse, and Alice"
      }
    },
    {
      "id": "chapter-08-the-queens-croquet-ground",
      "name": "Chapter VIII — The Queen's Croquet-Ground",
      "symbol": "VIII",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "A large rose-tree stood near the entrance of the garden: the roses growing on it were white, but there were three gardeners busily painting them red. Alice asked why.\n\n\"Why the fact is, you see, Miss, this here ought to have been a red rose-tree, and we put a white one in by mistake; and if the Queen was to find it out, we should all have our heads cut off.\"\n\n\"The Queen! The Queen!\" cried the gardeners, and threw themselves flat upon their faces. A grand procession approached: ten soldiers carrying clubs, ten courtiers ornamented with diamonds, the royal children with hearts, then guests — and at the very end, THE KING AND QUEEN OF HEARTS.\n\n\"What's your name, child?\" said the Queen.\n\n\"My name is Alice, so please your Majesty,\" said Alice very politely; but she added, to herself, \"Why, they're only a pack of cards, after all. I needn't be afraid of them!\"\n\n\"Off with her head!\" screamed the Queen.\n\n\"Nonsense!\" said Alice, very loudly and decidedly, and the Queen was silent.\n\nAlice was invited to play croquet — the most curious croquet-ground she had ever seen! The balls were live hedgehogs, the mallets live flamingoes, and the soldiers had to double themselves up to make the arches. The Queen went stamping about, shouting \"Off with his head!\" or \"Off with her head!\" about once in a minute.\n\nThe Cheshire Cat appeared — just its head, grinning in the air. The King wanted it beheaded, but the executioner said you couldn't cut off a head unless there was a body to cut it off from. The Cat belonged to the Duchess, so they fetched her from prison — but by the time she arrived, the Cat had entirely disappeared.\n\nThe Queen took Alice to meet the Mock Turtle and the Gryphon.",
        "For Young Readers": "Alice finally reaches the beautiful garden — but it's the Queen of Hearts' croquet ground! Three gardeners are frantically painting white roses red before the Queen sees them (she'll cut off their heads!).\n\nThe Queen of Hearts shouts \"Off with her head!\" at everyone, but Alice bravely tells her \"Nonsense!\" The croquet game is the craziest thing ever — you play with flamingos as mallets and hedgehogs as balls! The Cheshire Cat appears as just a floating head, causing a big argument about whether you can behead someone who has no body.",
        "Characters You'll Meet": "The Queen of Hearts — \"Off with her head!\" is her favourite phrase\nThe King of Hearts — much kinder than the Queen\nTwo, Five, and Seven — card gardeners painting roses red\nThe Knave of Hearts — carries the King's crown\nThe Gryphon — half eagle, half lion, lying in the sun",
        "Famous Lines": "\"Off with her head!\"\n\n\"Nonsense!\" said Alice.\n\n\"Why, they're only a pack of cards, after all. I needn't be afraid of them!\"\n\n\"You couldn't cut off a head unless there was a body to cut it off from.\"\n\n\"They never executes nobody, you know.\"",
        "Things to Talk About": "The gardeners paint white roses red to hide their mistake. Have you ever tried to cover up a mistake? Did it work?\n\nThe Queen shouts \"Off with her head!\" but Alice stands up to her. What makes Alice brave?\n\nImagine playing croquet with flamingos and hedgehogs — what would go wrong?"
      },
      "keywords": ["Queen of Hearts", "croquet", "painting roses red", "off with her head", "flamingo", "hedgehog", "cards", "bravery"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/2/21/Alice_par_John_Tenniel_28.png",
      "sort_order": 8,
      "metadata": {
        "chapter_number": 8,
        "original_title": "The Queen's Croquet-Ground",
        "key_illustration": "Alice playing croquet with a flamingo"
      }
    },
    {
      "id": "chapter-09-the-mock-turtles-story",
      "name": "Chapter IX — The Mock Turtle's Story",
      "symbol": "IX",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "\"You can't think how glad I am to see you again, you dear old thing!\" said the Duchess, tucking her arm affectionately into Alice's.\n\nAlice thought perhaps it was only the pepper that had made her so savage. The Duchess was determined to find a moral in everything:\n\n\"'Tis love, 'tis love, that makes the world go round!\"\n\n\"Somebody said that it's done by everybody minding their own business!\"\n\n\"Ah, well! It means much the same thing,\" said the Duchess, digging her sharp little chin into Alice's shoulder. She found a moral in flamingoes, mustard, and everything else — \"Be what you would seem to be\" — until the Queen appeared, frowning like a thunderstorm.\n\n\"Either you or your head must be off!\" shouted the Queen. The Duchess took her choice, and was gone in a moment.\n\nThe Queen brought Alice to the Gryphon, who was lying asleep in the sun. \"Up, lazy thing! Take this young lady to see the Mock Turtle.\"\n\n\"It's all her fancy, that,\" chuckled the Gryphon after the Queen left. \"They never executes nobody, you know.\"\n\nThey found the Mock Turtle sitting sad and lonely on a little ledge of rock, sighing as if his heart would break.\n\n\"Once,\" said the Mock Turtle at last, with a deep sigh, \"I was a real Turtle.\"\n\nHe told them about his school in the sea. The master was called Tortoise — \"We called him Tortoise because he taught us.\" They learned Reeling and Writhing (not Reading and Writing!), and Arithmetic was Ambition, Distraction, Uglification, and Derision. The Drawling-master was an old conger-eel. They had lessons that \"lessened\" from day to day — ten hours the first day, nine the next, and so on.\n\n\"Then the eleventh day must have been a holiday?\" said Alice.\n\n\"Of course it was,\" said the Mock Turtle.\n\n\"And how did you manage on the twelfth?\" Alice went on eagerly.\n\n\"That's enough about lessons,\" the Gryphon interrupted.",
        "For Young Readers": "Alice walks with the Duchess, who finds a \"moral\" in absolutely everything. The Queen scares the Duchess away, then sends Alice (with the Gryphon) to meet the Mock Turtle.\n\nThe Mock Turtle is the saddest creature — he sits on a rock sighing and crying. \"Once I was a real Turtle,\" he says mournfully. He tells Alice about his school under the sea, where instead of Reading and Writing they learned \"Reeling and Writhing,\" and their Arithmetic was \"Ambition, Distraction, Uglification, and Derision.\" Every day they had fewer hours of lessons — they \"lessened\" from day to day!",
        "Characters You'll Meet": "The Mock Turtle — sad, sentimental, used to be a \"real Turtle\" (the thing Mock Turtle Soup is made from!)\nThe Gryphon — half eagle, half lion, not as serious as he looks\nThe Duchess — finds a moral in everything\nThe Tortoise — the school master (\"because he taught us\")",
        "Famous Lines": "\"Once I was a real Turtle.\"\n\n\"We called him Tortoise because he taught us.\"\n\n\"Reeling and Writhing, of course, to begin with.\"\n\n\"Everything's got a moral, if only you can find it.\"\n\n\"Be what you would seem to be.\"",
        "Things to Talk About": "The Mock Turtle's school subjects are all puns — \"Reeling and Writhing\" sounds like \"Reading and Writing.\" Can you figure out what \"Ambition, Distraction, Uglification, and Derision\" are puns for?\n\nWhy is the Mock Turtle so sad? Is it because he's not a real turtle anymore?\n\nThe lessons \"lessen\" — 10 hours, then 9, then 8... What happens on the twelfth day?"
      },
      "keywords": ["Mock Turtle", "Gryphon", "school", "puns", "tortoise", "lessons", "Duchess", "morals", "reeling and writhing"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Alice_par_John_Tenniel_34.png",
      "sort_order": 9,
      "metadata": {
        "chapter_number": 9,
        "original_title": "The Mock Turtle's Story",
        "key_illustration": "Alice with the Mock Turtle and the Gryphon"
      }
    },
    {
      "id": "chapter-10-the-lobster-quadrille",
      "name": "Chapter X — The Lobster Quadrille",
      "symbol": "X",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "The Mock Turtle and the Gryphon demonstrated the Lobster Quadrille — a wild dance where you line up along the sea-shore, each with a lobster as a partner, advance twice, change lobsters, throw them as far out to sea as you can, swim after them, turn a somersault, and come back to land.\n\nThey began solemnly dancing round and round Alice, treading on her toes, while the Mock Turtle sang:\n\n\"Will you walk a little faster?\" said a whiting to a snail.\n\"There's a porpoise close behind us, and he's treading on my tail.\nSee how eagerly the lobsters and the turtles all advance!\nThey are waiting on the shingle — will you come and join the dance?\nWill you, won't you, will you, won't you, will you join the dance?\"\n\nThe Gryphon explained about whiting: \"It does the boots and shoes.\" Under the sea, boots and shoes are done with a whiting (instead of blacking). And they're made of soles and eels (not leather soles and heels).\n\n\"No wise fish would go anywhere without a porpoise,\" said the Mock Turtle.\n\n\"Don't you mean 'purpose'?\" said Alice.\n\n\"I mean what I say,\" the Mock Turtle replied.\n\nAlice told them her adventures, and then was asked to recite another poem — which came out all wrong again, about a Lobster who was baked too brown.\n\nThe Mock Turtle sang \"Beautiful Soup\" — a melancholy love song to soup:\n\n\"Beautiful Soup, so rich and green,\nWaiting in a hot tureen!\nWho for such dainties would not stoop?\nSoup of the evening, beautiful Soup!\"\n\nJust as they were about to sing the chorus again, a cry of \"The trial's beginning!\" was heard in the distance, and the Gryphon hurried Alice away.",
        "For Young Readers": "The Mock Turtle and Gryphon show Alice the Lobster Quadrille — the silliest dance ever, where you dance with lobsters and throw them into the sea! They sing wonderful songs about a whiting and a snail, and the Mock Turtle sings a beautiful, sad song to his favourite thing — soup!\n\nEverything under the sea is a pun: shoes are done with \"whiting\" (not blacking), and no fish goes anywhere without a \"porpoise\" (purpose!). Then a distant cry announces that a trial is beginning!",
        "Characters You'll Meet": "The Mock Turtle — singer of \"Beautiful Soup\" and the Lobster Quadrille\nThe Gryphon — the Mock Turtle's dancing partner\nThe Whiting — does the boots and shoes under the sea\nThe Lobsters — everyone's dance partners",
        "Famous Lines": "\"Will you, won't you, will you, won't you, will you join the dance?\"\n\n\"Beautiful Soup, so rich and green, waiting in a hot tureen!\"\n\n\"No wise fish would go anywhere without a porpoise.\"\n\n\"The trial's beginning!\"",
        "Things to Talk About": "Can you imagine dancing the Lobster Quadrille? What would it look like?\n\n\"No wise fish would go anywhere without a porpoise/purpose\" — do you think you need a purpose to go somewhere?\n\nThe Mock Turtle loves soup so much he sings to it. What food would YOU write a love song about?"
      },
      "keywords": ["Lobster Quadrille", "dance", "Beautiful Soup", "whiting", "porpoise", "purpose", "puns", "trial"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/2/24/Alice_par_John_Tenniel_36.png",
      "sort_order": 10,
      "metadata": {
        "chapter_number": 10,
        "original_title": "The Lobster Quadrille",
        "key_illustration": "The Lobster Quadrille dance"
      }
    },
    {
      "id": "chapter-11-who-stole-the-tarts",
      "name": "Chapter XI — Who Stole the Tarts?",
      "symbol": "XI",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "The King and Queen of Hearts were seated on their throne, with a great crowd assembled about them — all sorts of little birds and beasts, as well as the whole pack of cards. The Knave was standing before them, in chains, accused of stealing the Queen's tarts.\n\nThe White Rabbit, acting as herald, read the accusation:\n\n\"The Queen of Hearts, she made some tarts,\n    All on a summer day:\nThe Knave of Hearts, he stole those tarts,\n    And took them quite away!\"\n\nThe judge was the King himself, wearing his crown over his wig (which did not look at all comfortable). The twelve jurors were all writing busily on slates — writing down their names, for fear they should forget them before the end of the trial!\n\nAlice was growing larger again, and the Dormouse (who was sitting next to her) complained: \"I wish you wouldn't squeeze so. I can hardly breathe.\"\n\nThe first witness was the Hatter, still carrying his teacup. He couldn't remember anything useful. When one of the guinea-pigs cheered, it was immediately \"suppressed\" — stuffed into a canvas bag!\n\n\"I'm glad I've seen that done,\" thought Alice. \"I've so often read in the newspapers about someone being 'suppressed' and I never understood what it meant till now.\"\n\nThe next witness was the Duchess's cook, who refused to give evidence. \"Shan't,\" she said. What are tarts made of? \"Pepper, mostly.\"\n\n\"Treacle,\" said the Dormouse sleepily. \"Collar that Dormouse! Behead that Dormouse!\" shrieked the Queen.\n\nThen the White Rabbit read out the name of the last witness — \"Alice!\"",
        "For Young Readers": "It's trial time! The Knave of Hearts is accused of stealing the Queen's tarts. The King is the judge (wearing his crown on top of a wig — very uncomfortable). The jury is writing on slates, and they're so silly they write down their own names so they won't forget!\n\nThe Mad Hatter comes as a witness but can't remember anything. The cook says tarts are made of pepper. The Dormouse shouts \"Treacle!\" and gets thrown out. And then — the last witness called is... ALICE!",
        "Characters You'll Meet": "The Knave of Hearts — accused of stealing tarts\nThe King of Hearts — the judge\nThe White Rabbit — the herald\nThe twelve jurors — silly animals and birds writing on slates\nBill the Lizard — one of the jurors (remember him from the chimney?)",
        "Famous Lines": "\"The Queen of Hearts, she made some tarts, all on a summer day...\"\n\n\"Consider your verdict,\" the King said to the jury.\n\n\"Not yet, not yet! There's a great deal to come before that!\"\n\n\"Give your evidence, or I'll have you executed on the spot.\"\n\n\"Collar that Dormouse! Behead that Dormouse!\"",
        "Things to Talk About": "Is this a fair trial? What's wrong with it?\n\nThe jurors write everything down — even \"stupid things\" — without knowing if it matters. Why is that funny?\n\nHow do you think Alice feels about being called as a witness? She doesn't know anything about the tarts!"
      },
      "keywords": ["trial", "tarts", "Knave of Hearts", "jury", "evidence", "Hatter", "cook", "justice"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Alice_par_John_Tenniel_38.png",
      "sort_order": 11,
      "metadata": {
        "chapter_number": 11,
        "original_title": "Who Stole the Tarts?",
        "key_illustration": "The trial scene with the King and Queen of Hearts"
      }
    },
    {
      "id": "chapter-12-alices-evidence",
      "name": "Chapter XII — Alice's Evidence",
      "symbol": "XII",
      "level": 1,
      "category": "chapter",
      "sections": {
        "Story": "\"Here!\" cried Alice, quite forgetting how large she had grown, and she jumped up in such a hurry that she tipped over the jury-box with the edge of her skirt, upsetting all the jurymen on to the heads of the crowd below.\n\n\"What do you know about this business?\" the King said to Alice.\n\n\"Nothing,\" said Alice.\n\n\"Nothing whatever?\" persisted the King.\n\n\"Nothing whatever,\" said Alice.\n\nThe King declared \"Rule Forty-two: All persons more than a mile high to leave the court.\"\n\n\"I'm not a mile high,\" said Alice.\n\n\"You are,\" said the King.\n\n\"Nearly two miles high,\" added the Queen.\n\n\"Well, I shan't go, at any rate,\" said Alice. \"Besides, that's not a regular rule: you invented it just now.\"\n\n\"It's the oldest rule in the book,\" said the King.\n\n\"Then it ought to be Number One,\" said Alice.\n\nThe White Rabbit produced a mysterious letter written in verse, which nobody could understand. The King tried to find meaning in it — \"'I gave her one, they gave him two' — why, that must be what he did with the tarts!\"\n\n\"If any one of them can explain it,\" said Alice (she had grown so large she wasn't a bit afraid), \"I'll give him sixpence. I don't believe there's an atom of meaning in it.\"\n\n\"No, no!\" said the Queen. \"Sentence first — verdict afterwards.\"\n\n\"Stuff and nonsense!\" said Alice loudly. \"The idea of having the sentence first!\"\n\n\"Hold your tongue!\" said the Queen, turning purple.\n\n\"I won't!\" said Alice.\n\n\"Off with her head!\" the Queen shouted at the top of her voice. Nobody moved.\n\n\"Who cares for you?\" said Alice (she had grown to her full size by this time). \"You're nothing but a pack of cards!\"\n\nAt this the whole pack rose up into the air, and came flying down upon her: she gave a little scream, half of fright and half of anger, and tried to beat them off, and found herself lying on the bank, with her head in the lap of her sister, who was gently brushing away some dead leaves that had fluttered down from the trees upon her face.\n\n\"Wake up, Alice dear! Why, what a long sleep you've had!\"\n\n\"Oh, I've had such a curious dream!\" said Alice.\n\nAnd she told her sister all these strange Adventures. Her sister kissed her and said, \"It was a curious dream, dear, certainly: but now run in to your tea; it's getting late.\"\n\nSo Alice got up and ran off, thinking while she ran, as well she might, what a wonderful dream it had been.",
        "For Young Readers": "Alice is called to the witness stand and she's grown so big she accidentally knocks over the entire jury! The King makes up a silly rule that anyone taller than a mile has to leave, but Alice won't go.\n\nThe Queen demands \"Sentence first — verdict afterwards!\" Alice has finally had enough. She stands up to her full height and says the most powerful words in the whole book:\n\n\"Who cares for you? You're nothing but a pack of cards!\"\n\nThe cards fly up into the air and come raining down — and suddenly Alice wakes up on the riverbank with her head in her sister's lap. Dead leaves, not cards, are falling on her face. It was all a dream!\n\nOr was it? Alice's sister sits and dreams of little Alice and all her wonderful adventures, and imagines Alice growing up to tell these stories to other children someday — perhaps even to YOU.",
        "Characters You'll Meet": "Alice — at her bravest and tallest, standing up to the Queen at last\nThe Queen of Hearts — \"Sentence first — verdict afterwards!\"\nThe King of Hearts — making up rules\nAlice's sister — who wakes her from the dream",
        "Famous Lines": "\"Sentence first — verdict afterwards.\"\n\n\"Stuff and nonsense!\"\n\n\"Who cares for you? You're nothing but a pack of cards!\"\n\n\"Begin at the beginning, and go on till you come to the end: then stop.\"\n\n\"Oh, I've had such a curious dream!\"\n\n\"It was a curious dream, dear, certainly: but now run in to your tea; it's getting late.\"",
        "Things to Talk About": "Alice finally stands up to the Queen. What gives her the courage?\n\nWas it really just a dream? Alice's sister dreams about it too — what do you think?\n\nThe King says to \"Begin at the beginning, and go on till you come to the end: then stop.\" Is that good advice for reading, for telling stories, for life?\n\nWhich was your favourite chapter? Which character would you most like to meet?"
      },
      "keywords": ["evidence", "pack of cards", "waking up", "dream", "bravery", "sentence first", "ending", "sister"],
      "image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Alice_par_John_Tenniel_42.png",
      "sort_order": 12,
      "metadata": {
        "chapter_number": 12,
        "original_title": "Alice's Evidence",
        "key_illustration": "The cards flying up into the air"
      }
    }
  ],
  "_category_roles": {
    "chapter": "card"
  },
  "metadata": {
    "created": "2026-02-26",
    "last_updated": "2026-02-26",
    "license": "CC-BY-SA-4.0",
    "source_text_license": "Public Domain (Project Gutenberg eBook #11)",
    "illustrations_license": "Public Domain (Sir John Tenniel, 1865, via Wikimedia Commons)",
    "note": "Alice's Adventures in Wonderland by Lewis Carroll (1865), adapted as a chapter-book grammar for the recursive.eco platform. Each chapter is a card you can draw, read aloud, and discuss. Original text from Project Gutenberg. Original illustrations by Sir John Tenniel (1865), public domain. The 'For Young Readers' summaries and 'Things to Talk About' questions are designed for reading with children ages 5-10."
  }
}