{
  "name": "Bulfinch's Classical Mythology",
  "description": "Mythological stories of the gods, heroes, and constellations from Thomas Bulfinch's 'The Age of Fable' (1855). Presents the Greek and Roman myths behind the planets and zodiac signs, connecting astrology to its ancient narrative roots.",
  "grammar_type": "astrology",
  "attribution": {
    "source_name": "Bulfinch's Mythology: The Age of Fable",
    "source_author": "Thomas Bulfinch",
    "source_year": "1855",
    "license": "Public Domain",
    "source_url": "https://www.gutenberg.org/ebooks/4928"
  },
  "interpretations": [
    {
      "type": "planet",
      "planet": "Saturn",
      "story": "Saturn (Cronos) was father of Jupiter, Neptune, and Pluto. 'His reign is said to have been the golden age of innocence and purity, and on the other he is described as a monster who devoured his children.' Jupiter escaped and later caused Saturn to disgorge his siblings. The Titans were overthrown and Saturn's dominion transferred to Jupiter.",
      "light": "The Golden Age of innocence and purity—when 'all things belonged equally to all'",
      "shadow": "The devouring father—time that consumes all it creates",
      "keywords": ["Cronos", "Titans", "Golden Age", "time", "father", "devouring"],
      "quotes": [
        "Saturn (Cronos) was his father, and Rhea (Ops) his mother. Saturn and Rhea were of the race of Titans, who were the children of Earth and Heaven, which sprang from Chaos.",
        "The representations given of Saturn are not very consistent; for on the one hand his reign is said to have been the golden age of innocence and purity, and on the other he is described as a monster who devoured his children.",
        "Jupiter, however, escaped this fate, and when grown up espoused Metis (Prudence), who administered a draught to Saturn which caused him to disgorge his children.",
        "Jupiter, with his brothers and sisters, now rebelled against their father Saturn and his brothers the Titans; vanquished them, and imprisoned some of them in Tartarus.",
        "In memory of his beneficent dominion, the feast of Saturnalia was held every year in the winter season.",
        "Friends made presents to one another and the slaves were indulged with great liberties... to show the natural equality of men, and that all things belonged equally to all, in the reign of Saturn."
      ],
      "sort_order": 0
    },
    {
      "type": "planet",
      "planet": "Jupiter",
      "story": "Jupiter (Zeus), 'though called the father of gods and men, had himself a beginning.' He overthrew his father Saturn and divided the cosmos with his brothers—taking the heavens for himself. 'The thunder was his weapon, and he bore a shield called Aegis.' The eagle was his favorite bird and bore his thunderbolts.",
      "light": "King of gods and men, wielder of thunder, supreme authority and order",
      "shadow": "The usurper who overthrew his own father—power gained through rebellion",
      "keywords": ["Zeus", "thunder", "eagle", "Aegis", "king", "Olympus"],
      "quotes": [
        "Jupiter, or Jove (Zeus), though called the father of gods and men, had himself a beginning.",
        "On the dethronement of Saturn, Jupiter with his brothers Neptune (Poseidon) and Pluto (Dis) divided his dominions. Jupiter's portion was the heavens, Neptune's the ocean, and Pluto's the realms of the dead.",
        "Jupiter was king of gods and men. The thunder was his weapon, and he bore a shield called Aegis, made for him by Vulcan. The eagle was his favorite bird, and bore his thunderbolts.",
        "It was also in the great hall of the palace of the Olympian king that the gods feasted each day on ambrosia and nectar.",
        "The abode of the gods was on the summit of Mount Olympus, in Thessaly. A gate of clouds, kept by the goddesses named the Seasons, opened to permit the passage of the Celestials to earth.",
        "I call to witness that dreadful lake, which I never saw, but which we gods swear by in our most solemn engagements."
      ],
      "sort_order": 1
    },
    {
      "type": "planet",
      "planet": "Mars",
      "story": "Mars (Ares), the god of war, was the son of Jupiter and Juno. Unlike the Greek tradition which considered him brutal and bloodthirsty, the Romans honored Mars as the father of Romulus, founder of Rome. His sacred animals were the wolf and the woodpecker.",
      "light": "Courage in battle, the protector of cities, father of civilization",
      "shadow": "Bloodshed and destruction, the violence that builds empires",
      "keywords": ["Ares", "war", "battle", "Romulus", "wolf", "courage"],
      "quotes": [
        "Mars (Ares), the god of war, was the son of Jupiter and Juno.",
        "Quirinus was a war god, said to be no other than Romulus, the founder of Rome, exalted after his death to a place among the gods.",
        "Bellona, a war goddess.",
        "The native born under the influence of Mars is usually of fierce countenance, his eyes sparkling, or sharp and darting.",
        "In character the Martialist is fiery and choleric, naturally delighting in war and contention, but generous and magnanimous.",
        "The persons signified by Mars are generals, soldiers, sailors, surgeons, chemists, doctors, armourers."
      ],
      "sort_order": 2
    },
    {
      "type": "planet",
      "planet": "Sun",
      "story": "Phoebus Apollo drove the chariot of the sun across the sky each day. His son Phaeton begged to drive the sun chariot to prove his divine parentage. 'Phaeton immediately asked to be permitted for one day to drive the chariot of the sun.' Unable to control the horses, Phaeton set the world ablaze until Jupiter struck him down with a thunderbolt.",
      "light": "Divine radiance, truth revealed, the proof of one's heritage",
      "shadow": "Hubris punished—reaching beyond one's capacity brings destruction",
      "keywords": ["Apollo", "Phoebus", "Phaeton", "chariot", "radiance", "hubris"],
      "quotes": [
        "Phoebus Apollo, the god of archery, prophecy, and music, was the son of Jupiter and Latona, and brother of Diana. He was god of the sun, as Diana, his sister, was the goddess of the moon.",
        "The palace of the Sun stood reared aloft on columns, glittering with gold and precious stones, while polished ivory formed the ceilings, and silver the doors.",
        "On the silver doors the twelve signs of the zodiac, six on each side.",
        "Phaeton immediately asked to be permitted for one day to drive the chariot of the sun. The father repented of his promise; thrice and four times he shook his radiant head in warning.",
        "Your lot is mortal, and you ask what is beyond a mortal's power. In your ignorance you aspire to do that which not even the gods themselves may do.",
        "Phaeton, with his hair on fire, fell headlong, like a shooting star which marks the heavens with its brightness as it falls."
      ],
      "sort_order": 3
    },
    {
      "type": "planet",
      "planet": "Venus",
      "story": "Venus (Aphrodite), the goddess of love and beauty, 'sprang from the foam of the sea. The zephyr wafted her along the waves to the Isle of Cyprus, where she was received and attired by the Seasons.' Though the most beautiful goddess, Jupiter gave her to Vulcan, the most ill-favored of gods. She possessed the Cestus, an embroidered girdle with the power of inspiring love.",
      "light": "Love and beauty that charm all hearts, the power to inspire devotion",
      "shadow": "Beauty given to the unworthy—the mismatch of outer and inner worth",
      "keywords": ["Aphrodite", "love", "beauty", "Cestus", "sea foam", "Cyprus"],
      "quotes": [
        "Venus (Aphrodite), the goddess of love and beauty, was the daughter of Jupiter and Dione. Others say that Venus sprang from the foam of the sea.",
        "The zephyr wafted her along the waves to the Isle of Cyprus, where she was received and attired by the Seasons, and then led to the assembly of the gods.",
        "All were charmed with her beauty, and each one demanded her for his wife. Jupiter gave her to Vulcan, in gratitude for the service he had rendered in forging thunderbolts.",
        "So the most beautiful of the goddesses became the wife of the most ill-favored of gods.",
        "Venus possessed an embroidered girdle called Cestus, which had the power of inspiring love.",
        "Her favorite birds were swans and doves, and the plants sacred to her were the rose and the myrtle."
      ],
      "sort_order": 4
    },
    {
      "type": "planet",
      "planet": "Mercury",
      "story": "Mercury (Hermes) was the son of Jupiter and Maia, messenger of the gods. 'He presided over commerce, wrestling, and other gymnastic exercises, even over thieving, and everything which required skill and dexterity.' He wore winged cap and winged shoes, and bore the caduceus, a rod entwined with two serpents. Mercury invented the lyre from a tortoise shell.",
      "light": "Swift messenger, patron of eloquence, inventor and guide of souls",
      "shadow": "God of thieves—skill and dexterity used for cunning purposes",
      "keywords": ["Hermes", "messenger", "caduceus", "commerce", "eloquence", "thievery"],
      "quotes": [
        "Mercury (Hermes) was the son of Jupiter and Maia. He presided over commerce, wrestling, and other gymnastic exercises, even over thieving, and everything, in short, which required skill and dexterity.",
        "He was the messenger of Jupiter, and wore a winged cap and winged shoes. He bore in his hand a rod entwined with two serpents, called the caduceus.",
        "Mercury is said to have invented the lyre. He found, one day, a tortoise, of which he took the shell, made holes in the opposite edges of it, and drew cords of linen through them, and the instrument was complete.",
        "The cords were nine, in honor of the nine Muses. Mercury gave the lyre to Apollo, and received from him in exchange the caduceus.",
        "The persons signified by Mercury are astrologers, philosophers, mathematicians, politicians, merchants, travellers, teachers, poets, artificers, men of science, and all ingenious, clever men.",
        "When he is ill affected, however, he represents pettifoggers, cunning vile persons, thieves, messengers, footmen, and servants."
      ],
      "sort_order": 5
    },
    {
      "type": "planet",
      "planet": "Moon",
      "story": "Diana (Artemis), goddess of the moon, was twin sister to Apollo the sun god. She was goddess of the hunt and protectress of the young. The tragic tale of Orion tells how 'observing Orion wading through the sea with his head just above the water, Apollo pointed it out to his sister and maintained that she could not hit that black thing on the sea.' Diana shot her beloved Orion by accident.",
      "light": "Huntress and protector, mistress of the wild places and the night",
      "shadow": "Fatal accuracy—the arrow that strikes those we love most",
      "keywords": ["Diana", "Artemis", "huntress", "Orion", "night", "chastity"],
      "quotes": [
        "Phoebus Apollo was god of the sun, as Diana, his sister, was the goddess of the moon.",
        "After this he dwelt as a hunter with Diana, with whom he was a favorite, and it is even said she was about to marry him.",
        "Her brother was highly displeased and often chid her, but to no purpose.",
        "One day, observing Orion wading through the sea with his head just above the water, Apollo pointed it out to his sister and maintained that she could not hit that black thing on the sea.",
        "The archer-goddess discharged a shaft with fatal aim. The waves rolled the dead body of Orion to the land, and bewailing her fatal error with many tears, Diana placed him among the stars.",
        "Where he appears as a giant, with a girdle, sword, lion's skin, and club. Sirius, his dog, follows him, and the Pleiads fly before him."
      ],
      "sort_order": 6
    },
    {
      "type": "sign",
      "sign": "Aries",
      "story": "The Golden Ram that saved Phryxus from sacrifice. His stepmother Ino plotted against him, but his mother Nephele 'obtained from Mercury a ram with a golden fleece, on which she set the two children, trusting that the ram would convey them to a place of safety.' The ram flew east; Helle fell into the sea (the Hellespont), but Phryxus reached Colchis safely and sacrificed the ram to Jupiter.",
      "light": "Divine rescue, the fleece of gold that carries the worthy to safety",
      "shadow": "The sacrifice of the savior—the ram dies to complete its mission",
      "keywords": ["Golden Fleece", "Phryxus", "Helle", "Colchis", "sacrifice", "rescue"],
      "quotes": [
        "From every region of Aegea's shore the brave assembled... On deep Iolcos' sandy shore they thronged, gleaming in armor, ardent of exploits.",
        "His mother obtained from Mercury a ram with a golden fleece, on which she set the two children, trusting that the ram would convey them to a place of safety.",
        "The ram vaulted into the air with the children on his back, taking his course to the East.",
        "The girl, whose name was Helle, fell from his back into the sea, which from her was called the Hellespont.",
        "Phryxus sacrificed the ram to Jupiter, and gave the Golden Fleece to Aeetes, who placed it in a consecrated grove, under the care of a sleepless dragon.",
        "The young man the glorious adventure of going in quest of the Golden Fleece, which was in the kingdom of Colchis."
      ],
      "sort_order": 10
    },
    {
      "type": "sign",
      "sign": "Taurus",
      "story": "Jupiter, disguised as a beautiful white bull, carried off Europa, princess of Phoenicia. 'Jupiter, under the disguise of a bull, had carried away Europa, the daughter of Agenor, king of Phoenicia.' The bull swam across the sea to Crete, where Europa became mother of King Minos. Her brother Cadmus was sent to find her and founded Thebes instead.",
      "light": "Divine abduction leading to royal lineage—beauty that attracts the gods",
      "shadow": "Deception in gentleness—the mild bull conceals the ravisher",
      "keywords": ["Europa", "Zeus", "Crete", "Minos", "Cadmus", "abduction"],
      "quotes": [
        "Jupiter, under the disguise of a bull, had carried away Europa, the daughter of Agenor, king of Phoenicia.",
        "Agenor commanded his son Cadmus to go in search of his sister, and not to return without her.",
        "Still another depicted Europa deceived by Jupiter under the disguise of a bull.",
        "Encouraged by the tameness of the animal Europa ventured to mount his back, whereupon Jupiter advanced into the sea and swam with her to Crete.",
        "You would have thought it was a real bull, so naturally was it wrought, and so natural the water in which it swam.",
        "Sweet Europa's mantle blew unclasped from off her shoulder, backward borne, from one hand drooped a crocus, one hand grasped the mild bull's golden horn."
      ],
      "sort_order": 11
    },
    {
      "type": "sign",
      "sign": "Gemini",
      "story": "Castor and Pollux, the divine twins, were born from an egg after Jupiter visited Leda as a swan. 'Castor was famous for taming and managing horses, and Pollux for skill in boxing. They were united by the warmest affection and inseparable in all their enterprises.' When Castor was slain, Pollux begged to share his immortality, and Jupiter placed them together among the stars.",
      "light": "Inseparable brotherhood, devotion that transcends death",
      "shadow": "One mortal, one divine—the asymmetry of twin fates",
      "keywords": ["Castor", "Pollux", "Dioscuri", "twins", "Leda", "devotion"],
      "quotes": [
        "Castor and Pollux were the offspring of Leda and the Swan, under which disguise Jupiter had concealed himself. Leda gave birth to an egg from which sprang the twins.",
        "Castor was famous for taming and managing horses, and Pollux for skill in boxing. They were united by the warmest affection and inseparable in all their enterprises.",
        "From this incident, Castor and Pollux came afterwards to be considered the patron deities of seamen and voyagers.",
        "Castor was slain, and Pollux, inconsolable for the loss of his brother, besought Jupiter to be permitted to give his own life as a ransom for him.",
        "Jupiter so far consented as to allow the two brothers to enjoy the boon of life alternately, passing one day under the earth and the next in the heavenly abodes.",
        "According to another form of the story, Jupiter rewarded the attachment of the brothers by placing them among the stars as Gemini the Twins."
      ],
      "sort_order": 12
    },
    {
      "type": "sign",
      "sign": "Cancer",
      "story": "When Hercules battled the nine-headed Hydra in the swamp of Lerna, Juno sent a giant crab to attack him, biting at his heels. Hercules crushed the crab, but Juno honored its service by placing it among the stars. The crab's loyalty to the queen of heaven, even against the greatest hero, earned it immortality in the zodiac.",
      "light": "Loyal service to higher powers, persistence against overwhelming odds",
      "shadow": "Crushed underfoot—devotion that ends in destruction",
      "keywords": ["Hercules", "Hydra", "Juno", "crab", "loyalty", "Lerna"],
      "quotes": [
        "His next labor was the slaughter of the Hydra. This monster ravaged the country of Argos, and dwelt in a swamp near the well of Amymone.",
        "The Hydra had nine heads, of which the middle one was immortal. Hercules struck off its heads with his club, but in the place of the head knocked off, two new ones grew forth each time.",
        "Juno was always hostile to the offspring of her husband by mortal mothers, she declared war against Hercules from his birth.",
        "She sent two serpents to destroy him as he lay in his cradle, but the precocious infant strangled them with his own hands.",
        "At length with the assistance of his faithful servant Iolaus, he burned away the heads of the Hydra, and buried the ninth or immortal one under a huge rock.",
        "Juno, to gratify her resentment, sent assistance to the Hydra in the form of a crab."
      ],
      "sort_order": 13
    },
    {
      "type": "sign",
      "sign": "Leo",
      "story": "The Nemean Lion was Hercules' first of twelve labors. 'The valley of Nemea was infested by a terrible lion. Eurystheus ordered Hercules to bring him the skin of this monster.' The lion's hide could not be pierced by weapons, so Hercules strangled it with his bare hands. He ever after wore the lion's skin as armor, and the lion was placed among the stars.",
      "light": "Invincible strength, the trophy of supreme victory worn as protection",
      "shadow": "A terror that required a hero—evil so great only divinity could defeat it",
      "keywords": ["Hercules", "Nemean Lion", "labor", "strength", "invincible", "lion skin"],
      "quotes": [
        "The first was the fight with the Nemean lion. The valley of Nemea was infested by a terrible lion.",
        "Eurystheus ordered Hercules to bring him the skin of this monster.",
        "After using in vain his club and arrows against the lion, Hercules strangled the animal with his hands.",
        "He returned carrying the dead lion on his shoulders; but Eurystheus was so frightened at the sight of it and at this proof of the prodigious strength of the hero.",
        "That he ordered him to deliver the account of his exploits in future outside the town.",
        "On the celestial globe Orion is represented as robed in a lion's skin and wielding a club."
      ],
      "sort_order": 14
    },
    {
      "type": "sign",
      "sign": "Virgo",
      "story": "Virgo represents Astraea, goddess of justice, who was the last of the immortals to leave earth at the end of the Golden Age. As humanity grew wicked, the gods withdrew one by one to Olympus. Astraea lingered longest, hoping for humanity's return to virtue. Finally even she departed, but was placed among the stars holding her scales of justice (Libra beside her).",
      "light": "Hope that lingers when all others have abandoned—faith in human virtue",
      "shadow": "The last departure—even justice eventually flees corruption",
      "keywords": ["Astraea", "justice", "purity", "Golden Age", "departure", "virtue"],
      "quotes": [
        "In memory of his beneficent dominion, the feast of Saturnalia was held every year in the winter season.",
        "Then all public business was suspended, declarations of war and criminal executions were postponed.",
        "Friends made presents to one another and the slaves were indulged with great liberties.",
        "A feast was given them at which they sat at table, while their masters served them.",
        "To show the natural equality of men, and that all things belonged equally to all, in the reign of Saturn.",
        "The Fates were also three—Clotho, Lachesis, and Atropos. Their office was to spin the thread of human destiny."
      ],
      "sort_order": 15
    },
    {
      "type": "sign",
      "sign": "Libra",
      "story": "The Scales of Justice belong to Astraea (Virgo), placed beside her in the heavens. They represent the balance by which mortals are judged—the weighing of hearts against truth. In the Golden Age under Saturn, 'all things belonged equally to all,' but as that age ended, the scales became necessary to measure what was owed to each.",
      "light": "Divine balance, the measure of truth against falsehood",
      "shadow": "The end of equality—scales needed only when natural harmony fails",
      "keywords": ["Astraea", "scales", "justice", "balance", "equality", "judgment"],
      "quotes": [
        "The Fates were armed with shears, with which they cut it off when they pleased. They were the daughters of Themis (Law), who sits by Jove on his throne to give him counsel.",
        "Nemesis was also an avenging goddess. She represents the righteous anger of the gods, particularly towards the proud and insolent.",
        "To show the natural equality of men, and that all things belonged equally to all, in the reign of Saturn.",
        "The Erinnyes, or Furies, were three goddesses who punished by their secret stings the crimes of those who escaped or defied public justice.",
        "The heads of the Furies were wreathed with serpents, and their whole appearance was terrific and appalling.",
        "Their names were Alecto, Tisiphone, and Megaera. They were also called Eumenides."
      ],
      "sort_order": 16
    },
    {
      "type": "sign",
      "sign": "Scorpio",
      "story": "In Phaeton's disastrous ride, the scorpion was among the terrors that caused him to lose control. 'Here the Scorpion extended his two great arms, with his tail and crooked claws stretching over two signs of the zodiac. When the boy beheld him, reeking with poison and menacing with his fangs, his courage failed, and the reins fell from his hands.' The scorpion is also linked to Orion's death in some tellings.",
      "light": "Cosmic guardian, the terror that keeps mortals from overreaching",
      "shadow": "Poison that waits in darkness, menace that paralyzes the bold",
      "keywords": ["Phaeton", "Orion", "poison", "terror", "zodiac", "venom"],
      "quotes": [
        "He sees with terror the monstrous forms scattered over the surface of heaven.",
        "Here the Scorpion extended his two great arms, with his tail and crooked claws stretching over two signs of the zodiac.",
        "When the boy beheld him, reeking with poison and menacing with his fangs, his courage failed, and the reins fell from his hands.",
        "The horses, when they felt them loose on their backs, dashed headlong, and unrestrained went off into unknown regions of the sky.",
        "You pass by the horns of the Bull, in front of the Archer, and near the Lion's jaws, and where the Scorpion stretches its arms in one direction and the Crab in another.",
        "Nor will you find it easy to guide those horses, with their breasts full of fire that they breathe forth from their mouths and nostrils."
      ],
      "sort_order": 17
    },
    {
      "type": "sign",
      "sign": "Sagittarius",
      "story": "Chiron was the wisest of the Centaurs, 'instructed by Apollo and Diana, and renowned for his skill in hunting, medicine, music, and the art of prophecy.' Unlike the wild centaurs, he taught the greatest heroes of Greece. 'Chiron was the wisest and justest of all the Centaurs, and at his death Jupiter placed him among the stars as the constellation Sagittarius.'",
      "light": "Wisdom that bridges human and divine, teacher of heroes",
      "shadow": "The civilized among the wild—nobility that exists in isolation",
      "keywords": ["Chiron", "centaur", "teacher", "wisdom", "prophecy", "medicine"],
      "quotes": [
        "But not all the Centaurs were like the rude guests of Pirithous. Chiron was instructed by Apollo and Diana, and was renowned for his skill in hunting, medicine, music, and the art of prophecy.",
        "The most distinguished heroes of Grecian story were his pupils.",
        "Among the rest the infant Aesculapius was intrusted to his charge by Apollo, his father.",
        "Aesculapius when grown up became a renowned physician, and even in one instance succeeded in restoring the dead to life.",
        "Chiron was the wisest and justest of all the Centaurs, and at his death Jupiter placed him among the stars as the constellation Sagittarius.",
        "The Centaur is the only one of the fancied monsters of antiquity to which any good traits are assigned."
      ],
      "sort_order": 18
    },
    {
      "type": "sign",
      "sign": "Capricorn",
      "story": "Pan, god of flocks and shepherds, transformed into a fish-goat to escape the monster Typhon. 'Pan was the god of flocks and shepherds. His favorite residence was in Arcadia.' When the gods fled Typhon, Pan leaped into the Nile—his upper body became a goat, his lower a fish. Jupiter commemorated this creative escape by placing the sea-goat among the stars.",
      "light": "Transformation under pressure, creative adaptation that ensures survival",
      "shadow": "The hybrid—neither fully one thing nor the other, caught between realms",
      "keywords": ["Pan", "goat", "fish", "Typhon", "Arcadia", "transformation"],
      "quotes": [
        "Pan was the god of flocks and shepherds. His favorite residence was in Arcadia.",
        "The Satyrs were deities of the woods and fields. They were conceived to be covered with bristly hair, their heads decorated with short, sprouting horns, and their feet like goats' feet.",
        "Faunus, the grandson of Saturn, was worshipped as the god of fields and shepherds, and also as a prophetic god.",
        "His name in the plural, Fauns, expressed a class of gamesome deities, like the Satyrs of the Greeks.",
        "Pales, the goddess presiding over cattle and pastures.",
        "Pomona presided over fruit trees."
      ],
      "sort_order": 19
    },
    {
      "type": "sign",
      "sign": "Aquarius",
      "story": "Ganymede was a Trojan prince so beautiful that 'Jupiter, in the disguise of an eagle, seized and carried off from the midst of his playfellows on Mount Ida, bore up to heaven, and installed' as cupbearer to the gods. He replaced Hebe, goddess of youth. The eagle (Aquila) and the water-bearer stand together in the sky as reminders of divine favor.",
      "light": "Beauty that catches divine attention, elevation to serve the gods",
      "shadow": "Abducted youth—the mortal seized for immortal purposes",
      "keywords": ["Ganymede", "cupbearer", "eagle", "Zeus", "Hebe", "Ida"],
      "quotes": [
        "Hebe, the daughter of Juno, and goddess of youth, was cup-bearer to the gods.",
        "Her successor was Ganymede, a Trojan boy, whom Jupiter, in the disguise of an eagle, seized and carried off from the midst of his playfellows on Mount Ida, bore up to heaven, and installed in the vacant place.",
        "There, too, flushed Ganymede, his rosy thigh half buried in the eagle's down, sole as a flying star shot through the sky above the pillared town.",
        "Pour forth heaven's wine, Idaean Ganymede, and let it fill the Daedal cups like fire.",
        "The usual story is that Hebe resigned her office on becoming the wife of Hercules.",
        "According to this, Hebe was dismissed from her office in consequence of a fall which she met with one day when in attendance on the gods."
      ],
      "sort_order": 20
    },
    {
      "type": "sign",
      "sign": "Pisces",
      "story": "When the monster Typhon attacked Olympus, Venus and her son Cupid fled and leaped into the Euphrates River. To escape, they transformed into fish. They tied themselves together with a cord so they would not be separated in the current. Jupiter commemorated their escape by placing two fish bound together among the stars.",
      "light": "Love's bond that holds even in transformation, connection that survives chaos",
      "shadow": "Flight and disguise—love forced to hide its true form",
      "keywords": ["Venus", "Cupid", "Aphrodite", "Eros", "fish", "Typhon"],
      "quotes": [
        "Cupid (Eros), the god of love, was the son of Venus. He was her constant companion; and, armed with bow and arrows, he shot the darts of desire into the bosoms of both gods and men.",
        "Venus (Aphrodite), the goddess of love and beauty, was the daughter of Jupiter and Dione.",
        "Others say that Venus sprang from the foam of the sea. The zephyr wafted her along the waves to the Isle of Cyprus.",
        "Venus possessed an embroidered girdle called Cestus, which had the power of inspiring love.",
        "Her favorite birds were swans and doves, and the plants sacred to her were the rose and the myrtle.",
        "Venus, complaining to Themis that her son Eros continued always a child, was told by her that it was because he was solitary, and that if he had a brother he would grow apace."
      ],
      "sort_order": 21
    }
  ]
}
