{
  "name": "PlayfulProcess",
  "description": "",
  "cover_image_url": "",
  "tags": [],
  "grammar_type": "custom",
  "items": [
    {
      "id": "yt-jPNT8C3A-wU",
      "name": "What is Strategic Family Therapy? | MFT Model Reviews",
      "sort_order": 1,
      "image_url": "https://i.ytimg.com/vi/jPNT8C3A-wU/maxresdefault.jpg",
      "keywords": [
        "Steph Anya, LMFT"
      ],
      "sections": {
        "Creator's Notes": "What's Anya Mind?\nToday, we're diving into one of the most significant Marriage and Family Therapy models-- Strategic Family Therapy which was pioneered by Jay Haley. We'll be covering main concepts such as second order change, view of the problem, and main techniques such as directives and paradoxical interventions. Everything that you want to know should be in this video, and if you have other questions feel free to write them in the comments below! \n\nI have to credit AATBS for providing the anchor for these videos, I have a link to their study materials below. They helped me pass the national exam!\n\nSIMILAR VIDEOS//\nStructural Family Therapy Video: https://youtu.be/HBAOOyqhxn4\nBowen Family Therapy: https://youtu.be/nFS5f0_NJPo\n\nCOAMFTE-ACCREDITED PROGRAMS//\nhttps://coamfte.org/COAMFTE/Directory_of_Accredited_Programs/MFT_Training_Programs.aspx\n\nFIND A THERAPIST//\nhttps://growtherapy.co/stephanya\nSOCIAL MEDIA//\nInstagram: @ _steph.anya\nFacebook: /steph.anya.fb\n\nEXAM STUDY PREP (that I use)//\nAmerican Association for The Behavioral Sciences Study (AATBS) Volume I & II (15% Discount): https://www.talkable.com/x/0pWfTO\n\nFOR MEDIA & SPONSORSHIP INQUIRIES//\nPlease email: stephanya@harpers.us\n\nGEAR//\nCamera: https://amzn.to/2xJoybv\nMic: https://amzn.to/2XPZjin\nFlash: https://amzn.to/3czlgGI\nMic: https://amzn.to/2ZxBDA4\nAudio Recorder: https://amzn.to/3bUKG0J\nFlash: https://amzn.to/3czlgGI\nLighting: https://amzn.to/2XnyQaa\n\nTheme Song:\nProd. NDO: https://www.youtube.com/NDObeats\nProd. Mari Beats: https://www.youtube.com/channel/UC0JqfYoOQDBGAT1_3r43z9Q"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=jPNT8C3A-wU",
        "youtube_video_id": "jPNT8C3A-wU",
        "channel": "Steph Anya, LMFT",
        "duration_seconds": 1452
      },
      "level": 1
    },
    {
      "id": "yt-HBAOOyqhxn4",
      "name": "What is Structural Family Therapy? | MFT Models",
      "sort_order": 2,
      "image_url": "https://i.ytimg.com/vi/HBAOOyqhxn4/maxresdefault.jpg",
      "keywords": [
        "Steph Anya, LMFT"
      ],
      "sections": {
        "Creator's Notes": "What's Anya Mind?\nFor many of my subscribers, it's the woes of understanding systemic therapy and its many models. For my first model review, we'll be discussing Minuchin's Structural Family Therapy Model! Did you find this video helpful? Which model should I do next?\n\nAATBS STUDY MATERIALS//\nAmerican Association for The Behavioral Sciences Study (AATBS) Volume I & II (15% Discount):\nhttps://www.talkable.com/x/0pWfTO\n\nFIND A THERAPIST//\nhttps://growtherapy.co/stephanya\nSOCIAL MEDIA//\nInstagram: https://www.instagram.com/_steph.anya\nFacebook: https://www.facebook.com/steph.anya.fb\n\nFOR MEDIA & SPONSORSHIP INQUIRIES//\nPlease email: stephanya@harpers.us\n\nGEAR//\nCamera: https://amzn.to/2xJoybv\nMic: https://amzn.to/2XPZjin\nFlash: https://amzn.to/3czlgGI\nMic: https://amzn.to/2ZxBDA4\nAudio Recorder: https://amzn.to/3bUKG0J\nFlash: https://amzn.to/3czlgGI\nLighting: https://amzn.to/2XnyQaa\n\nTheme Song:\nProd. NDO: https://www.youtube.com/NDObeats\nProd. Mari Beats: https://www.youtube.com/channel/UC0JqfYoOQDBGAT1_3r43z9Q\n\nIn-Video Music:\nProd. Mari Beats"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=HBAOOyqhxn4",
        "youtube_video_id": "HBAOOyqhxn4",
        "channel": "Steph Anya, LMFT",
        "duration_seconds": 967
      },
      "level": 1
    },
    {
      "id": "yt-ikKnZoKu3eE",
      "name": "What is Narrative Family Therapy? | MFT Models",
      "sort_order": 3,
      "image_url": "https://i.ytimg.com/vi/ikKnZoKu3eE/maxresdefault.jpg",
      "keywords": [
        "Steph Anya, LMFT"
      ],
      "sections": {
        "Creator's Notes": "AATBS STUDY MATERIALS//\nAmerican Association for The Behavioral Sciences Study (AATBS) Volume I & II (15% Discount):\nhttps://www.talkable.com/x/0pWfTO\n\nFIND A THERAPIST//\nhttps://growtherapy.co/stephanya\nSOCIAL MEDIA//\nInstagram: @ _steph.anya\nFacebook: /steph.anya.fb\n\nGEAR//\nCamera: https://amzn.to/2xJoybv\nMic: https://amzn.to/2XPZjin\nFlash: https://amzn.to/3czlgGI\nMic: https://amzn.to/2ZxBDA4\nAudio Recorder: https://amzn.to/3bUKG0J\nFlash: https://amzn.to/3czlgGI\nLighting: https://amzn.to/2XnyQaa\n\nTheme Song:\nProd. NDO: https://www.youtube.com/NDObeats\nProd. Mari Beats: https://www.youtube.com/channel/UC0JqfYoOQDBGAT1_3r43z9Q\n\nIn-Video Music:\nProd. Mari Beats"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=ikKnZoKu3eE",
        "youtube_video_id": "ikKnZoKu3eE",
        "channel": "Steph Anya, LMFT",
        "duration_seconds": 1097
      },
      "level": 1
    },
    {
      "id": "yt-aD8-gjpZhYE",
      "name": "Solution-Focused Therapy with Insoo Kim Berg",
      "sort_order": 4,
      "image_url": "https://i.ytimg.com/vi/aD8-gjpZhYE/hqdefault.jpg",
      "keywords": [
        "PsychotherapyNet"
      ],
      "sections": {
        "Creator's Notes": "For the full video go to: http://www.psychotherapy.net/video/insoo-kim-berg-solution-focused-therapy\n\nIn this video Insoo Kim Berg masterfully demonstrates Solution-Focused Therapy in an actual therapy session. What a treat to see this legendary therapist in action!\n\nIf you've heard of Solution Focused Therapy, or even read some of Insoo's books, but never had a chance to see her in action, now is your chance. Her style is unique, but her optimism is almost contagious. Even if her approach is quite different from how you typically work, you will surely find something from watching her that you can use or be inspired by."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=aD8-gjpZhYE",
        "youtube_video_id": "aD8-gjpZhYE",
        "channel": "PsychotherapyNet",
        "duration_seconds": 84
      },
      "level": 1
    },
    {
      "id": "yt-aCEnIiULIho",
      "name": "Erikson's Stages of Psychosocial Development - Simplest Explanation Ever",
      "sort_order": 5,
      "image_url": "https://i.ytimg.com/vi/aCEnIiULIho/maxresdefault.jpg",
      "keywords": [
        "Mister Simplify"
      ],
      "sections": {
        "Creator's Notes": "Erikson’s Stages of Psychosocial Development - Simplest explanation ever\n\nErikson's Stages of Psychosocial Development is a useful tool in analysing human psychology. It is split into 8 stages and the development of ego or personality is dependent on the successful completion of each stage. This video covers the important aspects of the theory and attempts to simplify it.\n\nIf you love the content here or found this video useful, useful, feel free to buy me a coffee! Your support will be highly appreciated! :)\nhttps://www.buymeacoffee.com/mistersimplify\n\nThis simple video is derived from expert input and the presentation style is deliberately kept simple and concise as always. \nPlease like & share the video and subscribe to this channel to express support. I intend to dedicate time and resources to improve the quality & presentation of future content.\n\nMusic: www.bensound.com"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=aCEnIiULIho",
        "youtube_video_id": "aCEnIiULIho",
        "channel": "Mister Simplify",
        "duration_seconds": 774
      },
      "level": 1
    },
    {
      "id": "yt--MAMialrZqU",
      "name": "Play Scaling: Solution-Focused Play Therapy",
      "sort_order": 6,
      "image_url": "https://i.ytimg.com/vi/-MAMialrZqU/hqdefault.jpg",
      "keywords": [
        "Pamela K. King"
      ],
      "sections": {
        "Creator's Notes": "Play Scaling turns conversations toward the future in words and concrete actions. This innovative play therapy technique is effective, brief, and future-focused. \nSolution-Focused Play Therapy with Pamela King"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=-MAMialrZqU",
        "youtube_video_id": "-MAMialrZqU",
        "channel": "Pamela K. King",
        "duration_seconds": 165
      },
      "level": 1
    },
    {
      "id": "yt-Nkjq8UqPmm4",
      "name": "SFBT Moments Volume 159: SFBT When The Parents Want the Child to Change",
      "sort_order": 7,
      "image_url": "https://i.ytimg.com/vi/Nkjq8UqPmm4/hqdefault.jpg",
      "keywords": [
        "The Solution Focused Universe"
      ],
      "sections": {
        "Creator's Notes": "One the trickiest situations professionals experience using the Solution Focused Approach is when parents ask us to “fix” their child but they themselves are playing a big role in the problem. In this video I share how SFBT can be used in these types of scenarios."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=Nkjq8UqPmm4",
        "youtube_video_id": "Nkjq8UqPmm4",
        "channel": "The Solution Focused Universe",
        "duration_seconds": 400
      },
      "level": 1
    },
    {
      "id": "yt-SbeS5iezIDA",
      "name": "Trauma & Play Therapy: Holding Hard Stories | Paris Goodyear-Brown, MSSW, LCSW, RPTS | TEDxNashville",
      "sort_order": 8,
      "image_url": "https://i.ytimg.com/vi/SbeS5iezIDA/maxresdefault.jpg",
      "keywords": [
        "TEDx Talks"
      ],
      "sections": {
        "Creator's Notes": "How do children heal from trauma? Play therapy and trauma expert, Paris Goodyear-Brown, takes us on a journey through the stories of children from hard places, the neuroscience of play, and the importance of each of us in bearing witness to the hurt. Graphic images may evoke strong emotions but will reveal the amazing ability of children to tell us what happened and play their way to healing.  Paris Goodyear-Brown, LCSW, RPT-S, is a child trauma expert and a professional player with 23 years of experience in helping traumatized children and their families heal. She is the founder and Clinical Director of Nurture House, serves the Association for Play Therapy in several roles, is a sought-after international speaker and a prolific author. With specialties areas in sexual abuse, maltreatment, and attachment repair, her trauma model is best explained in her books \"Play Therapy with Traumatized Children: A Prescriptive Approach,\" \"Tackling Touchy Subjects,\" and her newest book \"Taming the Trauma with Children and Families\" (in press). Her hope for hurt children is best communicated in her children’s book A Safe Circle for Little U.  Paris lives in Franklin, Tennessee with her husband and three children, and to balance the weight of holding the hard stories of those in her care she likes to drive her yellow jeep with the doors off whenever the weather allows. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=SbeS5iezIDA",
        "youtube_video_id": "SbeS5iezIDA",
        "channel": "TEDx Talks",
        "duration_seconds": 1087
      },
      "level": 1
    },
    {
      "id": "yt-arfeBvwpavc",
      "name": "The Healing Power of Art | Tara Bane | TEDxMorrisville",
      "sort_order": 9,
      "image_url": "https://i.ytimg.com/vi/arfeBvwpavc/maxresdefault.jpg",
      "keywords": [
        "TEDx Talks"
      ],
      "sections": {
        "Creator's Notes": "Tara Bane, a mental health practicioner for over 20 years, and who has a Masters Degree in Creative Art Therapy, discusses the healing power of art therapy to help those healing from challenging experiences.  Tara Bane has a masters degree in Creative Art Therapy and is a\nregistered Art Therapist through the American Art Therapy Association. She has been a mental health practitioner for over 20 years and has provided her services in a variety of settings including a crime victims center, a domestic violence center, and a residential treatment facility for boys. Through her position at Family Service Association of Bucks County, she provided clinician art therapy services to lower bucks schools (including Morrisville Schools) for those children in need who have limited ability to get to the agency for services. Tara has a long history of supporting those suffering from various forms of abuse, traumatic experiences, and grief due to loss.  She has counseled countless clients with peer relationships issues, socialization struggles, behavioral issues, childhood anxieties and depressive symptoms.  It is with this knowledge and experience that inspired her to create Blue Sky Therapy Center. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=arfeBvwpavc",
        "youtube_video_id": "arfeBvwpavc",
        "channel": "TEDx Talks",
        "duration_seconds": 1071
      },
      "level": 1
    },
    {
      "id": "yt-pcMFk2goOwc",
      "name": "What to Expect in Art Therapy",
      "sort_order": 10,
      "image_url": "https://i.ytimg.com/vi/pcMFk2goOwc/maxresdefault.jpg",
      "keywords": [
        "Providence Swedish"
      ],
      "sections": {
        "Creator's Notes": "Art Therapy is a supportive and beneficial therapy that can help people process their thoughts and emotions around their cancer experience. Research shows that Art Therapy can help reduce symptoms related to pain and anxiety in patients with cancer. Please watch this video to learn more about the benefits of Art Therapy.  To learn more visit https://www.swedish.org/services/cancer-institute/our-services/complementary-therapies/art-therapy"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=pcMFk2goOwc",
        "youtube_video_id": "pcMFk2goOwc",
        "channel": "Providence Swedish",
        "duration_seconds": 524
      },
      "level": 1
    },
    {
      "id": "yt-XvjaIrYlkIg",
      "name": "How cross-cultural understanding can help us to see each other | Simone Buijzen | TEDxSittardGeleen",
      "sort_order": 11,
      "image_url": "https://i.ytimg.com/vi/XvjaIrYlkIg/maxresdefault.jpg",
      "keywords": [
        "TEDx Talks"
      ],
      "sections": {
        "Creator's Notes": "Originally from Sittard and fascinated by the psychology of people and their different backgrounds, Simone has travelled the globe for over 25 years. Starting out as a marketer for multi-national companies she has witnessed a lot of cross-cultural misunderstandings that though hilarious were often time and money consuming. Her love of people and her extensive international business experience inspired her to study cross-cultural communication and start building bridges between different cultures.\n\nIn her role as cross-cultural trainer and executive coach for over 12 years Simone has worked with leaders and their teams at multinationals and NGO’s all over the globe. She has also taken on the role of Advisor to the My Shining Star Foundation in Malaysia and has since made the Eastern Hemisphere her second home.\n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at http://ted.com/tedx"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=XvjaIrYlkIg",
        "youtube_video_id": "XvjaIrYlkIg",
        "channel": "TEDx Talks",
        "duration_seconds": 869
      },
      "level": 1
    },
    {
      "id": "yt-uzhmBDrB8E4",
      "name": "Be a better parent by partnering with your teen | David Kozlowski | TEDxSaltLakeCity",
      "sort_order": 12,
      "image_url": "https://i.ytimg.com/vi/uzhmBDrB8E4/maxresdefault.jpg",
      "keywords": [
        "TEDx Talks"
      ],
      "sections": {
        "Creator's Notes": "After 20 years of working with parents and teens struggling to relate to each other, David Kozlowski realized that a partnership is the most effective way for parents to successfully support their teens. In this informative talk, David explains how seeing your teen as a partner, who will one day be your equal, and someday become your successor, is just good family business. Find out more at http://ptpartnership.com/ David Kozlowski obtained a Masters degree in Counseling Psychology from National University in San Diego. Since 1999, David has worked as a counselor, behavioral specialist, mental health worker, and therapist in group homes, crisis treatment centers, psychiatric hospitals, drug addiction facilities, and schools for severely emotionally disturbed kids and teens. David has his own private practice, is the Host of the Light The Fight podcast, and is the Executive Director of the Non Profit Quit Trip’n.\n\nDavid Kozlowski obtained a Masters degree in Counseling Psychology from National University in San Diego. Since 1999, David has worked as a counselor, behavioral specialist, mental health worker, and therapist in group homes, crisis treatment centers, psychiatric hospitals, drug addiction facilities, and schools for severely emotionally disturbed kids and teens. David has his own private practice, is the Host of the Light The Fight podcast, and is the Executive Director of the Non Profit Quit Trip’n. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=uzhmBDrB8E4",
        "youtube_video_id": "uzhmBDrB8E4",
        "channel": "TEDx Talks",
        "duration_seconds": 539
      },
      "level": 1
    },
    {
      "id": "yt-rlaSlLN6Jto",
      "name": "The Troubled Teenager | Dr. Anjali Chhabria | TEDxYouth@SISmumbai",
      "sort_order": 13,
      "image_url": "https://i.ytimg.com/vi/rlaSlLN6Jto/maxresdefault.jpg",
      "keywords": [
        "TEDx Talks"
      ],
      "sections": {
        "Creator's Notes": "Today, mental health problems are rife in the context of teenagers. Dr. Anjali explores how these problems can be tackled at an early age through a multidimensional approach. Awareness should also be raised to ensure that the problems with these teenagers are tackled effectively.  Dr. Anjali Chhabria, a leading psychiatrist, psychotherapist and now an author of Death is Not The Answer: Understanding Suicide and ways to prevent it, has been contributing to the field of mental health since 25 years. She runs Mindtemple (Mumbai), a mental health centre which supports the psychiatric, emotional and behavioral needs of individuals. She has been the youngest president of the Bombay Psychiatric Society in 2001, served on the board of the Children’s Film Society, is currently a director on the Salaam Bombay Foundation. Alongside being a regular columnist, she has also graced the panels on various television shows like Satyamev Jayate. She is a trained past-life regression therapist, hypnotist and introduced innovative treatment modalities with aim of constantly improving patient care. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=rlaSlLN6Jto",
        "youtube_video_id": "rlaSlLN6Jto",
        "channel": "TEDx Talks",
        "duration_seconds": 1059
      },
      "level": 1
    },
    {
      "id": "yt-kWC2JKYjMOk",
      "name": "Depression in Children",
      "sort_order": 14,
      "image_url": "https://i.ytimg.com/vi/kWC2JKYjMOk/maxresdefault.jpg",
      "keywords": [
        "Nip in the Bud"
      ],
      "sections": {
        "Creator's Notes": "Watch time 06:47 minutes | CW// Depression. This film contains sensitive material about Depression and is not suitable for children under 16. Our films all discuss children's mental health which is a sensitive subject for some. If you need to take a break and come back later to watch with a friend please do.With all our films we provide support links on our ‘Where to go for help page’: https://nipinthebud.org/where-to-go-for-help/\n\nChapters:\n00:00 What people used to think about depression\n00:38 Sadness versus depression\n00:59 How depression can impact children\n01:19 The main symptoms of depression\n02:06 Other symptoms of child depression\n03:07 Depressive symptoms that clinicians look for in a diagnosis\n03:35 Factors at school that put children at risk of depression\n03:48 Factors at home that put children at risk of depression\n04:23 What is dysthymia?\n04:51 How to support a child with depressive symptoms\n\nA child with depression can experience problems not just with how they feel, but also how they behave. Depression in children is treatable, but often young people are not recognised as being depressed so they don’t get the right help.\n\nThis film explains how to identify and help a child showing the symptoms of depression.\n\nNip in the Bud® was set up to encourage awareness about mental health disorders in young children. Nip in the Bud strongly believes that early intervention and support for children ensures far better outcomes. For more information, the accompanying comprehensive Fact Sheets and additional resources visit us at https://nipinthebud.org/\nPlease Like this film, subscribe and follow us if you would like to see more of our films on children's mental health and well-being - we'd really appreciate it and we think you will too.\n\nTo watch more of our films either head to our site or find more here:\nDepression in young children playlist: https://www.youtube.com/playlist?list=PLS65xMu-topWQEuDSADJIJMpbdVTh70pp\nThese films range from how teachers and carers can help support children who may be experiencing Depression, to hearing from families' first-hand experiences.\n\nPlease  Like this film and subscribe if you would like to see more of our films on children's mental health and wellbeing - we'd really appreciate it and we think you will too.\n\nLearn more about Children's Mental Health on our website: \n\nChildren's Mental Health https://nipinthebud.org/\nADHD https://nipinthebud.org/adhd-in-children/\nAnxiety https://nipinthebud.org/anxiety-in-children/\nAutism Spectrum Condition https://nipinthebud.org/autism-in-children/\nConduct Disorder/ODD https://nipinthebud.org/conduct-disorders-in-children/\nDepression https://nipinthebud.org/depression-in-children/\nOCD https://nipinthebud.org/ocd-in-children/\nPTSD https://nipinthebud.org/ptsd-in-children/\n\nFind us on social media: \nFacebook https://www.facebook.com/NipintheBudFilm/\nInstagram https://www.instagram.com/nipinthebudfilm/\nTwitter https://twitter.com/nipinthebudfilm\nLinkedIn https://www.linkedin.com/company/nip-in-the-bud/"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=kWC2JKYjMOk",
        "youtube_video_id": "kWC2JKYjMOk",
        "channel": "Nip in the Bud",
        "duration_seconds": 407
      },
      "level": 1
    },
    {
      "id": "yt-fYLwe7tKFHM",
      "name": "Why we need to embrace the awkward and talk about suicide | Pooky Knightsmith | TEDxNorwichED",
      "sort_order": 15,
      "image_url": "https://i.ytimg.com/vi/fYLwe7tKFHM/maxresdefault.jpg",
      "keywords": [
        "TEDx Talks"
      ],
      "sections": {
        "Creator's Notes": "Every minute, somebody somewhere in the world dies by suicide - but until the moment of death, there is hope.  In her talk, Pooky explains how each and every one of us can help to prevent deaths by suicide by being prepared to have an awkward conversation about suicide.  \n\nPooky has struggled with thoughts of suicide since she was a young child - she draws on this experience and explains how hard it can feel to face a lifetime of emotional pain but that with the support of someone who cares, it can be possible to continue one minute at a time.\n\nWatching this talk might help you to save a life someday… surely that's worth a few minutes of your time?\n Pooky is a well-respected face of child and adolescent mental health.  She has worked with a wide range of schools, charities, businesses and policy makers.  She leads by example and is well-networked, widely published and has a reputation for fostering collaboration and change, especially in her role as vice chair of the Children and Young People’s Mental Health Coalition.  \nPooky is proud of many things – her daughters, her PhD, her track record of delivering mental health projects that really make a difference… But more than any of that, she is proud that each minute she has fought to live the next; even when PTSD made suicide feel like the only answer. \n\" This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=fYLwe7tKFHM",
        "youtube_video_id": "fYLwe7tKFHM",
        "channel": "TEDx Talks",
        "duration_seconds": 458
      },
      "level": 1
    },
    {
      "id": "yt-C5pDOJkFcQA",
      "name": "Teen Depression & Suicide: Facebook Live Web Chat",
      "sort_order": 16,
      "image_url": "https://i.ytimg.com/vi/C5pDOJkFcQA/hqdefault.jpg",
      "keywords": [
        "Michigan Medicine"
      ],
      "sections": {
        "Creator's Notes": "Child and adolescent psychologists Dr. Polly Gipson and Dr. Cynthia Ewell Foster talk about how to support your teen, signs of depression to watch for that could indicate your child may need help, and how to have important conversations with them about their own feelings, as well how to support friends and peers. The chat includes a live Q&A segment.  Originally broadcast on February 7, 2018.\n\nLearn more about C.S. Mott Children's Hospital at http://www.mottchildren.org.\n\nLearn more about U-M's Depression Center at http://DepressionCenter.org"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=C5pDOJkFcQA",
        "youtube_video_id": "C5pDOJkFcQA",
        "channel": "Michigan Medicine",
        "duration_seconds": 3603
      },
      "level": 1
    },
    {
      "id": "yt-3SJ5GzCDPr0",
      "name": "DSM 5 TR Update for Mental Health Professionals (Abridged Version)",
      "sort_order": 17,
      "image_url": "https://i.ytimg.com/vi/3SJ5GzCDPr0/maxresdefault.jpg",
      "keywords": [
        "Dr. Aaron Norton"
      ],
      "sections": {
        "Creator's Notes": "The DSM-5-TR was released in March 2022, nine years after the release of DSM-5.  Although the medical model is not the only model that mental health professionals work with, it is an important one.  Standards within the mental health professions  (e.g., graduate program accreditation standards, best practice guidelines, codes of ethics) and from outside of the professions (e.g., licensure boards, third party payers) encourage or require mental health professionals to have an updated understanding of the DSM.  Clinicians and forensic evaluators are busy professionals.  With a myriad of competing responsibilities, it’s understandably challenging to put aside a little time to learn about changes in the DSM diagnostic system.  This succinct, two-hour on-demand webinar was designed as a tool mental health professionals can use to get updated on important changes in the new edition.\n\nDISCLAIMER: This webinar recording has been posted for educational purposes only and was designed for viewing by students, educators, and clinicians in the mental health professions.  Licensed professionals who want continuing education (CE) credit for viewing this video can register for unabridged version of the training at https://www.nbfe.net/event-4822951.\n\nTO ACCESS HANDOUTS: Visit https://nortonconsulting.box.com/v/DSM-5-TR-Handouts\n\nLearning Objectives:\n\n1. Identify symptoms of Prolonged Grief Disorder, a new condition in DSM-5-TR.\n2. Describe the APA’s efforts to increase attention to culture, racism, discrimination, gender identity, and childhood symptoms in DSM-5-TR.\n3. Describe changes to Section III of DSM-5-TR (i.e., conditions for further study and assessment tools)."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=3SJ5GzCDPr0",
        "youtube_video_id": "3SJ5GzCDPr0",
        "channel": "Dr. Aaron Norton",
        "duration_seconds": 4951
      },
      "level": 1
    },
    {
      "id": "yt-GyauFdemoEc",
      "name": "Neurodevelopmental Disorders MTR Petrishen for MS 2022",
      "sort_order": 18,
      "image_url": "https://i.ytimg.com/vi/GyauFdemoEc/hqdefault.jpg",
      "keywords": [
        "David Petrishen"
      ],
      "sections": {
        "Creator's Notes": "Medical students will find the sections on ADHD, Tics, and Autism Spectrum Disorder more useful. The cases are presented in the same order as on your worksheet. \n\nResidents, there is more information on the uploaded powerpoint on SharePoint pertaining to management and DSM-5-TR criteria."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=GyauFdemoEc",
        "youtube_video_id": "GyauFdemoEc",
        "channel": "David Petrishen",
        "duration_seconds": 3378
      },
      "level": 1
    },
    {
      "id": "yt-oJ1tV1QrG4g",
      "name": "Assessment of ADHD in Children and Teens",
      "sort_order": 19,
      "image_url": "https://i.ytimg.com/vi/oJ1tV1QrG4g/maxresdefault.jpg",
      "keywords": [
        "Russell Barkley, PhD - Dedicated to ADHD Science+"
      ],
      "sections": {
        "Creator's Notes": "This presentation provides a detail discussion of the components in and issues involved in the evaluation of children and teens with ADHD.  It is based on Dr. Barkley's latest book, Treating ADHD in Children and Adolescents: What Every Clinician Needs to Know.  It discusses the purposes of the evaluation, information to be collected before and during the evaluation, issues that may arise in the evaluation, methods to be used in conducting the evaluation and addressing these issues, as well as the major topics that should be addressed in the feedback conference with parents.\nThis presentation is 1.4 hours in length.\n\nSubscribe Now"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=oJ1tV1QrG4g",
        "youtube_video_id": "oJ1tV1QrG4g",
        "channel": "Russell Barkley, PhD - Dedicated to ADHD Science+",
        "duration_seconds": 4803
      },
      "level": 1
    },
    {
      "id": "yt-F1WqpeRSY-E",
      "name": "Sam and Mom—\"Evaluation of the Child with ADHD\"",
      "sort_order": 20,
      "image_url": "https://i.ytimg.com/vi/F1WqpeRSY-E/hqdefault.jpg",
      "keywords": [
        "UT Health San Antonio – Video Production"
      ],
      "sections": {},
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=F1WqpeRSY-E",
        "youtube_video_id": "F1WqpeRSY-E",
        "channel": "UT Health San Antonio – Video Production",
        "duration_seconds": 1668
      },
      "level": 1
    },
    {
      "id": "yt-s07HxmMwrBE",
      "name": "Oppositional Defiant, Conduct and Intermittent Explosive Disorder |a Trauma Informed Perspective",
      "sort_order": 21,
      "image_url": "https://i.ytimg.com/vi/s07HxmMwrBE/maxresdefault.jpg",
      "keywords": [
        "Doc Snipes"
      ],
      "sections": {
        "Creator's Notes": "Continuing Education for LMFT, LCSW, LPC, LMFT.  NAADAC and State Accredited Education Provider Dawn-Elise Snipes, PhD, LPC NPI: 1699003533  Dr. Dawn-Elise Snipes is a Licensed Professional Counselor and Qualified Clinical Supervisor.  She received her PhD in Mental Health Counseling from the University of Florida in 2002.  In addition to being a practicing clinician, she has provided training to counselors, social workers, nurses and case managers internationally since 2006 through AllCEUs.com #oppositionaldefiantdisorder, #conductdisorder and #intermittentexplosivedisorder |a #TraumaInformed Perspective in the #dsm5tr for #NCE #exampreparation \n📢SUBSCRIBE and click the BELL to get notified when new videos are uploaded. \n💲 AllCEUs.com Unlimited continuing education CEUs $59 \n💻 Online course based on this video can be found at \n⭐ Specialty Certificate Programs for Case Management and Counselor Certification beginning at $89 https://AllCEUs.com/certificate-tracks\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCAE3JJi8tX7gfhZEXCUGd_A/join\n\nNOTE:  ALL VIDEOS are for educational purposes only and are NOT a replacement for medical advice or counseling from a licensed professional.\n\nVideo by Dr. Dawn Elise Snipes on integrative behavioral health approaches  including counseling techniques and skills for improving mental health and reducing mental illness.\n\n “The Effectiveness and Cost-Effectiveness of Parent Training/Education Programmes for the Treatment of Conduct Disorder, Including Oppositional Defiant Disorder, in Children.” Health Technology Assessment (Winchester, England) 9, no. 50 (December 2005): iii, ix–x, 1–233. https://doi.org/10.3310/hta9500.\n “A Systematic Review and Meta-Analysis of Neuroimaging in Oppositional Defiant Disorder (ODD) and Conduct Disorder (CD) Taking Attention-Deficit Hyperactivity Disorder (ADHD) Into Account.” Neuropsychology Review 26 (2016): 44–72. https://doi.org/10.1007/s11065-015-9315-8.\nCleveland Clinic. “Oppositional Defiant Disorder (ODD): Symptoms & Treatment.” Accessed June 21, 2022. https://my.clevelandclinic.org/health/diseases/9905-oppositional-defiant-disorder.\n “The Pharmacological Management of Oppositional Behaviour, Conduct Problems, and Aggression in Children and Adolescents With Attention-Deficit Hyperactivity Disorder, Oppositional Defiant Disorder, and Conduct Disorder: A Systematic Review and Meta-Analysis. Part 1: Psychostimulants, Alpha-2 Agonists, and Atomoxetine.” Canadian Journal of Psychiatry. Revue Canadienne de Psychiatrie 60, no. 2 (February 2015): 42–51.\n“Common Questions About Oppositional Defiant Disorder.” American Family Physician 93, no. 7 (April 1, 2016): 586–91.\n“Coercive Family Process and Early-Onset Conduct Problems from Age 2 to School Entry.” Development and Psychopathology 26, no. 4 Pt 1 (November 2014): 917–32. https://doi.org/10.1017/S0954579414000169.\n———. “Coercive Family Process and Early-Onset Conduct Problems From Age 2 to School Entry.” Development and Psychopathology 26, no. 4 0 1 (November 2014): 917–32. https://doi.org/10.1017/S0954579414000169.\n“The Pharmacological Management of Oppositional Behaviour, Conduct Problems, and Aggression in Children and Adolescents With Attention-Deficit Hyperactivity Disorder, Oppositional Defiant Disorder, and Conduct Disorder: A Systematic Review and Meta-Analysis. Part 1: Psychostimulants, Alpha-2 Agonists, and Atomoxetine - PMC.” Accessed June 21, 2022. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4344946/.\n\n\nAllCEUs.com provides multimedia counselor education and CEUs for LPCs, LMHCs, LMFTs and LCSWs as well as addiction counselor precertification training and continuing education on many of the videos on this channel.  Unlike other providers like CE4Less, AllCEUs includes a weekly LIVE Stream Webinar with your unlimited continuing education and professional development membership.\n\nTIMESTAMPS\n00:00 Introduction to Disruptive Impulse control and Conduct Disorders in the DSM 5 TR\n01:35 Oppositional Defiant Disorder\n29:00 Disruptive Mood Dysregulation Disorder\n29:55 Conduct Disorder\n40:50 Intermittent Explosive Disorder DSM5TR\n43:37 Pyromania and Kleptomania DSM5TR\n47:50 Risk factors for conduct and impulse control disorders\n49:37 Differential Diagnosis of conduct and impulse control disorders\n54:25 Suicidality in conduct and impulse control disorders\n55:40 Treatment Strategies to address conduct and impulse control disorders"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=s07HxmMwrBE",
        "youtube_video_id": "s07HxmMwrBE",
        "channel": "Doc Snipes",
        "duration_seconds": 3647
      },
      "level": 1
    },
    {
      "id": "yt-qXP8e-9tgkA",
      "name": "Schizophrenia Spectrum Disorder Diagnosis with DSM5-TR Changes",
      "sort_order": 22,
      "image_url": "https://i.ytimg.com/vi/qXP8e-9tgkA/maxresdefault.jpg",
      "keywords": [
        "Doc Snipes"
      ],
      "sections": {
        "Creator's Notes": "Continuing Education for LMFT, LCSW, LPC, LMFT.  NAADAC and State Accredited Education Provider Dawn-Elise Snipes, PhD, LPC NPI: 1699003533  Dr. Dawn-Elise Snipes is a Licensed Professional Counselor and Qualified Clinical Supervisor.  She received her PhD in Mental Health Counseling from the University of Florida in 2002.  In addition to being a practicing clinician, she has provided training to counselors, social workers, nurses and case managers internationally since 2006 through AllCEUs.com #Schizophrenia Spectrum Disorder Diagnosis with #DSM5TR Changes #NCE\n📢SUBSCRIBE and click the BELL to get notified when new videos are uploaded. \n💲 AllCEUs.com Unlimited continuing education CEUs $59 \n💻 Online course based on this video can be found at https://allceus.com/member/cart/index/product/id/1484/c/\n⭐ Specialty Certificate Programs for Case Management and Counselor Certification beginning at $89 https://AllCEUs.com/certificate-tracks\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCAE3JJi8tX7gfhZEXCUGd_A/join\n\nNOTE:  ALL VIDEOS are for educational purposes only and are NOT a replacement for medical advice or counseling from a licensed professional.\n\nVideo by Dr. Dawn Elise Snipes on integrative behavioral health approaches  including counseling techniques and skills for improving mental health and reducing mental illness.\n\nAllCEUs.com provides multimedia counselor education and CEUs for LPCs, LMHCs, LMFTs and LCSWs as well as addiction counselor precertification training and continuing education on many of the videos on this channel.\n\nTIMESTAMPS\n00:00 Introduction to schizophrenia spectrum disorders\n04:00 Types of delusions\n08:50 Hallucinations\n10:30 Disorganized thinking\n12:45 Abnormal motor behavior\n15:10 Negative symptoms in schizophrenia\n17:30 Schizophrenia, brief psychotic disorder schizophreniform\n21:55 Delusional Disorder\n22:40 Differential diagnosis\n31:05 Associated features | treatment targets\n39:45 Functional impairment | Treatment targets"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=qXP8e-9tgkA",
        "youtube_video_id": "qXP8e-9tgkA",
        "channel": "Doc Snipes",
        "duration_seconds": 3208
      },
      "level": 1
    },
    {
      "id": "yt-q5Npw03I0t8",
      "name": "Depression Disorders in the DSM 5 TR  | Symptoms and Diagnosis",
      "sort_order": 23,
      "image_url": "https://i.ytimg.com/vi/q5Npw03I0t8/maxresdefault.jpg",
      "keywords": [
        "Doc Snipes"
      ],
      "sections": {
        "Creator's Notes": "Continuing Education for LMFT, LCSW, LPC, LMFT.  NAADAC and State Accredited Education Provider Dawn-Elise Snipes, PhD, LPC NPI: 1699003533  Dr. Dawn-Elise Snipes is a Licensed Professional Counselor and Qualified Clinical Supervisor.  She received her PhD in Mental Health Counseling from the University of Florida in 2002.  In addition to being a practicing clinician, she has provided training to counselors, social workers, nurses and case managers internationally since 2006 through AllCEUs.com Major Depressive Disorders in the DSM 5 TR explore changes to diagnosing depression as well as associated features and diagnoses\n#Depression #NCE #DSM #diagnosis\n📢SUBSCRIBE and click the BELL to get notified when new videos are uploaded. \n💲 AllCEUs.com Unlimited continuing education CEUs $59 \n💻 Online course ( #masterclass) based on this video can be found at https://allceus.com/member/cart/index/product/id/1484/c/\n⭐ Specialty Certificate Programs for Case Management and Counselor Certification beginning at $89 https://AllCEUs.com/certificate-tracks\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCAE3JJi8tX7gfhZEXCUGd_A/join\n\nNOTE:  ALL VIDEOS are for educational purposes only and are NOT a replacement for medical advice or counseling from a licensed professional.\n\nVideo by Dr. Dawn Elise Snipes on integrative behavioral health approaches  including counseling techniques and skills for improving mental health and reducing mental illness.\n\nAllCEUs provides multimedia counselor education and CEUs for LPCs, LMHCs, LMFTs and LCSWs as well as addiction counselor precertification training and continuing education.\nUnlimited Counseling CEs and Social Work CEUs for $59 \nSpecialty Certificates and #MasterClass starting at $89\n\nAllCEUs courses for counselor continuing education are accepted in most states because we are an approved education provider for NAADAC, the States of Florida and Texas Boards of Social Work and Mental Health/Professional Counseling, the California Consortium for Addiction Professionals and Professions, the Australian Counselling Association, CRCC,  Canadian Counselling and Psychotherapy Association and more.\n\nDr. Dawn-Elise Snipes teaches adults how to use cognitive behavioral therapy tools for building resilience at work, among staff and in children.  \n\nMany of the skills in the videos are the same ones that are taought in a basic counselling course and can be used as a CBT therapist aid. CBT techniques are helpful tools for self counseling for major depressive disorder, anger management,  confidence, self esteem, anxiety, abandonment issues, self improvement\n\nDr. Snipes' videos have been used by thousands for developing clinical skills for substance abuse counseling, cbt interventions for substance abuse, and skills needed for mental health counselor\n\nTIMESTAMPS\n00:00 Introduction\n00:35 Types of Depression in the DSM5TR\n02:15 Major Depression Diagnosis\n06:15 Persistent depression | dysthymia high | functioning depression\n08:15 Disruptive Mood Dysregulation Disorder DMDD\n23:27  Associated features / Treatment targets\n37:35 Prevalence of Major Depression\n44:20 Risk factors for Depression\n45:35 Suicide risk in people with depression\n47:34 Postpartum depression\n49:40 Seasonal Affective Disorder SAD\n53:30 Differential diagnosis\n56:04 Co-occurring disorders"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=q5Npw03I0t8",
        "youtube_video_id": "q5Npw03I0t8",
        "channel": "Doc Snipes",
        "duration_seconds": 3564
      },
      "level": 1
    },
    {
      "id": "yt-WmkjXkPNANo",
      "name": "Depression & Dysthymia Mnemonics (Memorable Psychiatry Lecture)",
      "sort_order": 24,
      "image_url": "https://i.ytimg.com/vi/WmkjXkPNANo/maxresdefault.jpg",
      "keywords": [
        "Memorable Psychiatry and Neurology"
      ],
      "sections": {
        "Creator's Notes": "Buy \"Memorable Psychiatry,\" \"Memorable Psychopharmacology,” and \"Memorable Neurology\" on Amazon! http://memorablepsych.com/books \n\nDepression is one of the leading causes of death and disability worldwide, so it’s crucial to have a good understanding of it. Learn more about depression and dysthymia in this mnemonics-filled lecture intended for all healthcare providers, including doctors, medical students, psychologists, nurses, nurse practitioners, physician assistants, social workers, and more!\n\nATTRIBUTIONS\nBeauty Flow Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 3.0 License\nhttp://creativecommons.org/licenses/by/3.0/"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=WmkjXkPNANo",
        "youtube_video_id": "WmkjXkPNANo",
        "channel": "Memorable Psychiatry and Neurology",
        "duration_seconds": 852
      },
      "level": 1
    },
    {
      "id": "yt-onKHtQWkNaU",
      "name": "Bipolar Disorder Assessment and Diagnosis | Living with Bipolar Disorder",
      "sort_order": 25,
      "image_url": "https://i.ytimg.com/vi/onKHtQWkNaU/maxresdefault.jpg",
      "keywords": [
        "Doc Snipes"
      ],
      "sections": {
        "Creator's Notes": "Continuing Education for LMFT, LCSW, LPC, LMFT.  NAADAC and State Accredited Education Provider Dawn-Elise Snipes, PhD, LPC NPI: 1699003533  Dr. Dawn-Elise Snipes is a Licensed Professional Counselor and Qualified Clinical Supervisor.  She received her PhD in Mental Health Counseling from the University of Florida in 2002.  In addition to being a practicing clinician, she has provided training to counselors, social workers, nurses and case managers internationally since 2006 through AllCEUs.com 📢SUBSCRIBE and click the BELL to get notified when new videos are uploaded. \n💲 AllCEUs.com Unlimited CEUs $59 based on these videos\nA direct link to the CEU course is https://www.allceus.com/member/cart/index/product/id/52/c/\n#clinicalAssessment #NCMHCE #Bipolardepression\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCAE3JJi8tX7gfhZEXCUGd_A/join\n\nNOTE:  ALL VIDEOS are for educational purposes only and are NOT a replacement for medical advice or counseling from a licensed professional.\n\nVideo by Dr. Dawn Elise Snipes on integrative behavioral health approaches  including counseling techniques and skills for improving mental health and reducing mental illness.\n\nAllCEUs provides multimedia counselor education and CEUs for LPCs, LMHCs, LMFTs and LCSWs as well as addiction counselor precertification training and continuing education.\nUnlimited Counseling CEs amd Social Work CEUs for $59 \nSpecialty Certificates and #MasterClass starting at $89\n\nAllCEUs courses for counselor continuing education are accepted in most states because we are an approved education provider for NAADAC, the States of Florida and Texas Boards of Social Work and Mental Health/Professional Counseling, the California Consortium for Addiction Professionals and Professions, the Australian Counselling Association, CRCC,  Canadian Counselling and Psychotherapy Association and more.\n\nDr. Dawn-Elise Snipes teaches adults how to use cognitive behavioral therapy tools for building resilience at work, among staff and in children.  \n\nMany of the skills in the videos are the same ones that are taought in a basic counselling course and can be used as a CBT therapist aid. CBT techniques are helpful tools for self counseling for major depressive disorder, anger management,  confidence, self esteem, anxiety, abandonment issues, self improvement\n\nDr. Snipes' videos have been used by thousands for developing clinical skills for substance abuse counseling, cbt interventions for substance abuse, and skills needed for mental health counselor"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=onKHtQWkNaU",
        "youtube_video_id": "onKHtQWkNaU",
        "channel": "Doc Snipes",
        "duration_seconds": 3907
      },
      "level": 1
    },
    {
      "id": "yt-4ljWm0aDG7c",
      "name": "Suicide Screening and Risk Assessment in Adolescents: Lurie Children's Dr. Lisa Simons",
      "sort_order": 26,
      "image_url": "https://i.ytimg.com/vi/4ljWm0aDG7c/maxresdefault.jpg",
      "keywords": [
        "Lurie Children's Physician Services"
      ],
      "sections": {
        "Creator's Notes": "https://www.luriechildrens.org/en/specialties-conditions/adolescent-medicine/\nThe Lurie Children's Potocsnak Family Division of Adolescent and Young Adult Medicine provides comprehensive services to adolescents and young adults. We accept new patients between 12-22 years of age. All patients are followed until their 25th birthday.\n\nOur team is dedicated to a patient and family-centered approach ensuring that youth are actively engaged in their care. We offer a range of medical and mental health services for individuals, including:\n\nGender Development Program\nHIV and STI treatment and preventative care \nCommunity programs and initiatives \nTrainings and education\nSubstance use and prevention\nAdolescent Medicine Fellowship\nBehavioral Health\nAdolescent Medicine Research\nEating Disorders"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=4ljWm0aDG7c",
        "youtube_video_id": "4ljWm0aDG7c",
        "channel": "Lurie Children's Physician Services",
        "duration_seconds": 2012
      },
      "level": 1
    },
    {
      "id": "yt-H7Rk5FAZsms",
      "name": "Suicide Risk Assessment",
      "sort_order": 27,
      "image_url": "https://i.ytimg.com/vi/H7Rk5FAZsms/maxresdefault.jpg",
      "keywords": [
        "NEI Psychopharm"
      ],
      "sections": {
        "Creator's Notes": "Here, Dr. Christine Moutier provides an update on assessing elevated suicide risks and how to implement suicide prevention strategies. Originally presented at the 2022 NEI Synapse, in this special presentation, Dr. Moutier interviewed Deborah Butturini, mother to Bekah, a young girl who lost her life to suicide. From the horrible experience comes a tale of strength, with lessons to be learned on suicide prevention, loss, and advocacy. \n\nNEI Members can view the full conversation, titled, \"Remember Bekah: Interview with a Suicide Fighter\" here https://nei.global/encore\nLearn about upcoming NEI Meetings: https://nei.global/meetings\n\nStay updated with email alerts: https://nei.global/updates\n\nInterested in Psychopharmacology? Check out the NEI Master Psychopharmacology Program: https://nei.global/mpp\n\nFollow us on  Facebook: https://nei.global/facebook\nFollow us on LinkedIn: https://nei.global/linkedin\nFollow us on X: https://nei.global/twitter\nFollow us on Instagram: https://nei.global/instagram\n\n🎙 Listen to NEI Podcast: https://nei.global/podcast\n\nCopyright © Neuroscience Education Institute. All rights reserved."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=H7Rk5FAZsms",
        "youtube_video_id": "H7Rk5FAZsms",
        "channel": "NEI Psychopharm",
        "duration_seconds": 323
      },
      "level": 1
    },
    {
      "id": "yt-nyq96BuqJ7s",
      "name": "Primary, Secondary, Tertiary Prevention - Psychiatric Mental Health Nursing | @LevelUpRN",
      "sort_order": 28,
      "image_url": "https://i.ytimg.com/vi/nyq96BuqJ7s/maxresdefault.jpg",
      "keywords": [
        "Level Up RN"
      ],
      "sections": {
        "Creator's Notes": "Learn all about the primary, secondary, and tertiary prevention of mental health disorders in the community.\n\n🎉 Want to breeze through nursing school and ace the NCLEX? 🩺 With our Comprehensive Nursing Collection, you'll get EVERYTHING you need to succeed, plus some amazing perks! 🎁 Right now, when you grab the collection, you'll score a FREE Nursing Planner, a whole YEAR of Level Up RN Membership, AND Flashables - NCLEX Edition (our signature flashcard content in an on-the-go digital format with guided, personalized learning and progress tracking!) 🤩 That's over $345 in savings—the ultimate deal to set you up for success from day one to NCLEX triumph! 🌟 🔗 Don’t wait—claim your bundle today and start leveling up! https://bit.ly/VeryMindful\n\nOur Psychiatric Mental Health Nursing video tutorial series is taught by Cathy Parkes BSN, RN, CWCN, PHN and intended to help RN and PN nursing students study for their nursing school exams, including the ATI, HESI and NCLEX. \n \n#NCLEX #mentalhealth #psychiatricnursing #HESI #Kaplan #ATI #NursingSchool #NursingStudent⁠ #Nurse #RN #PN #Education #LVN #LPN #Prevention\n \n0:00 What to Expect?\n0:20 Primary Prevention \n1:10 Secondary Prevention \n1:20 Memory Trick \n2:00 Tertiary Prevention \n3:09 What’s Next?\n\n🚨Head over to our interactive study guide and index ANYTIME and find out exactly which card we’re referencing. https://bit.ly/PMHIndex\n\n🚪 Access our Cram Courses, Quizzes and Videos all in one ad free space with Level Up RN Membership  https://bit.ly/LevelUpRNMembership  \n\nWant more ways to MASTER PSYCHIATRIC MENTAL HEALTH? Check out our flashcards, review games, videos, tips & more!\n\n                                    👇👇👇👇👇👇👇👇👇👇\n                                    👉 https://bit.ly/ALLPMH 👈\n                                    ☝️👆☝️👆☝️👆☝️👆☝️👆\n\nThis is your one-stop-shop for materials to help you LEARN & REVIEW so you can PASS Nursing School.\n\n🤔🤔🤔 DO YOU WANT TO PASS your classes, proctored exams and the NCLEX? 🤔🤔🤔 Our resources are the best you can buy. They are built with a single goal: help you pass with no fluff. Everything you need, and nothing you don’t. Don’t take our word for it, though! Check out our hundreds of ⭐️⭐️⭐️⭐️⭐️ reviews from nurses who passed their exams and the NCLEX with Level Up RN. \n\n🗂️ Our Ultimate Nursing School Survival kit is your number 1 resource to get through nursing school and to pass the NCLEX. Whether you're just starting school or you’re already prepping for the NCLEX, this bundle of flashcards is the best you can buy. It covers all the information you need to know to pass all your exams and it has FREE shipping! \n➡️ https://bit.ly/TUNSSK ⬅️\n\nL👀king for EVEN MORE resources to survive Nursing School? Make your Nursing School experience your own! Life’s difficult enough—learning shouldn’t be.\n🪅 Games https://nursesquad.com\n💻 Digital resources https://bit.ly/NursingStudyCourses\n📅 Organizational tools https://bit.ly/OrganizingSchool\n\n✨Want perks? Join our channel!\nhttps://youtube.com/leveluprn/join\n\n🏷 Head to https://leveluprn.com/specials for all our latest deals!🥳️\n\n📧 LOOKING FOR FREE RESOURCES TO HELP WITH YOUR EXAMS? Get exclusive tips, latest video releases and more delivered to your email!\n➡️ https://leveluprn.com/signup  ⬅️\n\n⚕ 👩 LEVEL UP NURSE SQUAD  👩⚕️\nAll of the nurses at Level Up RN are here to help! Cathy Parkes started helping her fellow classmates back when she was in nursing school, tutoring so they could pass their exams and graduate. After she got her BSN and started working as an RN at Scripps Encinitas Hospital, she started this YouTube channel to help nursing students around the world. Since then she has built a team of top-notch dedicated nurses and nurse educators who are focused on improving nursing education and supporting career advancement for nurses everywhere. With flashcards, videos, courses, organizational tools and more, we are singularly focused on helping students and nurses Level Up on their exams and nursing careers."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=nyq96BuqJ7s",
        "youtube_video_id": "nyq96BuqJ7s",
        "channel": "Level Up RN",
        "duration_seconds": 212
      },
      "level": 1
    },
    {
      "id": "yt-cGJViDym9SI",
      "name": "Is Your Crisis Assessment Strategy Setting You Up For Disaster?",
      "sort_order": 29,
      "image_url": "https://i.ytimg.com/vi/cGJViDym9SI/maxresdefault.jpg",
      "keywords": [
        "Doc Snipes"
      ],
      "sections": {
        "Creator's Notes": "Continuing Education for LMFT, LCSW, LPC, LMFT.  NAADAC and State Accredited Education Provider Dawn-Elise Snipes, PhD, LPC NPI: 1699003533  Releasing the Power of Crisis Assessment & Interventions \nCEUs for this presentation at https://www.allceus.com/member/cart/index/product/id/365/c/ \n\n00:00 Introduction to prevention assessment and intervention in crisis\n00:36 Goals of crisis services\n01:40 Understanding a mental health crisis\n03:20 Types of crises: developmental vs. situational\n05:00 Risk factors for suicide\n07:45 Role of substance abuse in crisis situations\n09:00 Smoking as a potential risk factor\n10:35 Impact of life changes on mental health\n12:20 Role of legal problems in crises\n15:00 Challenges in accessing treatment\n18:00 Importance of isolation as a risk factor\n20:30 Pregnancy and postpartum considerations\n23:50 Bipolar disorder and risk of crisis\n25:15 Addressing impulsivity and personality disorders\n28:30 Guidelines for working with violent or suicidal individuals\n32:00 Follow-up measures in crisis situations\n\nDr. Dawn-Elise Snipes is a Licensed Professional Counselor and Qualified Clinical Supervisor.  She received her PhD in Mental Health Counseling from the University of Florida in 2002.  In addition to being a practicing clinician, she has provided training to counselors, social workers, nurses and case managers internationally since 2006 through AllCEUs.com Crisis and Suicide Assessment\nEarn  Go to  http://allceus.com to see a listing of our courses.  Unlimited CEUs for $59  Specialty Certificate tracks starting at $89\n#suicideassessment  #crisisintervention #NCMHCE\n\nIf someone is in crisis or having thoughts of suicide, call 911 immediately.\nThis presentation was designed to fulfil mandatory annual retraining requirements for behavioral health professionals and is not a substitute for professional intervention.\n\nAllCEUs was created in 2006  to provide affordable, accessible, high-quality, multimedia training to addiction and mental health counselors.  AllCEUs has more than 700 hours of available  continuing education and has provided training to over 1,000,000 counselors."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=cGJViDym9SI",
        "youtube_video_id": "cGJViDym9SI",
        "channel": "Doc Snipes",
        "duration_seconds": 2078
      },
      "level": 1
    },
    {
      "id": "yt-D7qZ66inJQY",
      "name": "Anxiety Disorders in the DSM 5 TR  | Symptoms and Diagnosis",
      "sort_order": 30,
      "image_url": "https://i.ytimg.com/vi/D7qZ66inJQY/maxresdefault.jpg",
      "keywords": [
        "Doc Snipes"
      ],
      "sections": {
        "Creator's Notes": "Continuing Education for LMFT, LCSW, LPC, LMFT.  NAADAC and State Accredited Education Provider Dawn-Elise Snipes, PhD, LPC NPI: 1699003533  Dr. Dawn-Elise Snipes is a Licensed Professional Counselor and Qualified Clinical Supervisor.  She received her PhD in Mental Health Counseling from the University of Florida in 2002.  In addition to being a practicing clinician, she has provided training to counselors, social workers, nurses and case managers internationally since 2006 through AllCEUs.com #Anxiety Disorder #symptoms in the #DSM5TR  | #NCE  #TestPrep\n📢SUBSCRIBE and click the BELL to get notified when new videos are uploaded. \n💲 AllCEUs.com Unlimited continuing education CEUs $59 \n💻 Online course based on this video can be found at https://allceus.com/member/cart/index/product/id/1484/c/\n⭐ Specialty Certificate Programs for Case Management and Counselor Certification beginning at $89 https://AllCEUs.com/certificate-tracks\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCAE3JJi8tX7gfhZEXCUGd_A/join\n\nNOTE:  ALL VIDEOS are for educational purposes only and are NOT a replacement for medical advice or counseling from a licensed professional.\n\nVideo by Dr. Dawn Elise Snipes on integrative behavioral health approaches  including counseling techniques and skills for improving mental health and reducing mental illness.\n\nAllCEUs provides multimedia counselor education and CEUs for LPCs, LMHCs, LMFTs and LCSWs as well as addiction counselor precertification training and continuing education.\nUnlimited Counseling CEs amd Social Work CEUs for $59 \nSpecialty Certificates and #MasterClass starting at $89\n\nAllCEUs courses for counselor continuing education are accepted in most states because we are an approved education provider for NAADAC, the States of Florida and Texas Boards of Social Work and Mental Health/Professional Counseling, the California Consortium for Addiction Professionals and Professions, the Australian Counselling Association, CRCC,  Canadian Counselling and Psychotherapy Association and more.\n\nDr. Dawn-Elise Snipes teaches adults how to use cognitive behavioral therapy tools for building resilience at work, among staff and in children.  \n\nMany of the skills in the videos are the same ones that are taought in a basic counselling course and can be used as a CBT therapist aid. CBT techniques are helpful tools for self counseling for major depressive disorder, anger management,  confidence, self esteem, anxiety, abandonment issues, self improvement\n\nDr. Snipes' videos have been used by thousands for developing clinical skills for substance abuse counseling, cbt interventions for substance abuse, and skills needed for mental health counselor"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=D7qZ66inJQY",
        "youtube_video_id": "D7qZ66inJQY",
        "channel": "Doc Snipes",
        "duration_seconds": 3612
      },
      "level": 1
    },
    {
      "id": "yt-jQclOkDPwx4",
      "name": "Obsessive Compulsive and Related Disorders in the DSM 5 TR  | Symptoms and Diagnosis",
      "sort_order": 31,
      "image_url": "https://i.ytimg.com/vi/jQclOkDPwx4/maxresdefault.jpg",
      "keywords": [
        "Doc Snipes"
      ],
      "sections": {
        "Creator's Notes": "Continuing Education for LMFT, LCSW, LPC, LMFT.  NAADAC and State Accredited Education Provider Dawn-Elise Snipes, PhD, LPC NPI: 1699003533  Dr. Dawn-Elise Snipes is a Licensed Professional Counselor and Qualified Clinical Supervisor.  She received her PhD in Mental Health Counseling from the University of Florida in 2002.  In addition to being a practicing clinician, she has provided training to counselors, social workers, nurses and case managers internationally since 2006 through AllCEUs.com Obsessive Compulsive Disorder #OCD, #Hoarding Disorder and Related Disorders in the #DSM5TR\n📢SUBSCRIBE and click the BELL to get notified when new videos are uploaded. \n💲 AllCEUs.com Unlimited continuing education CEUs $59 \n💻 Online course based on this video can be found at https://allceus.com/member/cart/index/product/id/1484/c/\n⭐ Specialty Certificate Programs for Case Management and Counselor Certification beginning at $89 https://AllCEUs.com/certificate-tracks\n\n#symptoms #diagnosis #DSM #OCD\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCAE3JJi8tX7gfhZEXCUGd_A/join\n\nNOTE:  ALL VIDEOS are for educational purposes only and are NOT a replacement for medical advice or counseling from a licensed professional.\n\nVideo by Dr. Dawn Elise Snipes on integrative behavioral health approaches  including counseling techniques and skills for improving mental health and reducing mental illness.\n\nAllCEUs.com provides multimedia counselor education and CEUs for LPCs, LMHCs, LMFTs and LCSWs as well as addiction counselor precertification training and continuing education on many of the videos on this channel.  Unlike other providers like CE4Less, AllCEUs includes a weekly LIVE Stream Webinar with your unlimited continuing education and professional development membership.\n\nTIMESTAMPS\n00:00 Objectives\n00:35 What disorders are in the category obsessive compulsive and related disorders\n02:00 How common is OCD Obsessive compulsive disorder\n05:05 Diagnostic criteria for Obsessive Compulsive Disorder in the DSM 5 TR\n10:16 Common content of obsessions and common compulsions\n15:00 Hoarding Disorder\n21:05 Development and course of OCD hoarding disorder\n24:33 Trichotillomania and Excoriation (hair pulling and skin picking) Diagnostic criteria\n27:37 Differential diagnosis of OCD\n40:00 Suicidality and Risk of Suicide in Obsessive Compulsive and Related Disorders\n44:50 Treatment options for obsessive compulsive disorder and related issues"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=jQclOkDPwx4",
        "youtube_video_id": "jQclOkDPwx4",
        "channel": "Doc Snipes",
        "duration_seconds": 3364
      },
      "level": 1
    },
    {
      "id": "yt-4ZjCr_xlIGg",
      "name": "Borderline Personality Disorder Simplified | Diagnosis & Treatment of BPD | A Psychiatrist Explains",
      "sort_order": 32,
      "image_url": "https://i.ytimg.com/vi/4ZjCr_xlIGg/maxresdefault.jpg",
      "keywords": [
        "Dr. Rege"
      ],
      "sections": {
        "Creator's Notes": "Borderline personality disorder is a personality disorder with impairments in self and interpersonal functioning with specific pathological personality traits. \n#bpd #borderlinepersonalitydisorder #emotionallyunstablepersonalitydisorder #dsm5 #icd11\nIn this video, Dr Sanil Rege provides an overview of Borderline Personality Disorder. \n00:00 - Intro \n02:04 - What is Borderline Personality Disorder? \n03:36 - Risk Factors for Borderline Personality Disorder\n07:32 - Diagnostic Criteria for BPD - DSM-5 and ICD-11\n12:52 - Treatment of Borderline Personality Disorder\nIn ICD-10 it is labelled as an Emotionally unstable personality disorder (EUPD). In ICD-11 this has been changed to a borderline pattern qualifier. \n\nBorderline Personality Disorder (BPD) is a mental health disorder that impacts how you think and feel about yourself and others, causing problems in everyday life. It includes self-image issues, difficulty managing emotions and behaviour, and a pattern of unstable relationships.\n\nSigns and symptoms may include:\n\n1. An intense fear of abandonment, even going to extreme measures to avoid real or imagined separation or rejection\n2. A pattern of unstable intense relationships, such as idealising someone one moment and then suddenly believing the person doesn't care enough or is cruel\n3. Rapid changes in self-identity and self-image including shifting goals and values, and seeing yourself as bad or as if you don't exist at all\n4. Periods of stress-related paranoia and loss of contact with reality, lasting from a few minutes to a few hours\n5. Impulsive and risky behaviour, such as gambling, reckless driving, unsafe sex, spending sprees, binge eating or drug abuse, or sabotaging success by suddenly quitting a good job or ending a positive relationship\n6. Suicidal threats or behaviour or self-injury, often in response to a fear of separation or rejection\n7. Wide mood swings lasting from a few hours to a few days, which can include intense happiness, irritability, shame or anxiety\n8. Ongoing feelings of emptiness\n9. Inappropriate, intense anger, such as frequently losing your temper, being sarcastic or bitter, or having physical fights. \nRead more here: \nhttps://psychscenehub.com/psychpedia/borderline-personality-disorder-dsm-5-and-icd-11-diagnostic-criteria/"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=4ZjCr_xlIGg",
        "youtube_video_id": "4ZjCr_xlIGg",
        "channel": "Dr. Rege",
        "duration_seconds": 1008
      },
      "level": 1
    },
    {
      "id": "yt-OW3xZsUdQ64",
      "name": "SEL and Equity 101: A Practical Approach (SEL Academy)",
      "sort_order": 33,
      "image_url": "https://i.ytimg.com/vi/OW3xZsUdQ64/maxresdefault.jpg",
      "keywords": [
        "Academy for Social-Emotional Learning in Schools"
      ],
      "sections": {
        "Creator's Notes": "This webinar will aid participants in viewing SEL from an equity perspective. Centering on the self awareness competency, one will begin to think about comfortability and capability of discussing topics of Diversity, Equity, Inclusion, Justice, and Belonging with students; we will define common language and terms; and determine ways to serve as an anti-racist educator."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=OW3xZsUdQ64",
        "youtube_video_id": "OW3xZsUdQ64",
        "channel": "Academy for Social-Emotional Learning in Schools",
        "duration_seconds": 2292
      },
      "level": 1
    }
  ],
  "creator_name": "",
  "creator_link": "",
  "is_published": true,
  "created_at": "2026-01-27T00:11:37.613Z"
}