{
  "_grammar_commons": {
    "schema_version": "1.0",
    "license": "CC-BY-SA-4.0",
    "license_url": "https://creativecommons.org/licenses/by-sa/4.0/",
    "attribution": [
      {
        "name": "Claude (AI assistant)",
        "date": "2026-02-17",
        "note": "Compiled from public biographical sources, Wikipedia, news archives, and official records."
      }
    ]
  },
  "name": "The Obama Family Tree",
  "description": "A four-generation family tree of the Obama family — from Kenyan and Kansas roots to the White House. Each member includes biographical context, origins, and a suggested YouTube video. L1 items are individual people, L2 items are couples and family units, L3 items are generational/cultural branches.",
  "cover_image_url": "",
  "tags": [
    "family tree",
    "Obama",
    "biography",
    "history",
    "Kenya",
    "Kansas",
    "Chicago",
    "Hawaii",
    "44th President"
  ],
  "grammar_type": "custom",
  "creator_name": "Claude AI",
  "items": [
    {
      "id": "hussein-onyango-obama",
      "name": "Hussein Onyango Obama",
      "symbol": "🇰🇪",
      "level": 1,
      "category": "generation-1",
      "subcategory": "paternal",
      "sort_order": 1,
      "keywords": ["Luo", "Kenya", "Kogelo", "herbalist", "World War I", "colonial era"],
      "questions": ["How do colonial histories shape the trajectories of families across generations?"],
      "quotes": ["A man is measured by the respect he earns from his neighbors."],
      "sections": {
        "Biography": "Hussein Onyango Obama (c. 1895–1979) was Barack Obama's paternal grandfather, a Luo elder from Nyang'oma Kogelo in western Kenya. He worked as a cook for British colonial administrators and served in the British Army during World War I. Known as a strict disciplinarian, he converted to Islam and took the name Hussein. He was reportedly detained during the Mau Mau uprising in the 1940s–50s.",
        "Origins": "Born into the Luo ethnic group near Lake Victoria, Kenya. The Luo are the third-largest ethnic group in Kenya, traditionally fishermen, farmers, and cattle herders. Kogelo remains the Obama ancestral homestead to this day.",
        "Interesting Fact": "He was among the first in his region to abandon traditional dress and adopt Western clothing, earning him a reputation as a modernizer — and a controversial figure in his own village."
      },
      "metadata": {
        "birth_year": 1895,
        "birth_year_approximate": true,
        "death_year": 1979,
        "birthplace": "Nyang'oma Kogelo, Kenya",
        "relationship": "Paternal grandfather of Barack Obama II",
        "youtube_search_term": "Hussein Onyango Obama Kenya grandfather documentary"
      }
    },
    {
      "id": "sarah-onyango-obama",
      "name": "Sarah Onyango Obama (Mama Sarah)",
      "symbol": "🇰🇪",
      "level": 1,
      "category": "generation-1",
      "subcategory": "paternal",
      "sort_order": 2,
      "keywords": ["Mama Sarah", "Kogelo", "philanthropy", "education", "matriarch"],
      "questions": ["What does it mean to be a matriarch who holds a family's story together across continents?"],
      "quotes": ["Education is the key to a better future for our children."],
      "sections": {
        "Biography": "Sarah Onyango Obama (c. 1922–2021), known worldwide as 'Mama Sarah,' was Hussein Onyango Obama's third wife and the step-grandmother of Barack Obama. Though not a biological grandmother, she raised Barack Obama Sr. and was the family's beloved matriarch in Kogelo. She founded the Mama Sarah Obama Foundation to support orphans and promote education.",
        "Origins": "Lived her entire life in Nyang'oma Kogelo, Kenya. She became a global figure after Barack Obama's election in 2008, welcoming visitors and journalists from around the world to the family homestead.",
        "Interesting Fact": "She received the United Nations Education Pioneer Award in 2014 for her philanthropy. When Barack Obama won the presidency, hundreds of Kogelo villagers gathered at her home to celebrate through the night."
      },
      "metadata": {
        "birth_year": 1922,
        "birth_year_approximate": true,
        "death_year": 2021,
        "birthplace": "Nyang'oma Kogelo, Kenya",
        "relationship": "Step-paternal grandmother of Barack Obama II",
        "youtube_search_term": "Mama Sarah Obama Kenya interview grandmother"
      }
    },
    {
      "id": "stanley-armour-dunham",
      "name": "Stanley Armour Dunham",
      "symbol": "🇺🇸",
      "level": 1,
      "category": "generation-1",
      "subcategory": "maternal",
      "sort_order": 3,
      "keywords": ["Kansas", "Wichita", "World War II", "furniture salesman", "Hawaii"],
      "questions": ["How does restless wandering across a continent shape the next generation's worldview?"],
      "sections": {
        "Biography": "Stanley Armour Dunham (1918–1992) was Barack Obama's maternal grandfather. Born in Wichita, Kansas, he served in the U.S. Army during World War II under General Patton in Europe. After the war he moved his family across several states — from Kansas to California, Texas, Washington, and finally Hawaii — working as a furniture salesman. Known as 'Gramps,' he helped raise young Barack in Honolulu.",
        "Origins": "Descended from English and Irish immigrants who settled the Great Plains. His Kansas roots represent the quintessential American Midwest — small towns, open prairies, and the restless postwar generation.",
        "Interesting Fact": "He enlisted in the Army the day after Pearl Harbor. In Hawaii, he was known to take young Barack to the beach and introduce him to an older African-American poet and journalist named Frank Marshall Davis, who became a mentor figure."
      },
      "metadata": {
        "birth_year": 1918,
        "death_year": 1992,
        "birthplace": "Wichita, Kansas, USA",
        "relationship": "Maternal grandfather of Barack Obama II",
        "youtube_search_term": "Stanley Dunham Obama grandfather Kansas documentary"
      }
    },
    {
      "id": "madelyn-lee-payne-dunham",
      "name": "Madelyn Lee Payne Dunham (Toot)",
      "symbol": "🇺🇸",
      "level": 1,
      "category": "generation-1",
      "subcategory": "maternal",
      "sort_order": 4,
      "keywords": ["Toot", "Kansas", "banker", "Rosie the Riveter", "Hawaii", "trailblazer"],
      "questions": ["What quiet strength does it take to break barriers in an era that never names your courage?"],
      "quotes": ["Any woman can do what I did, if she just makes up her mind."],
      "sections": {
        "Biography": "Madelyn Lee Payne Dunham (1922–2008), known as 'Toot' (from the Hawaiian word for grandmother, 'tutu'), was Barack Obama's maternal grandmother and one of his primary caregivers. She worked on a Boeing B-29 assembly line during WWII, then rose from a bank secretary to become one of the first female vice presidents at the Bank of Hawaii — without a college degree.",
        "Origins": "Born in Peru, Kansas, a small town on the Oklahoma border. Her journey from Kansas farm country to a Honolulu high-rise mirrors the enormous social changes of 20th-century America.",
        "Interesting Fact": "She died on November 2, 2008 — just one day before her grandson was elected the 44th President of the United States. Obama paused his campaign to fly to Hawaii and say goodbye. He later called her 'the quiet hero' of his life."
      },
      "metadata": {
        "birth_year": 1922,
        "death_year": 2008,
        "birthplace": "Peru, Kansas, USA",
        "relationship": "Maternal grandmother of Barack Obama II",
        "youtube_search_term": "Madelyn Dunham Toot Obama grandmother tribute"
      }
    },
    {
      "id": "barack-obama-sr",
      "name": "Barack Hussein Obama Sr.",
      "symbol": "🇰🇪",
      "level": 1,
      "category": "generation-2",
      "subcategory": "paternal",
      "sort_order": 5,
      "keywords": ["Kenya", "Harvard", "economist", "Luo", "independence", "scholarship"],
      "questions": ["What happens when brilliance and ambition collide with the weight of history and personal demons?"],
      "sections": {
        "Biography": "Barack Hussein Obama Sr. (1936–1982) was a Kenyan economist and Barack Obama's father. Selected for a special airlift scholarship, he became one of the first African students at the University of Hawaii in 1959, where he met Ann Dunham. He later studied economics at Harvard. He returned to Kenya to serve in the government under Jomo Kenyatta and later Tom Mboya, but fell out of political favor and struggled with personal difficulties. He died in a car accident in Nairobi at age 46.",
        "Origins": "Born in Nyang'oma Kogelo, Siaya District, Kenya Colony. Part of the 'Tom Mboya Airlift' generation — young Kenyans sent to American universities in the late 1950s to prepare for an independent Kenya.",
        "Interesting Fact": "The 1959 'Airlift Africa' program that brought him to Hawaii was partially funded by a young Senator John F. Kennedy. Obama Sr. was the University of Hawaii's first African student."
      },
      "metadata": {
        "birth_year": 1936,
        "death_year": 1982,
        "birthplace": "Nyang'oma Kogelo, Kenya Colony",
        "relationship": "Father of Barack Obama II",
        "youtube_search_term": "Barack Obama Sr Kenya father documentary airlift Africa"
      }
    },
    {
      "id": "stanley-ann-dunham",
      "name": "Stanley Ann Dunham",
      "symbol": "🌏",
      "level": 1,
      "category": "generation-2",
      "subcategory": "maternal",
      "sort_order": 6,
      "keywords": ["anthropologist", "microfinance", "Indonesia", "Kansas", "Hawaii", "pioneer"],
      "questions": ["How does a life devoted to understanding other cultures shape the worldview of a future president?"],
      "sections": {
        "Biography": "Stanley Ann Dunham (1942–1995) was a cultural anthropologist and Barack Obama's mother. Born in Wichita, Kansas, she grew up in an era of social change and moved with her family to Hawaii, where she met Barack Obama Sr. at the University of Hawaii. After their divorce, she married Lolo Soetoro and lived in Indonesia for years, where she did pioneering fieldwork on microfinance and rural development. She earned her PhD from the University of Hawaii. She died of ovarian and uterine cancer at 52.",
        "Origins": "Her Kansas-to-Hawaii-to-Indonesia trajectory makes her one of the most cosmopolitan figures in presidential family history. Her anthropological work on village blacksmithing and microfinance in Java was ahead of its time.",
        "Interesting Fact": "Her 1992 PhD dissertation on peasant blacksmithing in Indonesia was over 1,000 pages long. The documentary 'Obama Mama' (2014) chronicles her extraordinary life. Obama has said, 'She was the most generous spirit I have ever known.'"
      },
      "metadata": {
        "birth_year": 1942,
        "death_year": 1995,
        "birthplace": "Wichita, Kansas, USA",
        "relationship": "Mother of Barack Obama II",
        "youtube_search_term": "Ann Dunham Obama mother documentary anthropologist"
      }
    },
    {
      "id": "lolo-soetoro",
      "name": "Lolo Soetoro",
      "symbol": "🇮🇩",
      "level": 1,
      "category": "generation-2",
      "subcategory": "maternal",
      "sort_order": 7,
      "keywords": ["Indonesia", "Jakarta", "geologist", "stepfather", "Java"],
      "questions": ["How does growing up in a foreign land with a stepfather give you a wider lens on the world?"],
      "sections": {
        "Biography": "Lolo Soetoro (1935–1987) was an Indonesian geologist and Barack Obama's stepfather. He met Ann Dunham at the University of Hawaii, where he was studying geography. They married in 1965 and moved to Jakarta, Indonesia, where young Barack (ages 6–10) attended local schools and learned Indonesian. Lolo worked for the Indonesian army's mapping department and later for an oil company. He and Ann divorced in 1980.",
        "Origins": "Born in Bandung, West Java, Indonesia. He came from a Javanese family; his father and elder brother died during the Indonesian independence struggle against the Dutch.",
        "Interesting Fact": "Young Barack Obama's years in Jakarta (1967–1971) gave him exposure to a Muslim-majority country, tropical poverty, and a completely different culture — experiences he later wrote about in 'Dreams from My Father.'"
      },
      "metadata": {
        "birth_year": 1935,
        "death_year": 1987,
        "birthplace": "Bandung, West Java, Indonesia",
        "relationship": "Stepfather of Barack Obama II",
        "youtube_search_term": "Lolo Soetoro Obama stepfather Indonesia Jakarta"
      }
    },
    {
      "id": "fraser-robinson-iii",
      "name": "Fraser Robinson III",
      "symbol": "🇺🇸",
      "level": 1,
      "category": "generation-2",
      "subcategory": "robinson",
      "sort_order": 8,
      "keywords": ["Chicago", "South Side", "city worker", "multiple sclerosis", "blue collar", "Democratic precinct captain"],
      "questions": ["What does it mean to show up every day, despite pain, so your children can dream bigger?"],
      "sections": {
        "Biography": "Fraser Robinson III (1935–1991) was Michelle Obama's father, a Chicago city pump operator and Democratic precinct captain on the South Side. Despite being diagnosed with multiple sclerosis in his 30s, he never missed a day of work and never complained. He walked with crutches and used sheer will to provide for his family. He and Marian raised Michelle and Craig in a small apartment on Euclid Avenue.",
        "Origins": "Born and raised on Chicago's South Side. His family was part of the Great Migration — African Americans who moved from the rural South to northern industrial cities in the early 20th century for better opportunities.",
        "Interesting Fact": "Michelle Obama has said her father is the person who most shaped her character. In 'Becoming,' she wrote: 'He was our champion, our cheerleader. He never asked us to be the best — only to make sure we were trying our best.'"
      },
      "metadata": {
        "birth_year": 1935,
        "death_year": 1991,
        "birthplace": "Chicago, Illinois, USA",
        "relationship": "Father of Michelle Obama",
        "youtube_search_term": "Fraser Robinson III Michelle Obama father Chicago tribute"
      }
    },
    {
      "id": "marian-shields-robinson",
      "name": "Marian Shields Robinson",
      "symbol": "🇺🇸",
      "level": 1,
      "category": "generation-2",
      "subcategory": "robinson",
      "sort_order": 9,
      "keywords": ["Chicago", "South Side", "White House", "grandmother", "backbone", "Euclid Avenue"],
      "questions": ["What kind of quiet power does it take to keep a family grounded — even in the White House?"],
      "sections": {
        "Biography": "Marian Shields Robinson (1937–2024) was Michelle Obama's mother and the rock of the Robinson family. A lifelong Chicagoan, she worked as a secretary at Spiegel catalog store before becoming a full-time mother. When the Obamas moved into the White House in 2009, Marian moved in too — to provide stability for granddaughters Malia and Sasha. Staff called her the 'most beloved figure in the White House.'",
        "Origins": "Descended from African Americans who endured slavery and segregation. Genealogical research traced her roots to enslaved people in the American South — a lineage that makes the White House residence profoundly symbolic.",
        "Interesting Fact": "She famously resisted the spotlight, granting almost no media interviews. When asked about living in the White House, she joked: 'I tell my friends I'm just the grandma and I'm going upstairs.' She died in May 2024 at age 86."
      },
      "metadata": {
        "birth_year": 1937,
        "death_year": 2024,
        "birthplace": "Chicago, Illinois, USA",
        "relationship": "Mother of Michelle Obama",
        "youtube_search_term": "Marian Robinson Michelle Obama mother White House CBS interview"
      }
    },
    {
      "id": "barack-obama-ii",
      "name": "Barack Hussein Obama II",
      "symbol": "🏛️",
      "level": 1,
      "category": "generation-3",
      "subcategory": "core-family",
      "sort_order": 10,
      "keywords": ["44th President", "Hawaii", "Chicago", "Harvard Law", "Nobel Peace Prize", "Dreams from My Father"],
      "questions": ["How does a person shaped by so many different worlds find a single voice that resonates with millions?"],
      "quotes": ["There is not a liberal America and a conservative America — there is the United States of America."],
      "sections": {
        "Biography": "Barack Hussein Obama II (born August 4, 1961) is the 44th President of the United States (2009–2017) and the first African American to hold the office. Born in Honolulu, Hawaii, to a Kenyan father and a Kansas mother, he was raised in Hawaii and Indonesia. He graduated from Columbia University and Harvard Law School, where he was the first Black president of the Harvard Law Review. He worked as a community organizer in Chicago, taught constitutional law, and served as an Illinois state senator and U.S. Senator before winning the presidency.",
        "Origins": "His unique heritage — Luo Kenyan, English-Irish American, Indonesian stepfamily — makes him one of the most multicultural figures in American political history. Hawaii, the most diverse state in the U.S., was the perfect crucible for his identity.",
        "Interesting Fact": "His 2004 DNC keynote speech, delivered as an unknown state senator, is widely considered the 17 minutes that changed American politics. He won the 2009 Nobel Peace Prize and is the author of bestsellers 'Dreams from My Father' and 'The Audacity of Hope.'"
      },
      "metadata": {
        "birth_year": 1961,
        "birthplace": "Honolulu, Hawaii, USA",
        "relationship": "44th President of the United States",
        "youtube_search_term": "Barack Obama 2004 DNC keynote speech full"
      }
    },
    {
      "id": "michelle-obama",
      "name": "Michelle LaVaughn Robinson Obama",
      "symbol": "🏛️",
      "level": 1,
      "category": "generation-3",
      "subcategory": "core-family",
      "sort_order": 11,
      "keywords": ["First Lady", "Chicago", "Princeton", "Harvard Law", "Let's Move", "Becoming", "lawyer"],
      "questions": ["What does it mean to redefine what a First Lady can be?"],
      "quotes": ["When they go low, we go high."],
      "sections": {
        "Biography": "Michelle LaVaughn Robinson Obama (born January 17, 1964) served as the 44th First Lady of the United States (2009–2017). Raised on Chicago's South Side, she graduated from Princeton University and Harvard Law School. At the law firm Sidley Austin, she was assigned to mentor a summer associate named Barack Obama — and the rest is history. As First Lady, she launched the 'Let's Move!' campaign against childhood obesity and the 'Reach Higher' initiative for education. Her memoir 'Becoming' became one of the bestselling memoirs in history.",
        "Origins": "A product of Chicago's South Side and the Great Migration's legacy. Her family's journey from slavery to the Ivy League to the White House is a story arc that embodies generations of African American aspiration.",
        "Interesting Fact": "She asked her brother Craig to play basketball with Barack to evaluate his character before she would date him seriously. Craig reported back favorably. Her 'Becoming' book tour filled arenas like a rock concert."
      },
      "metadata": {
        "birth_year": 1964,
        "birthplace": "Chicago, Illinois, USA",
        "relationship": "44th First Lady of the United States",
        "youtube_search_term": "Michelle Obama 2016 DNC speech when they go low we go high"
      }
    },
    {
      "id": "auma-obama",
      "name": "Auma Obama",
      "symbol": "🇰🇪",
      "level": 1,
      "category": "generation-3",
      "subcategory": "half-siblings",
      "sort_order": 12,
      "keywords": ["Nairobi", "Sauti Kuu", "journalist", "sociologist", "half-sister", "Germany", "activist"],
      "questions": ["How does a shared father and a continent apart create a bond that reshapes both lives?"],
      "sections": {
        "Biography": "Rita Auma Obama (born 1960) is a Kenyan-British community activist, sociologist, journalist, and author — and Barack Obama's elder half-sister through their shared father, Barack Obama Sr. She grew up in Kenya with her mother Kezia, studied at the University of Heidelberg in Germany, and earned a PhD from the University of Bayreuth. She founded the Sauti Kuu Foundation ('Powerful Voices' in Kiswahili) to empower disadvantaged youth in Kenya.",
        "Origins": "Born in Nairobi, Kenya. Her mother Kezia was Barack Obama Sr.'s first wife. Auma first contacted Barack by phone in the 1980s, beginning a relationship he later wrote about movingly in 'Dreams from My Father.'",
        "Interesting Fact": "She gave a TEDx talk at TEDxVienna titled 'Opportunities Unlimited — Poverty Is No Excuse.' She filmed the documentary 'A Journey in Black and White' capturing Barack and Michelle's early visit to Kenya in the 1990s."
      },
      "metadata": {
        "birth_year": 1960,
        "birthplace": "Nairobi, Kenya",
        "relationship": "Paternal half-sister of Barack Obama II",
        "youtube_search_term": "Auma Obama TEDx Vienna Opportunities Unlimited speech"
      }
    },
    {
      "id": "maya-soetoro-ng",
      "name": "Maya Soetoro-Ng",
      "symbol": "🌺",
      "level": 1,
      "category": "generation-3",
      "subcategory": "half-siblings",
      "sort_order": 13,
      "keywords": ["Jakarta", "Hawaii", "peace studies", "educator", "half-sister", "Obama Foundation"],
      "questions": ["How does a childhood split between Jakarta and Honolulu shape a lifelong mission for peace?"],
      "sections": {
        "Biography": "Maya Kasandra Soetoro-Ng (born August 15, 1970) is an Indonesian-American educator and Barack Obama's maternal half-sister. The daughter of Ann Dunham and Lolo Soetoro, she was born in Jakarta, Indonesia, and raised in Hawaii. She is a faculty specialist at the Spark M. Matsunaga Institute for Peace and Conflict Resolution at the University of Hawaii at Manoa. She also works as a consultant for the Obama Foundation's Asia-Pacific Leaders Program.",
        "Origins": "Born in Jakarta, Indonesia to an American mother and Indonesian father. Her multicultural upbringing — Indonesian, American, and Hawaiian — mirrors her half-brother's global identity.",
        "Interesting Fact": "She wrote the children's book 'Ladder to the Moon,' inspired by her daughter's wish to meet her grandmother Ann Dunham, who died before she was born. She gave the nominating speech for Barack at the 2008 DNC."
      },
      "metadata": {
        "birth_year": 1970,
        "birthplace": "Jakarta, Indonesia",
        "relationship": "Maternal half-sister of Barack Obama II",
        "youtube_search_term": "Maya Soetoro-Ng interview C-SPAN Obama sister"
      }
    },
    {
      "id": "craig-robinson",
      "name": "Craig Malcolm Robinson",
      "symbol": "🏀",
      "level": 1,
      "category": "generation-3",
      "subcategory": "robinson",
      "sort_order": 14,
      "keywords": ["Princeton", "basketball", "coach", "brother", "IMO podcast", "Oregon State"],
      "questions": ["Can a basketball game reveal someone's true character?"],
      "sections": {
        "Biography": "Craig Malcolm Robinson (born April 21, 1962) is Michelle Obama's older brother, a former Ivy League basketball star, college basketball coach, and current executive director of the National Association of Basketball Coaches. He attended Princeton University where he was a two-time Ivy League Player of the Year. He coached at Brown University and Oregon State. He now co-hosts the 'IMO' podcast with Michelle Obama.",
        "Origins": "Raised on Chicago's South Side alongside Michelle. Like his sister, he attended Princeton, where he still ranks as the seventh-highest scorer in the Tigers' history with 1,441 points.",
        "Interesting Fact": "When Michelle started dating Barack Obama, she asked Craig to play basketball with him and report back on his character. 'I told her he was very confident but not arrogant, with a good sense of humor,' Craig later recalled. That one basketball game may have changed American history."
      },
      "metadata": {
        "birth_year": 1962,
        "birthplace": "Chicago, Illinois, USA",
        "relationship": "Brother of Michelle Obama, brother-in-law of Barack Obama II",
        "youtube_search_term": "Craig Robinson Michelle Obama IMO podcast basketball"
      }
    },
    {
      "id": "malia-obama",
      "name": "Malia Ann Obama",
      "symbol": "🎬",
      "level": 1,
      "category": "generation-4",
      "subcategory": "children",
      "sort_order": 15,
      "keywords": ["filmmaker", "Sundance", "Harvard", "First Daughter", "Los Angeles", "director"],
      "questions": ["What does it take to forge your own identity when you grew up in the most famous house in the world?"],
      "sections": {
        "Biography": "Malia Ann Obama (born July 4, 1998) is the elder daughter of Barack and Michelle Obama. She was 10 years old when her father was elected president and spent her formative teenage years in the White House. She graduated from Harvard University in 2021, taking a gap year before college. She has pursued a career in filmmaking — her directorial debut, the short film 'The Heart,' premiered at the Sundance Film Festival in 2025.",
        "Origins": "Born in Chicago, Illinois. Raised between Washington D.C. and Chicago. Now based in Los Angeles, where she is building a career in the film industry.",
        "Interesting Fact": "She worked as an intern on the sets of HBO's 'Extant' and Halle Berry's production before college. At Sundance, she chose to credit herself as 'Malia Ann' — using her middle name rather than 'Obama' — to establish her own creative identity."
      },
      "metadata": {
        "birth_year": 1998,
        "birthplace": "Chicago, Illinois, USA",
        "relationship": "Elder daughter of Barack and Michelle Obama",
        "youtube_search_term": "Malia Obama Sundance film The Heart interview"
      }
    },
    {
      "id": "sasha-obama",
      "name": "Natasha \"Sasha\" Obama",
      "symbol": "🎓",
      "level": 1,
      "category": "generation-4",
      "subcategory": "children",
      "sort_order": 16,
      "keywords": ["USC", "sociology", "First Daughter", "Los Angeles", "youngest White House resident"],
      "questions": ["How do you build a private life after growing up in the world's most public spotlight?"],
      "sections": {
        "Biography": "Natasha 'Sasha' Obama (born June 10, 2001) is the younger daughter of Barack and Michelle Obama. She was just 7 years old when her father took office, making her the youngest resident of the White House since Amy Carter. She graduated from Sidwell Friends School in Washington D.C. and earned a degree in sociology from the University of Southern California (USC) in 2023.",
        "Origins": "Born in Chicago, Illinois. She spent most of her childhood in the White House (ages 7–15). Now lives in Los Angeles near her sister Malia.",
        "Interesting Fact": "At 7 years old, she was the youngest child to live in the White House since John F. Kennedy Jr. in 1961. Jenna Bush Hager and Barbara Bush gave Sasha and Malia a tour of the White House during the transition, showing them how to slide down the banisters."
      },
      "metadata": {
        "birth_year": 2001,
        "birthplace": "Chicago, Illinois, USA",
        "relationship": "Younger daughter of Barack and Michelle Obama",
        "youtube_search_term": "Sasha Obama White House growing up first daughter"
      }
    },
    {
      "id": "couple-onyango-sarah",
      "name": "Hussein Onyango & Sarah Obama",
      "level": 2,
      "category": "couple",
      "subcategory": "paternal",
      "sort_order": 17,
      "composite_of": ["hussein-onyango-obama", "sarah-onyango-obama"],
      "sections": {
        "Description": "The Kogelo homestead. Hussein Onyango, a colonial-era modernizer and Luo elder, and Sarah, his third wife and the family's enduring matriarch. Together they anchored the Obama family in western Kenya across the entire 20th century. Sarah raised Barack Obama Sr. as her own and kept the homestead as a living link between Kenya and the White House.",
        "Reflection": "A family rooted in Lake Victoria's shores, stretching across oceans through generations."
      }
    },
    {
      "id": "couple-dunham-grandparents",
      "name": "Stanley & Madelyn Dunham",
      "level": 2,
      "category": "couple",
      "subcategory": "maternal",
      "sort_order": 18,
      "composite_of": ["stanley-armour-dunham", "madelyn-lee-payne-dunham"],
      "sections": {
        "Description": "The Kansas wanderers. Stanley, a WWII veteran and restless dreamer, and Madelyn, a wartime factory worker turned banking executive. They moved from Kansas to Hawaii, raised their daughter Ann to be fearlessly curious, and then raised their grandson Barack when Ann was overseas. 'Gramps' and 'Toot' gave Barack his American grounding.",
        "Reflection": "From the Kansas prairie to a Honolulu high-rise — a very American journey that made a president."
      }
    },
    {
      "id": "couple-obama-sr-ann",
      "name": "Barack Obama Sr. & Ann Dunham",
      "level": 2,
      "category": "couple",
      "subcategory": "parents",
      "sort_order": 19,
      "composite_of": ["barack-obama-sr", "stanley-ann-dunham"],
      "sections": {
        "Description": "The improbable meeting. A Kenyan economics student on an airlift scholarship and a Kansas teenager in a Russian-language class at the University of Hawaii, 1960. Their brief marriage produced Barack Obama II. They separated when Barack was two, and Obama Sr. returned to Kenya. Ann later married Lolo Soetoro and moved to Indonesia. Though the marriage was short, it created the most multicultural family tree in presidential history.",
        "Reflection": "A brief union across continents that set in motion an extraordinary American story."
      }
    },
    {
      "id": "couple-ann-lolo",
      "name": "Ann Dunham & Lolo Soetoro",
      "level": 2,
      "category": "couple",
      "subcategory": "parents",
      "sort_order": 20,
      "composite_of": ["stanley-ann-dunham", "lolo-soetoro"],
      "sections": {
        "Description": "The Jakarta chapter. Ann and Lolo met at the University of Hawaii and married in 1965. They moved to Jakarta, Indonesia, where young Barack spent four formative years attending local schools and learning Indonesian. Their daughter Maya was born there. Ann eventually returned to Hawaii to ensure Barack's education, though she continued her anthropological fieldwork in Indonesia for decades.",
        "Reflection": "The Indonesia years added another layer to young Barack's already global identity."
      }
    },
    {
      "id": "couple-robinson-parents",
      "name": "Fraser & Marian Robinson",
      "level": 2,
      "category": "couple",
      "subcategory": "robinson",
      "sort_order": 21,
      "composite_of": ["fraser-robinson-iii", "marian-shields-robinson"],
      "sections": {
        "Description": "The South Side foundation. Fraser, a city pump operator who never missed a day of work despite multiple sclerosis, and Marian, the quiet backbone who kept everything running. They raised Michelle and Craig in a small apartment on Euclid Avenue — one floor of a bungalow — instilling values of hard work, education, and showing up. Their parenting philosophy shaped a future First Lady.",
        "Reflection": "Proof that greatness is built in small apartments with big love."
      }
    },
    {
      "id": "couple-barack-michelle",
      "name": "Barack & Michelle Obama",
      "level": 2,
      "category": "couple",
      "subcategory": "core-family",
      "sort_order": 22,
      "composite_of": ["barack-obama-ii", "michelle-obama"],
      "sections": {
        "Description": "The partnership. They met in 1989 at the law firm Sidley Austin in Chicago, where Michelle was assigned as Barack's mentor. She initially resisted his advances (he was a summer associate, after all). Their first date included a Spike Lee movie and ice cream. Married in 1992, they became parents to Malia (1998) and Sasha (2001). Their partnership carried them through two presidential campaigns, eight years in the White House, and into a post-presidency of books, podcasts, and foundation work.",
        "Reflection": "From a law firm mentorship to the White House — a modern American love story."
      }
    },
    {
      "id": "siblings-obama-children",
      "name": "Malia & Sasha Obama",
      "level": 2,
      "category": "siblings",
      "subcategory": "children",
      "sort_order": 23,
      "composite_of": ["malia-obama", "sasha-obama"],
      "sections": {
        "Description": "The First Daughters. Malia and Sasha grew up in the White House from ages 10 and 7, navigating the most public childhood in America with grace. Protected fiercely by their parents and the Secret Service, they managed to maintain relatively normal lives — school dances, summer jobs, sleepovers. Now adults in Los Angeles, Malia pursues filmmaking while Sasha earned her degree from USC.",
        "Reflection": "They entered the White House as little girls and left as young women — watched by a nation, grounded by family."
      }
    },
    {
      "id": "branch-kenyan-roots",
      "name": "Kenyan Roots: The Luo Heritage",
      "level": 3,
      "category": "branch",
      "subcategory": "paternal",
      "sort_order": 24,
      "composite_of": ["hussein-onyango-obama", "sarah-onyango-obama", "barack-obama-sr", "auma-obama"],
      "sections": {
        "Description": "The Obama family's Kenyan branch traces back to the Luo people of western Kenya, near Lake Victoria. From Hussein Onyango's colonial-era service to Barack Sr.'s scholarship to America to Auma's activism and PhD — this branch represents the African chapter of a transcontinental family story. The homestead in Nyang'oma Kogelo remains a pilgrimage site.",
        "Reflection": "Kogelo to the White House — a journey that no one in that small village by Lake Victoria could have imagined."
      }
    },
    {
      "id": "branch-kansas-roots",
      "name": "Kansas Roots: The American Heartland",
      "level": 3,
      "category": "branch",
      "subcategory": "maternal",
      "sort_order": 25,
      "composite_of": ["stanley-armour-dunham", "madelyn-lee-payne-dunham", "stanley-ann-dunham", "maya-soetoro-ng"],
      "sections": {
        "Description": "The Dunham branch connects Barack Obama to the American Midwest — Kansas wheat fields, small-town values, WWII service, and the postwar restlessness that carried a family from Wichita to Honolulu. Stanley and Madelyn raised Ann to question everything; Ann raised Barack to see the whole world. Maya carries this legacy forward through peace education in Hawaii.",
        "Reflection": "Kansas gave this family its American roots. Hawaii gave it wings. Indonesia gave it perspective."
      }
    },
    {
      "id": "branch-chicago-south-side",
      "name": "Chicago's South Side: The Robinson Legacy",
      "level": 3,
      "category": "branch",
      "subcategory": "robinson",
      "sort_order": 26,
      "composite_of": ["fraser-robinson-iii", "marian-shields-robinson", "michelle-obama", "craig-robinson"],
      "sections": {
        "Description": "The Robinson family represents the Great Migration story — African Americans who built new lives in northern cities. Fraser and Marian's South Side apartment on Euclid Avenue produced two Princeton graduates. The values forged there — work ethic, education, community, showing up — became the foundation of Michelle Obama's public mission and Craig Robinson's coaching philosophy.",
        "Reflection": "One apartment on Euclid Avenue. Two bedrooms. Two Princeton graduates. One First Lady. This is the South Side story."
      }
    },
    {
      "id": "branch-core-obama-family",
      "name": "The Obama White House Family",
      "level": 3,
      "category": "branch",
      "subcategory": "core-family",
      "sort_order": 27,
      "composite_of": ["barack-obama-ii", "michelle-obama", "malia-obama", "sasha-obama"],
      "sections": {
        "Description": "The core Obama family — Barack, Michelle, Malia, and Sasha — represented a new kind of American first family. A biracial president with Kenyan-Kansan roots, a First Lady descended from enslaved people, and two daughters who would grow up in the White House. Their eight years there (2009–2017) changed the image of American leadership. Now post-presidency, each is carving their own path: Barack through his foundation, Michelle through her books and podcast, Malia through film, and Sasha through her studies.",
        "Reflection": "They didn't just live in the White House — they expanded what Americans could imagine about who belongs there."
      }
    }
  ]
}