{
  "name": "Dhammapada",
  "description": "423 verses of Buddhist wisdom from the Pali canon, translated by F. Max Müller. Each verse is a contemplative oracle drawn from the Buddha's teachings on the mind, suffering, liberation, and the path. Organized across 26 chapters (vaggas) covering themes from duality and earnestness to the nature of self and the way of the sage.",
  "cover_image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Siddhartha_Gautama_Buddha_portrait.PNG",
  "tags": ["buddhism", "dhammapada", "pali-canon", "meditation", "wisdom", "ethics", "mindfulness", "liberation"],
  "grammar_type": "custom",
  "_category_roles": {
    "twin-verses": "card",
    "earnestness": "card",
    "thought": "card",
    "flowers": "card",
    "the-fool": "card",
    "the-wise": "card",
    "the-venerable": "card",
    "the-thousands": "card",
    "evil": "card",
    "punishment": "card",
    "old-age": "card",
    "self": "card",
    "the-world": "card",
    "the-buddha": "card",
    "happiness": "card",
    "pleasure": "card",
    "anger": "card",
    "impurity": "card",
    "the-just": "card",
    "the-way": "card",
    "miscellaneous": "card",
    "the-downward-course": "card",
    "the-elephant": "card",
    "thirst": "card",
    "the-bhikshu": "card",
    "the-brahmana": "card"
  },
  "creator_name": "F. Max Müller (translator)",
  "creator_link": "https://en.wikipedia.org/wiki/Max_M%C3%BCller",
  "attribution": {
    "source_name": "Dhammapada – The Sacred Books of the East, Vol. X",
    "source_url": "https://www.gutenberg.org/ebooks/2017",
    "license": "Public Domain",
    "license_url": "https://creativecommons.org/publicdomain/mark/1.0/",
    "note": "Translation by F. Max Müller (1881). Source text from Project Gutenberg eBook #2017. Artwork from Wikimedia Commons public domain collections."
  },
  "items": [
    {
      "id": "dhp-001",
      "name": "Verse 1 – The Wheel of Pain",
      "symbol": "☸",
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/Dharma_wheel.svg",
      "sections": {
        "Verse": "All that we are is the result of what we have thought: it is founded on our thoughts, it is made up of our thoughts. If a man speaks or acts with an evil thought, pain follows him, as the wheel follows the foot of the ox that draws the carriage.",
        "Interpretation": "Mind is the forerunner of all action. This verse establishes the central Buddhist teaching of karma as mental causation: unwholesome intention produces suffering as inevitably as a cartwheel tracks the ox. You are not punished for your anger — you are punished by your anger. What pattern of thought is pulling your cart today?",
        "Reversed": "Blaming external circumstances for inner pain. Refusing to see how your own thinking creates the rut you walk in. The wheel keeps turning because you keep stepping."
      },
      "keywords": ["karma", "mind", "suffering", "intention", "cause-and-effect"],
      "questions": ["What thought pattern is pulling pain behind it in your life right now?", "Where are you acting from reactivity rather than awareness?"],
      "sort_order": 1,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 1,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-002",
      "name": "Verse 2 – The Shadow of Joy",
      "symbol": "☀",
      "sections": {
        "Verse": "All that we are is the result of what we have thought: it is founded on our thoughts, it is made up of our thoughts. If a man speaks or acts with a pure thought, happiness follows him, like a shadow that never leaves him.",
        "Interpretation": "The twin of verse 1: where impure thought brings suffering, pure thought brings happiness as inseparably as your shadow. This is not moralism but observation — wholesome intention naturally produces well-being. Joy is not something you chase; it follows from the quality of your attention.",
        "Reversed": "Seeking happiness in possessions, status, or others' approval while neglecting the quality of your own mind. Looking everywhere for the shadow except at the body casting it."
      },
      "keywords": ["happiness", "purity", "mind", "intention", "well-being"],
      "questions": ["When has acting from genuine goodness brought you unexpected joy?", "What would it feel like to stop chasing happiness and let it follow you?"],
      "sort_order": 2,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 2,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-003",
      "name": "Verse 3 – The Grudge That Grows",
      "symbol": "⚔",
      "sections": {
        "Verse": "\"He abused me, he beat me, he defeated me, he robbed me,\" — in those who harbour such thoughts hatred will never cease.",
        "Interpretation": "The mind that rehearses grievances becomes a prison of its own making. Each replay of the injury freshens the wound and feeds the hatred. The Buddha does not say the harm was not real — he says the holding is the second arrow. The story you keep telling yourself is now hurting you more than the original event.",
        "Reversed": "Identifying so completely with victimhood that it becomes your identity. The grudge has become more familiar than freedom. You are now the jailer and the jailed."
      },
      "keywords": ["hatred", "resentment", "grudge", "rumination", "victimhood"],
      "questions": ["What old injury are you still replaying?", "Is the story you keep telling yourself still serving you, or has it become its own form of harm?"],
      "sort_order": 3,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 3,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-004",
      "name": "Verse 4 – Releasing the Story",
      "symbol": "🕊",
      "sections": {
        "Verse": "\"He abused me, he beat me, he defeated me, he robbed me,\" — in those who do not harbour such thoughts hatred will cease.",
        "Interpretation": "The twin release: the same events, the same words, but a different relationship to them. Not harbouring does not mean denying or condoning — it means refusing to let the past colonize the present. When you stop feeding the fire of resentment, it goes out on its own. This is not forgiveness as performance — it is forgiveness as freedom.",
        "Reversed": "Spiritual bypassing — pretending not to be hurt rather than genuinely releasing. Suppressing rather than transmuting. True release requires first acknowledging the wound."
      },
      "keywords": ["forgiveness", "release", "letting-go", "freedom", "peace"],
      "questions": ["What would your life look like if you truly stopped carrying this?", "Can you distinguish between suppressing pain and genuinely releasing it?"],
      "sort_order": 4,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 4,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-005",
      "name": "Verse 5 – The Old Rule",
      "symbol": "♡",
      "sections": {
        "Verse": "For hatred does not cease by hatred at any time: hatred ceases by love, this is an old rule.",
        "Interpretation": "Perhaps the most quoted verse of the Dhammapada. Hatred is a fire — pouring more hatred on it only makes it burn higher. Only the water of love (metta, loving-kindness) extinguishes it. This is not naive idealism but practical psychology: meeting aggression with aggression escalates; meeting it with compassion disarms. The Buddha calls this 'an old rule' — eternal, discovered anew in every generation.",
        "Reversed": "Using 'love conquers all' as a platitude to avoid setting boundaries. Love without wisdom becomes enabling. The old rule requires courage, not passivity."
      },
      "keywords": ["love", "hatred", "metta", "compassion", "non-violence"],
      "questions": ["Where in your life are you fighting fire with fire?", "What would it look like to respond to hostility with genuine compassion — not weakness, but strength?"],
      "sort_order": 5,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 5,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-006",
      "name": "Verse 6 – The End That Quiets",
      "symbol": "∞",
      "sections": {
        "Verse": "The world does not know that we must all come to an end here; — but those who know it, their quarrels cease at once.",
        "Interpretation": "Awareness of death is the great peacemaker. When you truly remember that you and everyone around you will die, petty disputes dissolve. This is not morbid — it is the deepest sanity. The monks who meditate in charnel grounds are not practicing pessimism; they are practicing perspective. What quarrel can survive the knowledge of impermanence?",
        "Reversed": "Using mortality as an excuse for nihilism or recklessness — 'nothing matters anyway.' The Buddha's point is the opposite: because time is short, don't waste it on conflict."
      },
      "keywords": ["impermanence", "death", "perspective", "quarrel", "peace"],
      "questions": ["If you knew you had one year to live, which of your current conflicts would you drop instantly?", "How would remembering death change the argument you are in right now?"],
      "sort_order": 6,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 6,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-007",
      "name": "Verse 7 – The Weak Tree",
      "symbol": "🌿",
      "sections": {
        "Verse": "He who lives looking for pleasures only, his senses uncontrolled, immoderate in his food, idle, and weak, Mara (the tempter) will certainly overthrow him, as the wind throws down a weak tree.",
        "Interpretation": "Mara — the Buddhist personification of temptation and distraction — needs no great power to topple someone with no roots. A life built entirely on sense pleasure has no anchor when the storms come. The weak tree is not evil; it is simply ungrounded. Without discipline, without purpose beyond the next pleasure, you become vulnerable to every passing wind.",
        "Reversed": "Excessive asceticism or guilt about enjoying life. The Buddha himself rejected extreme self-denial. The Middle Way includes pleasure — but not slavery to it."
      },
      "keywords": ["temptation", "discipline", "sense-pleasure", "weakness", "mara"],
      "questions": ["Where are you living on autopilot, driven by the next hit of comfort or stimulation?", "What wind would it take to knock you over right now?"],
      "sort_order": 7,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 7,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-008",
      "name": "Verse 8 – The Rocky Mountain",
      "symbol": "⛰",
      "sections": {
        "Verse": "He who lives without looking for pleasures, his senses well controlled, moderate in his food, faithful and strong, him Mara will certainly not overthrow, any more than the wind throws down a rocky mountain.",
        "Interpretation": "The twin of verse 7: same wind, different foundation. The person rooted in self-mastery — senses controlled, needs moderate, purpose clear — stands immovable. This is not rigidity but stability. A mountain does not fight the wind; it simply does not move. Strength here is not aggression but groundedness, the quiet power of someone who knows who they are.",
        "Reversed": "Mistaking stubbornness for strength. Being so rigid that you cannot bend, adapt, or receive. A mountain that cannot feel the wind is a statue, not a sage."
      },
      "keywords": ["strength", "discipline", "self-mastery", "stability", "groundedness"],
      "questions": ["What gives you your foundation — the thing that keeps you standing when everything shakes?", "Is your stability rooted in genuine self-knowledge, or in fear of change?"],
      "sort_order": 8,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 8,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-009",
      "name": "Verse 9 – The Stained Robe",
      "symbol": "○",
      "sections": {
        "Verse": "He who wishes to put on the yellow dress without having cleansed himself from sin, who disregards temperance and truth, is unworthy of the yellow dress.",
        "Interpretation": "The yellow (saffron) robe symbolizes the monastic path, but the teaching is universal: outer signs of virtue without inner transformation are a costume, not a commitment. Wearing the robes of wisdom while living in delusion is the deepest hypocrisy. The verse asks: are you living your values, or just performing them?",
        "Reversed": "Judging others' spiritual credentials while ignoring your own inconsistencies. Every tradition has gatekeepers who police appearances rather than cultivating depth."
      },
      "keywords": ["hypocrisy", "authenticity", "virtue", "sincerity", "practice"],
      "questions": ["Where are you wearing the costume of transformation without doing the inner work?", "What gap exists between what you profess and how you actually live?"],
      "sort_order": 9,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 9,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-010",
      "name": "Verse 10 – The Worthy Robe",
      "symbol": "●",
      "sections": {
        "Verse": "But he who has cleansed himself from sin, is well grounded in all virtues, and regards also temperance and truth, he is indeed worthy of the yellow dress.",
        "Interpretation": "The twin completion: when inner reality matches outer expression, the robe becomes sacred. Worthiness is not a title bestowed by others but a state of alignment between intention and action. The person who has done the work — cleansed, grounded, temperate, truthful — wears their commitments as naturally as their skin.",
        "Reversed": "Imposter syndrome — having done genuine work but feeling perpetually unworthy. Sometimes the cleansing is complete and you are allowed to own it."
      },
      "keywords": ["worthiness", "integrity", "alignment", "virtue", "truth"],
      "questions": ["Where in your life does your inner reality match your outer expression?", "Have you done enough work to trust yourself, and if so, can you own that?"],
      "sort_order": 10,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 10,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-011",
      "name": "Verse 11 – Truth in Untruth",
      "symbol": "◐",
      "sections": {
        "Verse": "They who imagine truth in untruth, and see untruth in truth, never arrive at truth, but follow vain desires.",
        "Interpretation": "Delusion is not simply ignorance — it is active misperception, seeing what is not there and missing what is. When you mistake comfort for truth, or dismiss uncomfortable truths as false, you build your life on sand. 'Vain desires' are not just material wants; they include the desire for reality to be other than it is. Clear seeing begins with the willingness to be wrong.",
        "Reversed": "Paralysis from radical skepticism — doubting everything until nothing is trustworthy. The verse warns against misperception, not against trust itself."
      },
      "keywords": ["delusion", "misperception", "truth", "discernment", "clarity"],
      "questions": ["What comfortable belief might you be mistaking for truth?", "Where are you refusing to see something because it would require you to change?"],
      "sort_order": 11,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 11,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-012",
      "name": "Verse 12 – Truth in Truth",
      "symbol": "◉",
      "sections": {
        "Verse": "They who know truth in truth, and untruth in untruth, arrive at truth, and follow true desires.",
        "Interpretation": "Clear seeing: recognizing things as they actually are. This is prajna — wisdom that cuts through confusion. When you can distinguish the real from the fabricated, your desires naturally align with reality. 'True desires' are not desires you suppress but desires that arise from seeing clearly. Right understanding leads to right aspiration. You want what is actually good for you.",
        "Reversed": "Weaponizing 'truth-telling' — using bluntness as cruelty. Knowing the truth is not the same as knowing when and how to speak it."
      },
      "keywords": ["wisdom", "clarity", "prajna", "discernment", "right-view"],
      "questions": ["What do you know to be true that you have been avoiding acting on?", "If you saw your situation with perfect clarity, what would you do differently?"],
      "sort_order": 12,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 12,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-013",
      "name": "Verse 13 – The Leaking Roof",
      "symbol": "⌂",
      "sections": {
        "Verse": "As rain breaks through an ill-thatched house, passion will break through an unreflecting mind.",
        "Interpretation": "The mind without mindfulness is an open invitation to every passing craving, fear, and obsession. 'Passion' here (raga) means not just lust but any overwhelming emotion that floods unchecked through consciousness. The thatching is not suppression but awareness — the careful, deliberate work of watching your own mind. Without that roof, every storm drenches you.",
        "Reversed": "Over-thatching: building so many defenses and walls that nothing gets through — not even genuine feeling, connection, or inspiration. A sealed house is also a prison."
      },
      "keywords": ["mindfulness", "awareness", "passion", "discipline", "vulnerability"],
      "questions": ["Where is your mental roof leaking — what overwhelms you because you haven't attended to it?", "What practice could you strengthen that would protect your peace of mind?"],
      "sort_order": 13,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 13,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-014",
      "name": "Verse 14 – The Sheltering Mind",
      "symbol": "⌇",
      "sections": {
        "Verse": "As rain does not break through a well-thatched house, passion will not break through a well-reflecting mind.",
        "Interpretation": "The reflective mind — one trained in meditation and self-awareness — does not prevent rain from falling. Cravings, fears, and provocations still arise. But they find no way in. The well-thatched house still hears the storm; it simply stays dry inside. This is equanimity: not the absence of difficulty but the presence of an unshakable inner shelter you have built through practice.",
        "Reversed": "Confusing detachment with dissociation. A well-thatched roof lets you hear the rain. If you feel nothing at all, you may have sealed yourself off rather than found peace."
      },
      "keywords": ["equanimity", "meditation", "reflection", "inner-peace", "practice"],
      "questions": ["What storms are you currently weathering well because of work you have done on yourself?", "How did you build the shelter you have — and where does it still need reinforcement?"],
      "sort_order": 14,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 14,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-015",
      "name": "Verse 15 – Mourning in Both Worlds",
      "symbol": "☽",
      "sections": {
        "Verse": "The evil-doer mourns in this world, and he mourns in the next; he mourns in both. He mourns and suffers when he sees the evil of his own work.",
        "Interpretation": "This is not divine punishment but natural consequence. The person who acts harmfully suffers twice: once from the external results, and once from the internal recognition of what they have done. Conscience is not optional — even the most hardened heart eventually confronts its own deeds. 'The next world' can be read literally or as the future self who inherits today's choices.",
        "Reversed": "Excessive guilt that becomes self-punishment rather than motivation to change. Mourning is meant to be a wake-up call, not a life sentence."
      },
      "keywords": ["regret", "conscience", "consequence", "karma", "suffering"],
      "questions": ["What past action still causes you grief when you remember it?", "Is your remorse motivating change, or has it become a form of self-punishment?"],
      "sort_order": 15,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 15,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-016",
      "name": "Verse 16 – Delight in Both Worlds",
      "symbol": "☼",
      "sections": {
        "Verse": "The virtuous man delights in this world, and he delights in the next; he delights in both. He delights and rejoices, when he sees the purity of his own work.",
        "Interpretation": "The mirror twin of verse 15: virtue brings its own reward, not as cosmic payment but as natural joy. When you look back at your actions and see integrity, the feeling is not pride but a quiet delight — muditā, sympathetic joy extended toward yourself. You can rest in the knowledge that your choices have been wholesome. This is the deepest form of self-respect.",
        "Reversed": "Self-righteousness disguised as virtue. Delighting in your own purity while looking down on others is not the joy the Buddha describes — it is spiritual vanity."
      },
      "keywords": ["virtue", "joy", "integrity", "mudita", "self-respect"],
      "questions": ["What actions can you look back on with genuine, quiet pride?", "Are you allowing yourself to feel the natural joy of having lived well?"],
      "sort_order": 16,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 16,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-017",
      "name": "Verse 17 – The Evil Path Deepens",
      "symbol": "↓",
      "sections": {
        "Verse": "The evil-doer suffers in this world, and he suffers in the next; he suffers in both. He suffers when he thinks of the evil he has done; he suffers more when going on the evil path.",
        "Interpretation": "A deepening of verse 15: not only does the wrongdoer suffer from past misdeeds, but continuing on the same path intensifies the suffering. This is the compounding nature of harmful habits — each repetition makes the next easier and the consequences heavier. The verb 'going on' is crucial: it is the continuation, not just the past act, that compounds the pain.",
        "Reversed": "Fatalism — believing that because you have done harm, you are now 'on the evil path' and cannot leave it. Every moment offers a new choice. The path only deepens if you keep walking it."
      },
      "keywords": ["habit", "compounding", "evil", "continuation", "suffering"],
      "questions": ["Where are you continuing a pattern you already know causes suffering?", "What would it take to step off a path you are on, even mid-stride?"],
      "sort_order": 17,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 17,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-018",
      "name": "Verse 18 – The Good Path Brightens",
      "symbol": "↑",
      "sections": {
        "Verse": "The virtuous man is happy in this world, and he is happy in the next; he is happy in both. He is happy when he thinks of the good he has done; he is still more happy when going on the good path.",
        "Interpretation": "The positive mirror: virtue compounds just as vice does, but toward joy instead of suffering. Each wholesome act makes the next more natural, and the cumulative effect is a deepening happiness. 'Still more happy when going on the good path' — the direction matters more than any single act. A life of increasing goodness builds its own momentum, like a river finding its way downhill.",
        "Reversed": "Resting on past good deeds while the present goes unattended. The path brightens only while you walk it. Yesterday's virtue does not substitute for today's intention."
      },
      "keywords": ["virtue", "momentum", "happiness", "growth", "path"],
      "questions": ["In what area of your life is goodness building on itself, gaining natural momentum?", "Are you walking the good path today, or remembering a path you walked before?"],
      "sort_order": 18,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 18,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-019",
      "name": "Verse 19 – The Cowherd",
      "symbol": "𑀥",
      "sections": {
        "Verse": "The thoughtless man, even if he can recite a large portion (of the law), but is not a doer of it, has no share in the priesthood, but is like a cowherd counting the cows of others.",
        "Interpretation": "Knowledge without practice is borrowed wealth. You can memorize every sutra, quote every teacher, and understand every doctrine — and still be a cowherd counting someone else's cattle. The Dharma is not an intellectual exercise; it is a lived reality. This verse is a warning to scholars, teachers, and spiritual seekers who mistake accumulation of knowledge for transformation.",
        "Reversed": "Anti-intellectualism — dismissing study and learning as merely 'counting cows.' The Buddha valued both understanding and practice. The problem is not knowledge but knowledge without application."
      },
      "keywords": ["practice", "knowledge", "hypocrisy", "embodiment", "dharma"],
      "questions": ["What teaching do you know deeply but have not yet lived?", "Are you studying the path or walking it?"],
      "sort_order": 19,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 19,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    },
    {
      "id": "dhp-020",
      "name": "Verse 20 – The Practitioner",
      "symbol": "☸",
      "image_url": "https://commons.wikimedia.org/wiki/Special:FilePath/TangBodhisattva.JPG",
      "sections": {
        "Verse": "The follower of the law, even if he can recite only a small portion (of the law), but, having forsaken passion and hatred and foolishness, possesses true knowledge and serenity of mind, he, caring for nothing in this world or that to come, has indeed a share in the priesthood.",
        "Interpretation": "The chapter's culminating verse and the twin completion of verse 19: a single verse lived is worth more than a thousand recited. The true practitioner may know little scripture but has forsaken the three poisons — greed, hatred, and delusion — and rests in serenity. 'Caring for nothing' is not nihilism but non-attachment: free from clinging to outcomes in this life or any imagined next.",
        "Reversed": "Using 'I don't need to study' as an excuse for ignorance. The verse praises the practitioner who knows even a small portion — implying they did engage with the teachings, however briefly."
      },
      "keywords": ["practice", "non-attachment", "serenity", "three-poisons", "liberation"],
      "questions": ["What single teaching have you truly taken into your bones?", "What would it feel like to care deeply about your path but not about the outcome?"],
      "sort_order": 20,
      "category": "twin-verses",
      "metadata": {
        "verse_number": 20,
        "chapter": 1,
        "chapter_name": "The Twin Verses",
        "pali_name": "Yamakavagga",
        "translator": "F. Max Müller"
      }
    }
  ]
}
