{
  "name": "Ptolemy's Tetrabiblos",
  "description": "Classical Western astrology based on Claudius Ptolemy's Tetrabiblos (c. 150 CE), the foundational text that systematized Greek, Egyptian, and Babylonian astrological knowledge.",
  "grammar_type": "astrology",
  "attribution": {
    "source_name": "Tetrabiblos, or Quadripartite",
    "source_author": "Claudius Ptolemy",
    "translator": "J.M. Ashmand",
    "source_year": "c. 150 CE (translation 1822)",
    "license": "Public Domain",
    "source_url": "https://www.gutenberg.org/ebooks/70850"
  },
  "interpretations": [
    {
      "type": "planet",
      "planet": "Saturn",
      "story": "Saturn's star is productive of cold, and is moderately drying; probably deriving its influence from being most remote both from the heating power of the Sun, and from the moistening vapours of the Earth. Known to the Greeks as Kronos, Saturn is the Greater Malefic, ruling over time, limitation, and the hard lessons of experience.",
      "light": "Patience, discipline, wisdom through experience, mastery over time, endurance, ancestral connection, material foundations",
      "shadow": "Obstruction, delay, melancholy, poverty, coldness, restriction, death, the weight of age and duty",
      "keywords": ["cold", "dry", "malefic", "slow", "elder", "discipline", "time", "limitation"],
      "sort_order": 0
    },
    {
      "type": "planet",
      "planet": "Jupiter",
      "story": "Jupiter's star is temperate, being placed between the cold of Saturn and the heat of Mars; and is therefore productive of heat and moisture together. But, because its heating power is greater, it produces fertilizing winds. Known to the Greeks as Zeus, Jupiter is the Greater Benefic, bringing abundance and expansion.",
      "light": "Abundance, growth, religion, philosophy, law, wealth, generosity, honor, children, expansion, good fortune",
      "shadow": "Excess, overindulgence, blind optimism, arrogance through success, scattered expansion without foundation",
      "keywords": ["hot", "moist", "benefic", "temperate", "fertile", "abundance", "expansion", "fortune"],
      "sort_order": 1
    },
    {
      "type": "planet",
      "planet": "Mars",
      "story": "Mars's star is chiefly productive of dryness, and is also strongly heating, from its fiery nature, which is indicated by its colour, and its proximity to the Sun. Known to the Greeks as Ares, Mars is the Lesser Malefic, governing conflict, courage, and the vital force of action.",
      "light": "Courage, strength, decisive action, protection, surgical precision, masculine energy, the will to overcome",
      "shadow": "War, conflict, violence, fever, wounds, destruction, separation, aggression without purpose",
      "keywords": ["hot", "dry", "malefic", "fiery", "martial", "war", "courage", "iron"],
      "sort_order": 2
    },
    {
      "type": "planet",
      "planet": "Sun",
      "story": "The Sun's nature is found to be heating and moderately drying. This is more easily perceived in regard to the Sun than to the other heavenly bodies, both by reason of its magnitude and of its evident alterations of the seasons. Known to the Greeks as Helios, the Sun is the source of life, vitality, and conscious purpose.",
      "light": "Life force, vitality, the soul, authority, honor, gold, the heart, success, daylight consciousness, self-expression",
      "shadow": "Pride, excessive self-focus, burnout, tyranny of the ego, blindness to others",
      "keywords": ["hot", "dry", "benefic", "vital", "royal", "gold", "heart", "authority"],
      "sort_order": 3
    },
    {
      "type": "planet",
      "planet": "Venus",
      "story": "Venus has the same influence as Jupiter, and is also temperate in her effect: but she acts contrariwise, for she is moistening rather than heating, in consequence of her proximity to the moisture derived from the Earth, as well as from the Moon. Known to the Greeks as Aphrodite, Venus is the Lesser Benefic, ruling love, beauty, and pleasure.",
      "light": "Love, beauty, pleasure, art, marriage, harmony, jewels, ornaments, peace, fertility, connection",
      "shadow": "Vanity, excessive pleasure-seeking, superficiality, dependency on external validation",
      "keywords": ["moist", "warm", "benefic", "temperate", "love", "beauty", "pleasure", "harmony"],
      "sort_order": 4
    },
    {
      "type": "planet",
      "planet": "Mercury",
      "story": "Mercury, at certain times, produces drying, and at other times moisture; and each effect is equally powerful. His nature is convertible, and is regulated by his position with regard to the Sun; for he is drying when in the oriental quarter, and moistening when in the occidental. Known to the Greeks as Hermes, Mercury governs communication, intellect, and exchange.",
      "light": "Communication, commerce, writing, intellect, speech, reason, calculation, versatility, learning",
      "shadow": "Trickery, theft, dishonesty, scattered thinking, nervous energy, superficial knowledge",
      "keywords": ["variable", "neutral", "convertible", "intellect", "commerce", "messenger", "communication"],
      "sort_order": 5
    },
    {
      "type": "planet",
      "planet": "Moon",
      "story": "The Moon chiefly exercises a moistening influence, evidently because she is near to the Earth and on account of the moisture which she collects from the vapours rising from it. Her heating power is also moderately active, in consequence of the light she receives from the Sun. Known to the Greeks as Selene, the Moon governs the body, emotions, and the rhythms of change.",
      "light": "The body, mothers, the public, fertility, receptivity, memory, nurturing, emotional intelligence",
      "shadow": "Changeability, moodiness, dependency, loss through fluctuation, confusion, emotional overwhelm",
      "keywords": ["moist", "cold", "neutral", "changeable", "receptive", "body", "mother", "public"],
      "sort_order": 6
    },
    {
      "type": "sign",
      "sign": "Aries",
      "story": "Aries and Scorpio, being the houses of Mars, have an affinity to the fiery influence, to destruction by burning, and to murder. In Aries especially are indicated, with respect to the body, the head and the face. As the first sign at the Spring equinox, Aries initiates the zodiacal year with cardinal fire.",
      "light": "Initiative, courage, pioneering spirit, direct action, new beginnings, leadership, vital energy",
      "shadow": "Impulsiveness, aggression, impatience, self-centeredness, destructive force",
      "keywords": ["fire", "cardinal", "masculine", "Mars", "head", "initiative", "spring"],
      "sort_order": 10
    },
    {
      "type": "sign",
      "sign": "Taurus",
      "story": "Taurus and Libra, the houses of Venus, are indicative of elegance and of attention to the person. In Taurus especially are signified the neck and the throat. As fixed earth in mid-spring, Taurus consolidates and stabilizes what Aries has initiated.",
      "light": "Stability, sensuality, material abundance, patience, artistic appreciation, endurance, loyalty",
      "shadow": "Stubbornness, possessiveness, materialism, resistance to change, indulgence",
      "keywords": ["earth", "fixed", "feminine", "Venus", "neck", "stability", "spring"],
      "sort_order": 11
    },
    {
      "type": "sign",
      "sign": "Gemini",
      "story": "Gemini and Virgo, the houses of Mercury, are significative of the pursuit of learning and of science. In Gemini especially are indicated the shoulders and the arms. As mutable air in late spring, Gemini distributes and communicates knowledge.",
      "light": "Communication, versatility, intellectual curiosity, wit, adaptability, connection, learning",
      "shadow": "Superficiality, inconsistency, nervousness, duplicity, scattered attention",
      "keywords": ["air", "mutable", "masculine", "Mercury", "arms", "communication", "spring"],
      "sort_order": 12
    },
    {
      "type": "sign",
      "sign": "Cancer",
      "story": "Cancer, the house of the Moon, is indicative of all changeable and mutable circumstances. In Cancer especially are signified the breast and the stomach. At the Summer solstice, Cancer marks the point of maximum light and the beginning of its waning.",
      "light": "Nurturing, emotional depth, home and family, protection, memory, intuition, fertility",
      "shadow": "Moodiness, over-sensitivity, clinging, defensiveness, living in the past",
      "keywords": ["water", "cardinal", "feminine", "Moon", "breast", "nurturing", "summer"],
      "sort_order": 13
    },
    {
      "type": "sign",
      "sign": "Leo",
      "story": "Leo, the house of the Sun, is indicative of royalty, of command, and of authority. In Leo especially are signified the sides, the heart, and the back. As fixed fire in mid-summer, Leo embodies the peak of solar power and creative self-expression.",
      "light": "Leadership, creativity, generosity, warmth, dignity, self-expression, courage, nobility",
      "shadow": "Arrogance, vanity, domination, need for constant admiration, dramatic excess",
      "keywords": ["fire", "fixed", "masculine", "Sun", "heart", "royalty", "summer"],
      "sort_order": 14
    },
    {
      "type": "sign",
      "sign": "Virgo",
      "story": "Virgo, having Mercury as its ruler, signifies reason, discrimination, and service. In Virgo especially are indicated the belly and the intestines. As mutable earth in late summer, Virgo harvests, analyzes, and refines.",
      "light": "Analysis, discernment, service, healing, craftsmanship, practical wisdom, purity",
      "shadow": "Criticism, perfectionism, worry, hypochondria, excessive analysis paralysis",
      "keywords": ["earth", "mutable", "feminine", "Mercury", "belly", "service", "harvest"],
      "sort_order": 15
    },
    {
      "type": "sign",
      "sign": "Libra",
      "story": "Libra, the house of Venus, is indicative of justice, of balance, and of partnership. In Libra especially are signified the hips and the lower belly. At the Autumn equinox, Libra marks the balance point between light and dark.",
      "light": "Balance, harmony, partnership, justice, diplomacy, aesthetic refinement, relationship",
      "shadow": "Indecision, dependency, superficiality, conflict avoidance, loss of self in other",
      "keywords": ["air", "cardinal", "masculine", "Venus", "hips", "balance", "autumn"],
      "sort_order": 16
    },
    {
      "type": "sign",
      "sign": "Scorpio",
      "story": "Scorpio, the nocturnal house of Mars, is indicative of death, regeneration, and hidden matters. In Scorpio especially are signified the generative organs. As fixed water in mid-autumn, Scorpio probes the depths and transforms through crisis.",
      "light": "Transformation, depth, regeneration, psychological insight, power, loyalty, healing through crisis",
      "shadow": "Jealousy, manipulation, obsession, destructiveness, secrecy, vengefulness",
      "keywords": ["water", "fixed", "feminine", "Mars", "regeneration", "depth", "autumn"],
      "sort_order": 17
    },
    {
      "type": "sign",
      "sign": "Sagittarius",
      "story": "Sagittarius and Pisces, the houses of Jupiter, are indicative of reverence for the gods, of religion, and of philosophy. In Sagittarius especially are signified the thighs. As mutable fire in late autumn, Sagittarius expands vision and seeks higher meaning.",
      "light": "Philosophy, expansion, adventure, optimism, truth-seeking, freedom, higher learning, faith",
      "shadow": "Excess, dogmatism, restlessness, tactlessness, over-promising, escapism",
      "keywords": ["fire", "mutable", "masculine", "Jupiter", "thighs", "philosophy", "autumn"],
      "sort_order": 18
    },
    {
      "type": "sign",
      "sign": "Capricorn",
      "story": "Capricorn and Aquarius, the houses of Saturn, are indicative of toil, of discipline, and of restriction. In Capricorn especially are signified the knees. At the Winter solstice, Capricorn marks the point of maximum darkness and the return of light.",
      "light": "Ambition, discipline, structure, mastery, responsibility, achievement, endurance, authority",
      "shadow": "Coldness, rigidity, excessive control, pessimism, workaholism, status obsession",
      "keywords": ["earth", "cardinal", "feminine", "Saturn", "knees", "ambition", "winter"],
      "sort_order": 19
    },
    {
      "type": "sign",
      "sign": "Aquarius",
      "story": "Aquarius, the diurnal house of Saturn, is indicative of community, of humanity, and of innovation within boundaries. In Aquarius especially are signified the legs and ankles. As fixed air in mid-winter, Aquarius consolidates ideas and envisions new social orders.",
      "light": "Innovation, humanity, friendship, idealism, independence, originality, social vision",
      "shadow": "Detachment, eccentricity, rebellion without cause, emotional coldness, aloofness",
      "keywords": ["air", "fixed", "masculine", "Saturn", "ankles", "innovation", "winter"],
      "sort_order": 20
    },
    {
      "type": "sign",
      "sign": "Pisces",
      "story": "Pisces, the nocturnal house of Jupiter, is indicative of completion, dissolution, and spiritual matters. In Pisces especially are signified the feet. As mutable water in late winter, Pisces dissolves boundaries and prepares for new beginnings.",
      "light": "Compassion, spirituality, imagination, transcendence, artistic vision, unity, healing",
      "shadow": "Escapism, confusion, victimhood, addiction, boundary dissolution, martyrdom",
      "keywords": ["water", "mutable", "feminine", "Jupiter", "feet", "dissolution", "winter"],
      "sort_order": 21
    },
    {
      "type": "house",
      "house": 1,
      "story": "The angle of the east, called the Ascendant or Horoscope (Greek: Horoskopos), signifies life itself, the soul, the body, and its constitution. As an angular house, planets here are most powerful and visible in their effects.",
      "light": "Self-identity, physical vitality, personal initiative, new beginnings, the body as vehicle",
      "shadow": "Self-absorption, over-identification with appearance, difficulty seeing beyond self",
      "keywords": ["angular", "life", "body", "ascendant", "self", "appearance", "beginnings"],
      "sort_order": 30
    },
    {
      "type": "house",
      "house": 2,
      "story": "The place which follows the Ascendant (Greek: Gate of Hades) pertains to livelihood and possessions. As a succedent house, it supports and sustains what the first house initiates.",
      "light": "Resources, material security, values, self-worth, sustenance, what we build",
      "shadow": "Greed, material attachment, insecurity about worth, poverty consciousness",
      "keywords": ["succedent", "possessions", "wealth", "resources", "values", "sustenance"],
      "sort_order": 31
    },
    {
      "type": "house",
      "house": 3,
      "story": "The place of the Goddess (Greek: Thea) pertains to brothers, kindred, and short journeys. As a cadent house, it prepares for the angular fourth house.",
      "light": "Communication, siblings, neighbors, learning, local travel, mental agility, writing",
      "shadow": "Gossip, scattered thinking, sibling rivalry, nervous anxiety, superficial knowledge",
      "keywords": ["cadent", "kindred", "communication", "short journeys", "siblings", "learning"],
      "sort_order": 32
    },
    {
      "type": "house",
      "house": 4,
      "story": "The angle beneath the Earth, called the Subterranean (Greek: Hypogeion), pertains to parents, ancestors, foundations, lands, and the end of matters. The IC marks midnight and the deepest point of the chart.",
      "light": "Roots, home, family, ancestry, emotional foundation, private life, inner security",
      "shadow": "Family wounds, rootlessness, inability to leave the past, buried emotions",
      "keywords": ["angular", "parents", "ancestry", "home", "foundations", "endings", "IC"],
      "sort_order": 33
    },
    {
      "type": "house",
      "house": 5,
      "story": "The place of Good Fortune pertains to children, pleasure, and creative works. As a succedent house supporting the fourth, it expresses what roots have established.",
      "light": "Creativity, children, romance, pleasure, self-expression, play, speculation, joy",
      "shadow": "Gambling addiction, narcissistic creativity, using children for ego, empty pleasures",
      "keywords": ["succedent", "children", "pleasure", "creativity", "romance", "play"],
      "sort_order": 34
    },
    {
      "type": "house",
      "house": 6,
      "story": "The place of Bad Fortune pertains to illness, servants, and small animals. As a cadent house, it prepares through service and health for the relationship axis.",
      "light": "Service, health practices, daily work, skill refinement, healing, useful labor",
      "shadow": "Illness, servitude, drudgery, health anxiety, perfectionism, feeling unworthy",
      "keywords": ["cadent", "sickness", "servants", "labor", "health", "service", "daily work"],
      "sort_order": 35
    },
    {
      "type": "house",
      "house": 7,
      "story": "The angle of the west, called the Setting or Descendant (Greek: Dysis), pertains to marriage, partnerships, and open enemies. Opposite the Ascendant, it represents the Other.",
      "light": "Partnership, marriage, collaboration, contracts, the complementary other, justice",
      "shadow": "Projection onto others, open enemies, loss of self in relationship, dependency",
      "keywords": ["angular", "marriage", "partnership", "enemies", "descendant", "other"],
      "sort_order": 36
    },
    {
      "type": "house",
      "house": 8,
      "story": "The place following the Descendant (Greek: Idle Place) pertains to death, inheritance, and the goods of the dead. As a succedent house, it deepens the seventh house commitments.",
      "light": "Transformation, shared resources, intimacy, inheritance, psychological depth, regeneration",
      "shadow": "Death anxiety, fear, manipulation through resources, obsession, debt",
      "keywords": ["succedent", "death", "inheritance", "transformation", "shared resources"],
      "sort_order": 37
    },
    {
      "type": "house",
      "house": 9,
      "story": "The place of God pertains to religion, philosophy, long journeys, and divination. As a cadent house, it expands consciousness toward the Midheaven.",
      "light": "Philosophy, higher education, long journeys, religion, truth-seeking, wisdom, law",
      "shadow": "Dogmatism, escapist travel, spiritual bypassing, arrogance of belief",
      "keywords": ["cadent", "religion", "philosophy", "long journeys", "divination", "wisdom"],
      "sort_order": 38
    },
    {
      "type": "house",
      "house": 10,
      "story": "The angle of the south, called the Midheaven or Culmination (Greek: Mesouranema), pertains to actions, profession, reputation, and authority. The MC marks noon and the most visible point.",
      "light": "Career, public reputation, achievement, authority, calling, contribution to society",
      "shadow": "Status obsession, empty ambition, workaholism, public disgrace, loss of reputation",
      "keywords": ["angular", "profession", "reputation", "honors", "authority", "midheaven"],
      "sort_order": 39
    },
    {
      "type": "house",
      "house": 11,
      "story": "The place of the Good Spirit pertains to friends, hopes, and benefactors. As a succedent house supporting the tenth, it gathers the community around our public role.",
      "light": "Friends, community, hopes, benefactors, social ideals, group participation, future vision",
      "shadow": "False friends, misplaced hopes, groupthink, loss of individuality in collective",
      "keywords": ["succedent", "friends", "hopes", "benefactors", "community", "future"],
      "sort_order": 40
    },
    {
      "type": "house",
      "house": 12,
      "story": "The place of the Bad Spirit pertains to enemies, imprisonment, large animals, and self-undoing. As a cadent house before the Ascendant, it dissolves the old self before rebirth.",
      "light": "Solitude, spiritual retreat, compassion, transcendence, release of ego, hidden strengths",
      "shadow": "Hidden enemies, self-undoing, imprisonment, sorrow, exile, addiction, unconscious patterns",
      "keywords": ["cadent", "enemies", "imprisonment", "sorrow", "self-undoing", "hidden"],
      "sort_order": 41
    },
    {
      "type": "aspect",
      "aspect": "Conjunction",
      "story": "When stars are in the same degree, they unite their powers, whether for good or ill, according to the nature of the stars involved. The conjunction is the most powerful aspect, creating fusion and intensification.",
      "light": "Unity, fusion, intensification, new beginnings, concentrated power, synthesis",
      "shadow": "Overwhelm, loss of distinction, blind spots, excessive intensity",
      "keywords": ["0 degrees", "union", "fusion", "variable", "intensity", "beginning"],
      "sort_order": 50
    },
    {
      "type": "aspect",
      "aspect": "Sextile",
      "story": "The sextile, comprehending two signs (60 degrees), is considered friendly, as signs in sextile share the same gender but differ in element, producing harmony through difference.",
      "light": "Opportunity, cooperation, compatible exchange, ease, talent, friendly connection",
      "shadow": "Missed opportunities through complacency, superficial harmony, unrealized potential",
      "keywords": ["60 degrees", "benefic", "harmony", "opportunity", "compatible"],
      "sort_order": 51
    },
    {
      "type": "aspect",
      "aspect": "Square",
      "story": "The square, comprehending three signs (90 degrees), is considered inharmonious and discordant, as signs in square share the same modality but are of contrary elements.",
      "light": "Dynamic tension, motivation for change, strength through challenge, crisis that builds character",
      "shadow": "Conflict, obstacles, frustration, internal tension, external opposition",
      "keywords": ["90 degrees", "malefic", "tension", "conflict", "challenge", "action"],
      "sort_order": 52
    },
    {
      "type": "aspect",
      "aspect": "Trine",
      "story": "The trine, comprehending four signs (120 degrees), is considered most harmonious and beneficial, as signs in trine share the same element and thus the same essential nature.",
      "light": "Harmony, ease, blessing, natural flow, talent, grace, support, abundance",
      "shadow": "Complacency, taking gifts for granted, laziness, unfulfilled potential",
      "keywords": ["120 degrees", "benefic", "harmony", "ease", "blessing", "flow"],
      "sort_order": 53
    },
    {
      "type": "aspect",
      "aspect": "Opposition",
      "story": "The opposition, comprehending six signs (180 degrees), produces disharmony through complete separation, as opposing signs are furthest apart and thus contrary in influence.",
      "light": "Awareness through polarity, relationship, balance, completion, objectivity, integration",
      "shadow": "Projection, external conflict, relationship tension, feeling torn, polarization",
      "keywords": ["180 degrees", "malefic", "polarity", "awareness", "separation", "other"],
      "sort_order": 54
    }
  ]
}
