{
  "name": "Royal Ballet and Opera",
  "description": "",
  "cover_image_url": "",
  "tags": [],
  "grammar_type": "custom",
  "items": [
    {
      "id": "yt-hLfvkwTnJVM",
      "name": "An introduction to opera's voice types (The Royal Opera)",
      "sort_order": 1,
      "image_url": "https://i.ytimg.com/vi/hLfvkwTnJVM/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "A selection of singers share their skills from the lowest voice type to the highest, demonstrating the power of the bass, baritone, tenor, mezzo-soprano, countertenor and soprano voices."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=hLfvkwTnJVM",
        "youtube_video_id": "hLfvkwTnJVM",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 357
      },
      "level": 1
    },
    {
      "id": "yt-V9CYkJmlG8k",
      "name": "Vocal tips for opera singers: Joyce DiDonato Masterclass in full (The Royal Opera)",
      "sort_order": 2,
      "image_url": "https://i.ytimg.com/vi/V9CYkJmlG8k/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "World renowned mezzo-soprano Joyce DiDonato gives a vocal masterclass with artists from the National Opera Studio as part of the Royal Opera House Insights series. Find out more at http://www.roh.org.uk\n\nAmerican mezzo-soprano Joyce DiDonato made her Royal Opera debut in 2003 as Fox (The Cunning Little Vixen), and has since returned to sing Rosina (Il barbiere di Siviglia), Donna Elvira (Don Giovanni, including on tour with The Royal Opera to Japan), Cendrillon, Elena (La donna del lago), Maria Stuarda, Charlotte (Werther) and in Plácido Domingo’s 2012 Operalia concert. She returns in the 2017/18 Season to sing Semiramide and in a main-stage recital with Antonio Pappano.\n\nDiDonato grew up in Kansas and studied music education at Wichita State University and singing at the Academy of Vocal Arts, Philadelphia, on the Santa Fe Opera’s Apprentice Singer Program (1995) and on San Francisco Opera’s Merola Young Artists Program (1997). She won second prize in Operalia in 1998 and has gone on to win international acclaim in bel canto and other repertories. Engagements include Composer (Ariadne auf Naxos), Sycorax (The Enchanted Island), Angelina (La Cenerentola), Isolier (Le Comte Ory) and Maria Stuarda for the Metropolitan Opera, New York, Cendrillon for the Liceu, Barcelona, Rosina for Vienna State Opera, Octavian (Der Rosenkavalier) for La Scala, Milan, Idamante (Idomeneo) for Paris Opéra and Edinburgh Festival, Elena for Paris Opéra and Santa Fe Festival and Sister Helen Prejean (Heggie’s Dead Man Walking), Béatrice (Béatrice et Bénédict) for Houston Grand Opera, Romeo (I Capuleti e i Montecchi) in concert for Deutsche Oper Berlin and Didon (Les Troyens) with Strasbourg Philharmonic Orchestra.\n\nDiDonato appears regularly at the world’s leading concert halls and sang at the 2013 BBC Last Night of the Proms. Her wide discography includes seven solo albums. She was the 2010 Gramophone Artist of the Year, won a Grammy Award for Best Classical Vocal Solo in 2012 and in 2015 won Female Singer of the Year at the ECHO Klassik Awards."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=V9CYkJmlG8k",
        "youtube_video_id": "V9CYkJmlG8k",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 6410
      },
      "level": 1
    },
    {
      "id": "yt-unIaEe0Nw88",
      "name": "Joyce DiDonato vocal Masterclass (The Royal Opera)",
      "sort_order": 3,
      "image_url": "https://i.ytimg.com/vi/unIaEe0Nw88/hqdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "International mezzo-soprano Joyce DiDonato coaches the next generation of opera talent from The National Opera Studio. With Rachel Kelly (mezzo soprano) and Jesse Wong (piano) performing Naqui all'affanno... non più mesta from Rossini's La Cenerentola.\n\nwww.roh.org.uk/insights\nwww.nationaloperastudio.org.uk"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=unIaEe0Nw88",
        "youtube_video_id": "unIaEe0Nw88",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 1131
      },
      "level": 1
    },
    {
      "id": "yt-F__t5eOSdm4",
      "name": "A Vocal Masterclass with Antonio Pappano and Jonas Kaufmann  (The Royal Opera)",
      "sort_order": 4,
      "image_url": "https://i.ytimg.com/vi/F__t5eOSdm4/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Antonio Pappano explores Giordano's Andrea Chénier score, identifies where the challenges are and offers vocals tips. Find out more at http://www.roh.org.uk/productions/andrea-chenier-by-david-mcvicar\n\nThe Music Director of The Royal Opera works with Jonas Kaufmann and Eva-Maria Westbroek in this clip, broadcast as part of the live cinema relay of David McVicar's production on 29 January 2015. \n\nThe premiere of Andrea Chénier at La Scala, Milan, on 28 March 1896 propelled the young Umberto Giordano to the front rank of the giovane scuola (an up-and-coming group of young Italian composers that included Puccini and Mascagni). The opera exemplifies the verismo style that dominated Italian opera of the period – nowhere more so than in Giordano's skilful interpolation of different musical styles to provide local colour, from the aristocratic Gavotte of Act I to the Marseillaise in Act IV. The libretto by Luigi Illica (Puccini’s collaborator for Manon Lescaut, La bohème, Tosca and Madama Butterfly) was inspired by the real-life Romantic poet André Chénier, who was guillotined just three days before Robespierre's execution.\n\nAndrea Chénier has become celebrated for the lyrical music it offers the tenor who takes the leading role, with the off-the-cuff Improvviso of Act I and his final aria 'Come un bel dì di maggio' particular highlights. But there are thrilling moments for the whole cast, including Maddalena's ardent aria 'La mamma morta', Gérard’s 'Nemico della patria!’ and a host of dramatic duets and characterful ensembles. David McVicar (whose productions for The Royal Opera include Le nozze di Figaro, Faust and Die Zauberflöte) directs The Royal Opera's new production, moving from the opulence of pre-Revolutionary France to the horrors of the Reign of Terror."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=F__t5eOSdm4",
        "youtube_video_id": "F__t5eOSdm4",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 275
      },
      "level": 1
    },
    {
      "id": "yt-d6LhsGphiwY",
      "name": "How to sing Rossini with Mark Elder (The Royal Opera)",
      "sort_order": 5,
      "image_url": "https://i.ytimg.com/vi/d6LhsGphiwY/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Conductor Mark Elder and mezzo-soprano Rachel Kelly explore the music of Rossini through Il barbiere di Siviglia (The Barber of Seville).\nFind out more at http://www.roh.org.uk/barbiere\n\nThe 23-year-old Gioachino Rossini completed his masterpiece Il barbiere di Siviglia incredibly quickly – legend has it in just 13 days – which Rossini attributed to ‘facility and lots of instinct’. He drew on Pierre-Augustin Beaumarchais’ play Le Barbier de Seville – part of a dramatic trilogy that also inspired Mozart’s Le nozze di Figaro.\n\nIl barbiere di Siviglia has all the ingredients for comic chaos: an imprisoned young woman, her lecherous guardian and a young noble suitor. Skilfully plotting behind the scenes is Figaro – an irrepressible and inventive character in whom many have seen a resemblance to the young Rossini himself. The score fizzes with musical brilliance, from Figaro’s famous entrance aria ‘Largo al factotum’ to the frenzy of the Act I finale, when the five principal voices pile on top of each other. Within a few decades of its 1816 premiere, Il barbiere di Siviglia had been toured round the world, reaching opera houses in New York, Buenos Aires, Trinidad and Ecuador. It has remained one of the most prominent and popular operas in the repertory."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=d6LhsGphiwY",
        "youtube_video_id": "d6LhsGphiwY",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 1065
      },
      "level": 1
    },
    {
      "id": "yt-9SFUeOpfSNE",
      "name": "How to sing opera with Lisette Oropesa - Royal Opera Masterclass",
      "sort_order": 6,
      "image_url": "https://i.ytimg.com/vi/9SFUeOpfSNE/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Join internationally-renowned soprano Lisette Oropesa for a Royal Opera Masterclass featuring her coaching members of the Company's Jette Parker Young Artist Programme. Subscribe to our channel to watch more Masterclass sessions with some of the world's top singers.\n\nOropesa grew up in Baton Rouge, Louisiana, and initially trained as a flautist before studying voice at Louisiana State University. She was a winner of the Metropolitan Opera’s National Council Auditions grand finals and subsequently became a member of the Lindemann Young Artist Development Program. Since leaving the Program in 2008 she has returned to the Metropolitan Opera in roles including Nannetta (Falstaff), Sophie (Werther), Susanna (Le nozze di Figaro) and Gilda (Rigoletto). Engagements elsewhere include Konstanze (Die Entführung aus dem Serail) for Bavarian State Opera and Paris Opéra, Norina (Don Pasquale) for Glyndebourne Festival, Ophélie (Hamlet) in Lausanne, Susanna and Marie (La Fille du régiment) for Washington National Opera, Romilda (Serse) and Susanna for San Francisco Opera, Gilda for Rome Opera, Grand Théâtre de Genève, Dutch National Opera, Teatro Real, Madrid, and at the Amsterdam Concertgebouw, Violetta (La traviata) for Opera Philadelphia and Rosalba (Catán’s Florencia en el Amazonas) for Los Angeles Opera.\n\nOropesa’s concert appearances include Carmina Burana with Chicago Symphony Orchestra and Riccardo Muti, Pittsburgh Symphony Orchestra and Cleveland Orchestra, performances with the Orchestra dell’Accademia Nazionale di Santa Cecilia and the Philadelphia Orchestra and Brahms’s Liebeslieder Walzer at Weill Hall with James Levine and Daniel Barenboim.\n\nThis event is generously supported by Rolex"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=9SFUeOpfSNE",
        "youtube_video_id": "9SFUeOpfSNE",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 5595
      },
      "level": 1
    },
    {
      "id": "yt-tAXg28TpR-Q",
      "name": "Joyce DiDonato Masterclass - Maria Fiselier",
      "sort_order": 7,
      "image_url": "https://i.ytimg.com/vi/tAXg28TpR-Q/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "International mezzo-soprano Joyce DiDonato coaches the next generation of opera talent from The National Opera Studio. With Maria Fiselier (mezzo soprano) and Berrak Dyer (piano) performing Contro un cor che accende amore from Rossini's Il barbiere di Siviglia.\n\nwww.roh.org.uk/insights\nwww.nationaloperastudio.org.uk"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=tAXg28TpR-Q",
        "youtube_video_id": "tAXg28TpR-Q",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 861
      },
      "level": 1
    },
    {
      "id": "yt-CYDjmUrXXN4",
      "name": "Joyce DiDonato Masterclass - Nicolas Darmanin",
      "sort_order": 8,
      "image_url": "https://i.ytimg.com/vi/CYDjmUrXXN4/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "International mezzo-soprano Joyce DiDonato coaches the next generation of opera talent from The National Opera Studio. With Nicolas Darmanin (tenor) and Nicola Rose (piano) performing Cessa di più resistere from Rossini's Il barbiere di Siviglia.\n\nwww.roh.org.uk/insights\nwww.nationaloperastudio.org.uk\n\nThis video contains once instance of language that some people may find offensive."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=CYDjmUrXXN4",
        "youtube_video_id": "CYDjmUrXXN4",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 1273
      },
      "level": 1
    },
    {
      "id": "yt-O54l4aWBmMs",
      "name": "How to sing Wagner with Gwyneth Jones (The Royal Opera)",
      "sort_order": 9,
      "image_url": "https://i.ytimg.com/vi/O54l4aWBmMs/hqdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Join renowned Wagnerian soprano Dame Gwyneth Jones as she coaches David Butt Philip playing the part of Siegmund in the Wintersturme from Act 1 of Wagner's Die Walküre. \n\nFind out more at www.roh.org.uk"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=O54l4aWBmMs",
        "youtube_video_id": "O54l4aWBmMs",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 737
      },
      "level": 1
    },
    {
      "id": "yt-hCPZiKYDK68",
      "name": "Mark Elder introduces La bohème",
      "sort_order": 10,
      "image_url": "https://i.ytimg.com/vi/hCPZiKYDK68/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Watch conductor Mark Elder in a masterclass with two singers on Marcello and Mimì's duet from Act 3 of La bohème. With Jette Parker Young Artists Susana Gaspar and Michel de Souza. Mark Packwood (piano) \n\nFind out more at http://www.roh.org.uk"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=hCPZiKYDK68",
        "youtube_video_id": "hCPZiKYDK68",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 2101
      },
      "level": 1
    },
    {
      "id": "yt-sI-hwIcGgsU",
      "name": "Jonas Kaufmann and Antonio Pappano on the musical secrets of Verdi's Otello (The Royal Opera)",
      "sort_order": 11,
      "image_url": "https://i.ytimg.com/vi/sI-hwIcGgsU/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Tenor Jonas Kaufmann and conductor Antonio Pappano reveal the musical secrets of Verdi's opera Otello, and what makes it such a challenge for singers. Find out more at www.roh.org.uk/otello\n\nOtello is Verdi’s final tragedy. After astonishing productivity in his early career, the composer slowed in later life; more than fifteen years separate Otello and its predecessor, Aida, although Verdi revised his earlier works Simon Boccanegra and Don Carlo in the interim. He was lured out of retirement by the composer and librettist Arrigo Boito, who tempted him with a proposal that was very close to Verdi’s heart: Shakespeare’s Othello. Boito adapted the libretto from Shakespeare’s play, with much intervention from Verdi. As the latest utterance from the master of Italian opera, the 1887 premiere was an instant success – but, more than that, Otello has been an important part of the international opera repertory ever since.\n\nThe Italian musical landscape had changed during Verdi’s period of isolation, with many of his compatriots finding inspiration in foreign operatic innovations. Verdi responds in Otello with music that looks back to the traditional forms and structures of Italian opera, but which carries an unmistakably different dramatic thrust and fluidity, in response to Shakespeare’s text. The results are thrilling: from the violent storm that opens the opera through to Iago’s blood-chilling Credo and Otello’s increasingly desperate duets with Desdemona. Keith Warner (Wozzeck, Der Ring des Nibelungen) directs a new production of this masterpiece, The Royal Opera’s first in 30 years."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=sI-hwIcGgsU",
        "youtube_video_id": "sI-hwIcGgsU",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 278
      },
      "level": 1
    },
    {
      "id": "yt-ZzMlM46urfo",
      "name": "Eugene Onegin in rehearsal - Royal Opera LIVE",
      "sort_order": 12,
      "image_url": "https://i.ytimg.com/vi/ZzMlM46urfo/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Find out more: https://www.roh.org.uk/tickets-and-events/eugene-onegin-details\n\nOn Monday 7 January 2013, we opened up the Royal Opera House for a day of live streamed rehearsals, interviews and masterclasses. Join director Kasper Holten and singers Simon Keenlyside (Eugene Onegin) and Krassimira Stoyanova (Tatyana) as they rehearse a scene from Kasper's new production for the first time. With Robin Ticciati (conductor) and Mark Packwood (piano).\n\nGuidance - please note this film contains strong language."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=ZzMlM46urfo",
        "youtube_video_id": "ZzMlM46urfo",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 1226
      },
      "level": 1
    },
    {
      "id": "yt-WKpHZiTAjM0",
      "name": "Joyce DiDonato Masterclass - interview",
      "sort_order": 13,
      "image_url": "https://i.ytimg.com/vi/WKpHZiTAjM0/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Mezzo-soprano Joyce DiDonato talks about the challenges of singing Rossini and what it takes to become an opera star with Suzy Klein.\n\nwww.roh.org.uk/insights"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=WKpHZiTAjM0",
        "youtube_video_id": "WKpHZiTAjM0",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 882
      },
      "level": 1
    },
    {
      "id": "yt-8V84RCiq_rU",
      "name": "John Tomlinson's advice on singing opera (The Royal Opera)",
      "sort_order": 14,
      "image_url": "https://i.ytimg.com/vi/8V84RCiq_rU/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Operatic bass John Tomlinson speaks to Suzy Klein about what makes his voice special, how he prepares for a role and looks back over his career to date.\n\nFind out more at http://www.roh.org.uk\n\nBorn in Lancashire, Tomlinson read civil engineering at Manchester University and studied singing at the Royal Northern College of Music. He made his Bayreuth Festival debut in 1988 as Wotan (Der Ring des Nibelungen) under Barenboim, and sang at Bayreuth every year from 1988 to 2006. He has sung for English National Opera, at most of the leading opera houses in Europe, for the Metropolitan Opera, New York, and for the Salzburg, Aix-en-Provence, Munich and Glyndebourne festivals. Along with the main Wagner roles for bass and bass-baritone, his repertory has included Boris Godunov, Bluebeard, Baron Ochs (Der Rosenkavalier), Golaud (Pelléas et Mélisande), Claggart (Billy Budd), Philip II and the Grand Inquisitor (Don Carlo), Méphistophélès (Faust), the four villains (Les Contes d'Hoffmann), Boris Ismailov (Lady Macbeth of Mtsensk) and Moses (Moses und Aron). He created the roles of Green Knight (Gawain) and The Minotaur for Harrison Birtwistle at The Royal Opera.\n\nTomlinson's discography includes CDs of works by Handel, Mozart, Wagner and Stravinsky and DVDs of The Minotaur, Parsifal and Der Ring des Nibelungen."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=8V84RCiq_rU",
        "youtube_video_id": "8V84RCiq_rU",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 403
      },
      "level": 1
    },
    {
      "id": "yt-5LaXf9De1oo",
      "name": "Opera singing masterclass with Gerald Finley (The Royal Opera)",
      "sort_order": 15,
      "image_url": "https://i.ytimg.com/vi/5LaXf9De1oo/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Bass-baritone Gerald Finley coaches Jette Parker Young Artist Programme members Germán E. Alcántara and Blaise Malaba as part of a Royal Opera Masterclass, accompanied on piano by David Gowland.\n\nGerald Finley made his Royal Opera debut in 1989 in Don Carlo and since then has gone on to sing a number of major roles with the Company including in Don Giovanni, The Marriage of Figaro and La Traviata. \n\nFinley was born in Montreal, Canada and began singing as a chorister in Ottawa. He was encouraged by his great uncle William McKie, former organist of Westminster Abbey. He completed his musical studies at King’s College, Cambridge, the Royal College of Music and the National Opera Studio. He performs regularly for the world’s major opera houses and has created a number of roles, including Doctor Oppenheimer (Adams’s Doctor Atomic) and Harry Heegan (Turnage’s The Silver Tassie). In 2012 he sang his first Hans Sachs (Die Meistersinger von Nürnberg) for Glyndebourne Festival to great acclaim. In 2017 he made a role debut as the title role in Reimann’s Lear, and in 2019 made his role debut as Bluebeard (Duke Bluebeard’s Castle). He gives regular concerts and recitals, frequently touring Europe and North America with pianist Julius Drake.\n\nFinley has won several awards for his performances on CD and DVD, including a Grammy for Best Opera Recording 2012 (Dr Atomic at the Metropolitan Opera, New York), made many CDs of Lieder and song, and has appeared on films including Channel 4’s Owen Wingrave. He is a Visiting Professor and Fellow of the RCM. He was made an Officer of the Order of Canada in 2014, and that year climbed Mount Kilimanjaro in support of Help Musicians UK.\n\nEnjoy this video? Subscribe to our channel to receive notifications about new ballet and opera clips."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=5LaXf9De1oo",
        "youtube_video_id": "5LaXf9De1oo",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 6015
      },
      "level": 1
    },
    {
      "id": "yt-tCnQ4pu_0Ic",
      "name": "John Tomlinson Parsifal Masterclass (The Royal Opera)",
      "sort_order": 16,
      "image_url": "https://i.ytimg.com/vi/tCnQ4pu_0Ic/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Join Wagnerian legend Sir John Tomlinson as he coaches a young tenor in the final scene from Act 3 of Wagner's Parsifal. At this moment in the opera, Parsifal heals Amfortas with the Spear.\n\nFind out more at www.roh.org.uk/parsifal\n\nThe creative team behind The Royal Opera's production of The Minotaur, director Stephen Langridge and designer Alison Chitty, bring a new staging of Parsifal to Covent Garden. Parsifal, Wagner's final opera, was first given at Bayreuth in 1882. For many years, at the insistence of Wagner and then his widow Cosima, performances outside the Bayreuth Festival were banned. This embargo was lifted in January 1914; by August of the same year Parsifal had been performed at more than fifty opera houses throughout Europe.\n\nWagner loosely based the opera on scenes from Wolfram von Eschenbach's medieval romance Parzifal. The score contrasts the sacred with the sensual, from the stark magnificence of the music for the procession to the Grail Hall in Act I to the richly orchestrated scene in which Kundry attempts to seduce Parsifal in Act II. There are sections of almost unearthly beauty such as the Act I Prologue, the Good Friday music in Act III, and the closing scene of the opera, in which Parsifal reveals the Grail to the knights."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=tCnQ4pu_0Ic",
        "youtube_video_id": "tCnQ4pu_0Ic",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 779
      },
      "level": 1
    },
    {
      "id": "yt-2-NjRPH9JPw",
      "name": "John Tomlinson The Ring Masterclass (The Royal Opera)",
      "sort_order": 17,
      "image_url": "https://i.ytimg.com/vi/2-NjRPH9JPw/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Perhaps the most successful Wotan of his generation, join Sir John Tomlinson as he coaches mezzo soprano Rhonda Browne in the role of Erda from Wagner's epic Ring Cycle.\n\nWith David Syrus at the piano."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=2-NjRPH9JPw",
        "youtube_video_id": "2-NjRPH9JPw",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 859
      },
      "level": 1
    },
    {
      "id": "yt-r_3i1bzthDQ",
      "name": "Janet Baker and Joyce DiDonato's tips for singers (The Royal Opera)",
      "sort_order": 18,
      "image_url": "https://i.ytimg.com/vi/r_3i1bzthDQ/hqdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Janet Baker and Joyce DiDonato discuss what makes a great singer, and offer their advice on how to approach an opera performance. Find out more at http://www.roh.org.uk\n\nJanet Baker was particularly closely associated with baroque and early Italian opera and the works of Benjamin Britten. During her career, which spanned the 1950s to the 1980s, she was considered an outstanding singing actress and widely admired for her dramatic intensity, perhaps best represented in her famous portrayal as Dido, the tragic heroine of Berlioz's magnum opus, Les Troyens."
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=r_3i1bzthDQ",
        "youtube_video_id": "r_3i1bzthDQ",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 232
      },
      "level": 1
    },
    {
      "id": "yt-cvougSEs81k",
      "name": "The secrets of playing one of opera's greatest bad guys",
      "sort_order": 19,
      "image_url": "https://i.ytimg.com/vi/cvougSEs81k/maxresdefault.jpg",
      "keywords": [
        "Royal Ballet and Opera"
      ],
      "sections": {
        "Creator's Notes": "Baritone Gerald Finley reveals what it takes to learn and sing the role of one of opera's greatest baddies, Scarpia from Puccini's Tosca. Find out more at http://www.roh.org.uk/tosca\n\nFrom its strident opening chords, Tosca conjures up a world of political instability and menace. The Chief of Police, Scarpia – one of the most malevolent villains in opera – ruthlessly pursues and tortures enemies of the state. His dark, demonic music contrasts with the expansive melodies of the idealistic lovers, Tosca and Cavaradossi, who express their passion in sublime arias, including ‘Vissi d’arte’ and ‘E lucevan le stelle’. Giacomo Puccini’s dramatic work was a hit with audiences on its 1900 premiere and it remains one of the most performed of all operas – and with its gripping plot and glorious music, it’s easy to see why.\n\nA candle-lit church, Scarpia’s gloomy study with its hidden torture chamber and the false optimism of a Roman dawn: Jonathan Kent’s handsome production throws into relief the ruthlessly taut drama, as the tension is wound up towards its fateful conclusion. Puccini’s meticulously researched score is infused with the same authentic detail, from distant cannon fire during the Act I Te Deum to tolling church bells and the sounds of a firing squad.\n\nhttp://www.roh.org.uk/people/gerald-finley"
      },
      "metadata": {
        "youtube_url": "https://youtube.com/watch?v=cvougSEs81k",
        "youtube_video_id": "cvougSEs81k",
        "channel": "Royal Ballet and Opera",
        "duration_seconds": 224
      },
      "level": 1
    }
  ],
  "creator_name": "",
  "creator_link": "",
  "is_published": true,
  "created_at": "2026-01-27T03:25:55.907Z"
}